[
  {
    "department": "MA",
    "level": 1,
    "sem": "1 and 2",
    "code": "MA1133",
    "type": "Core",
    "title": "Foundations in Math I",
    "description": "This course aims to develop some understanding of the essential concepts of mathematics covering arithmetic, algebra and geometry. Topics include algebraic  manipulation,  indices laws, simultaneous linear equations,  proportions, mensuration, loci, and coordinate geometry.",
    "mcs": 6,
    "prerequisites": "None",
    "preclusions": "",
    "corequisites": "",
    "hrs": 3,
    "remarks": "Year long course"
  },
  {
    "department": "MA",
    "level": 1,
    "sem": 1,
    "code": "MA1231",
    "type": "Elective",
    "title": "Math Olympiad Training I",
    "description": "This course provides students with a taste of Olympiad-type mathematics. Students are expected to participate in the Singapore Mathematical Olympiad (Junior).",
    "mcs": 2,
    "prerequisites": "None",
    "preclusions": "",
    "corequisites": "",
    "hrs": 1.5,
    "remarks": ""
  },
  {
    "department": "MA",
    "level": 1,
    "sem": 2,
    "code": "MA1232",
    "type": "Elective",
    "title": "Math Olympiad Training II",
    "description": "This course targets high ability students who are keen to prepare themselves rigorously for the Singapore Mathematical Olympiad (Junior).",
    "mcs": 2,
    "prerequisites": "MA1231, Department Approval",
    "preclusions": "",
    "corequisites": "MA1232V",
    "hrs": 1.5,
    "remarks": ""
  },
  {
    "department": "MA",
    "level": 1,
    "sem": 2,
    "code": "MA1232V",
    "type": "Elective",
    "title": "Math Olympiad Training II",
    "description": "This course targets high ability students who are keen to prepare themselves rigorously for the Singapore Mathematical Olympiad (Junior). The course is taught by an external trainer.",
    "mcs": 2,
    "prerequisites": "MA1231, Department Approval",
    "preclusions": "",
    "corequisites": "",
    "hrs": 1.5,
    "remarks": ""
  },
  {
    "department": "MA",
    "level": 1,
    "sem": "1 or 2",
    "code": "MA1331",
    "type": "Enrichment",
    "title": "Fun with Fractals",
    "description": "This enrichment course explores the topic of fractals through a series of hands-on activities and experimentation. Students are expected to work in groups to produce a product demonstrating fractal properties by the end of the course.",
    "mcs": 2,
    "prerequisites": "None",
    "preclusions": "",
    "corequisites": "",
    "hrs": 1.5,
    "remarks": ""
  },
  {
    "department": "MA",
    "level": 2,
    "sem": "1 and 2",
    "code": "MA2133",
    "type": "Core",
    "title": "Foundations in Math II",
    "description": "Building on the year 1 foundations, this course aims to introduce trigonometry, matrices, set notation, probability, statistics & 2D vectors. Topics also include quadratic functions and inequalities, congruency and similarity, circle geometry.",
    "mcs": 8,
    "prerequisites": "MA1133",
    "preclusions": "",
    "corequisites": "",
    "hrs": 4,
    "remarks": "Year long course"
  },
  {
    "department": "MA",
    "level": 2,
    "sem": 1,
    "code": "MA2231",
    "type": "Elective",
    "title": "Math Olympiad Training III",
    "description": "This course builds upon the previous Junior Olympiad training. It targets high ability students who are keen to prepare themselves rigorously for the Singapore Mathematical Olympiad (Senior).",
    "mcs": 2,
    "prerequisites": "MA1232, Department Approval",
    "preclusions": "",
    "corequisites": "MA2231V",
    "hrs": 1.5,
    "remarks": ""
  },
  {
    "department": "MA",
    "level": 2,
    "sem": 1,
    "code": "MA2231V",
    "type": "Elective",
    "title": "Math Olympiad Training III",
    "description": "This course builds upon the previous Junior Olympiad training. It targets high ability students who are keen to prepare themselves rigorously for the Singapore Mathematical Olympiad (Senior). The course is taught by an external trainer.",
    "mcs": 2,
    "prerequisites": "MA1232V, Department Approval",
    "preclusions": "",
    "corequisites": "",
    "hrs": 1.5,
    "remarks": ""
  },
  {
    "department": "MA",
    "level": 2,
    "sem": 2,
    "code": "MA2232",
    "type": "Elective",
    "title": "Math Olympiad Training IV",
    "description": "This course targets high ability students who are keen to prepare themselves rigorously for the Singapore Mathematical Olympiad (Senior).",
    "mcs": 2,
    "prerequisites": "MA2231, Department Approval",
    "preclusions": "",
    "corequisites": "MA2232V",
    "hrs": 1.5,
    "remarks": ""
  },
  {
    "department": "MA",
    "level": 2,
    "sem": 2,
    "code": "MA2232V",
    "type": "Elective",
    "title": "Math Olympiad Training IV",
    "description": "This course targets high ability students who are keen to prepare themselves rigorously for the Singapore Mathematical Olympiad (Senior). The course is taught by an external trainer.",
    "mcs": 2,
    "prerequisites": "MA2231V, Department Approval",
    "preclusions": "",
    "corequisites": "",
    "hrs": 1.5,
    "remarks": ""
  },
  {
    "department": "MA",
    "level": 3,
    "sem": "1 and 2",
    "code": "MA3133",
    "type": "Core",
    "title": "Foundations in Math III",
    "description": "This course aims to model and solve problems through the study of functions including quadratic, polynomial, modulus, exponential, logarithmic, trigonometric and rational functions. Mathematical method taught include partial fractions, remainder-factor theorem and binomial theorem. Finally, this course will culminate with the introduction of calculus.",
    "mcs": 8,
    "prerequisites": "MA2133",
    "preclusions": "",
    "corequisites": "",
    "hrs": 4,
    "remarks": "Year long course"
  },
  {
    "department": "MA",
    "level": 3,
    "sem": 1,
    "code": "MA3231",
    "type": "Elective",
    "title": "Math Olympiad Training V",
    "description": "This course builds upon the previous Senior Olympiad training.",
    "mcs": 2,
    "prerequisites": "MA2232, Department Approval",
    "preclusions": "",
    "corequisites": "MA3231V",
    "hrs": 1.5,
    "remarks": ""
  },
  {
    "department": "MA",
    "level": 3,
    "sem": 1,
    "code": "MA3231V",
    "type": "Elective",
    "title": "Math Olympiad Training V",
    "description": "This course builds upon the previous Senior Olympiad training. The course is taught by an external trainer.",
    "mcs": 2,
    "prerequisites": "MA2232V, Department Approval",
    "preclusions": "",
    "corequisites": "",
    "hrs": 1.5,
    "remarks": ""
  },
  {
    "department": "MA",
    "level": 3,
    "sem": 1,
    "code": "MA3331",
    "type": "Enrichment",
    "title": "Foundation Mathematics (Bridging course)",
    "description": "This bridging course is compulsory for second intake students. It covers concepts like rules of indices, surds, set theory and geometric properties of circle. Students will perform simple operations with indices and surds, including rationalizing the denominator. The Cartesian coordinates system will be used to analyze geometrical situations and solve related problems. Basic counting techniques, probability and data analysis are taught too.",
    "mcs": 3,
    "prerequisites": "None",
    "preclusions": "",
    "corequisites": "",
    "hrs": 1.5,
    "remarks": "Bridging course (For new Yr 3 intake only)"
  },
  {
    "department": "MA",
    "level": 4,
    "sem": 1,
    "code": "MA4131",
    "type": "Core (Major)",
    "title": "Advanced Math IA",
    "description": "This course covers topics such as number sequences, summation of series, arithmetic and geometric series. There will also be discussion on the complex numbers system, where numbers can be expressed in Cartesian or polar forms. Students will learn to represent complex numbers in the Argand diagram. Further work will also be done on calculus and various methods of proofs.",
    "mcs": 5,
    "prerequisites": "MA3133",
    "preclusions": "",
    "corequisites": "",
    "hrs": 5,
    "remarks": ""
  },
  {
    "department": "MA",
    "level": 4,
    "sem": 2,
    "code": "MA4132",
    "type": "Core (Major)",
    "title": "Advanced Math IB",
    "description": "Transformation of graphs and vectors in 3D are introduced in this course. Further topics in calculus that will be covered include analysis of graphs, Maclaurin series (including binomial), integration techniques and applications of integrals to find area and volume.",
    "mcs": 5,
    "prerequisites": "MA4131",
    "preclusions": "",
    "corequisites": "",
    "hrs": 5,
    "remarks": ""
  },
  {
    "department": "MA",
    "level": 4,
    "sem": 1,
    "code": "MA4231V",
    "type": "Elective",
    "title": "Math Olympiad Training VI",
    "description": "This course targets high ability students who are keen to prepare themselves rigorously for the Singapore Mathematical Olympiad (Senior and Open).",
    "mcs": 2,
    "prerequisites": "MA3231V, Department Approval",
    "preclusions": "",
    "corequisites": "",
    "hrs": 1.5,
    "remarks": ""
  },
  {
    "department": "MA",
    "level": 5,
    "sem": 1,
    "code": "MA5131",
    "type": "Core (Major)",
    "title": "Advanced Calculus",
    "description": "This demanding and rigorous course introduces calculus typically covered in a university course. Continuity and differentiability of functions are introduced. Topics include fundamental theorem of calculus, Intermediate Value Theorem, Mean Value Theorem, limits of functions, asymptotic and unbounded behavior. First and second order differential equations and their applications to real-life problems will also be taught.",
    "mcs": 5,
    "prerequisites": "MA4132",
    "preclusions": "",
    "corequisites": "",
    "hrs": 5,
    "remarks": ""
  },
  {
    "department": "MA",
    "level": 5,
    "sem": 2,
    "code": "MA5132",
    "type": "Core (Major)",
    "title": "Statistics",
    "description": "This course is a comprehensive study of various probability distributions and statistical concepts. Topics include Binomial Distribution, Poisson Distribution, Normal Distribution, Sampling Distribution, t-distribution, test of significance, correlation and linear regression. Exploring random phenomena using probability and simulation will also be discussed.",
    "mcs": 5,
    "prerequisites": "MA2132",
    "preclusions": "",
    "corequisites": "",
    "hrs": 5,
    "remarks": ""
  },
  {
    "department": "MA",
    "level": 5,
    "sem": 1,
    "code": "MA5231V",
    "type": "Elective",
    "title": "Math Olympiad Training VII",
    "description": "This course targets high ability students who are keen to prepare themselves rigorously for the Singapore Mathematical Olympiad (Open).",
    "mcs": 2,
    "prerequisites": "MA4231V, Department Approval",
    "preclusions": "",
    "corequisites": "",
    "hrs": 1.5,
    "remarks": ""
  },
  {
    "department": "MA",
    "level": 5,
    "sem": 1,
    "code": "MA5431",
    "type": "Honours",
    "title": "Linear Algebra",
    "description": "This Honours course introduces students to the operations on matrices and its applications to solving system of linear equations. Topics on vector spaces, linear transformations, rank and nullity, eigenvalues and eigenvectors will also be explored.",
    "mcs": 2,
    "prerequisites": "MA4132",
    "preclusions": "",
    "corequisites": "",
    "hrs": 2,
    "remarks": "+ Students majoring with Honours in Mathematics must complete at least 8 UNITs of the Honours courses."
  },
  {
    "department": "MA",
    "level": 5,
    "sem": 2,
    "code": "MA5431V",
    "type": "Honours in lieu",
    "title": "NUS/MA2001 Linear Algebra",
    "description": "This is an NUS course in-lieu of NUSHS Linear Algebra course. This course is a first course in linear algebra.  Fundamental concepts of linear algebra will be introduced and investigated in the context of the Euclidean spaces R^n.  Proofs of results will be presented in the concrete setting.  Students are expected to acquire computational facilities and geometric intuition with regard to vectors and matrices.  Some applications will be presented. Major topics: Systems of linear equations, matrices, determinants, Euclidean spaces, linear combinations and linear span, subspaces, linear independence, bases and dimension, rank of a matrix, inner products, eigenvalues andeigenvectors, diagonalization, linear transformations between Euclidean spaces, applications.",
    "mcs": 4,
    "prerequisites": "MA5131, Department Approval",
    "preclusions": "Student can only take MA5431 or MA5431V to fulfil math honours program.",
    "corequisites": "",
    "hrs": 4,
    "remarks": "In order to fulfil Math Honours, a student must take: 1.MA5431V (4UNIT) and MA6431V (4UNIT), OR  2.MA5431 (2UNIT) and MA6431V (4UNIT) and MA6432/MA6433(2UNIT), OR  3.MA5431 (2UNIT), MA5432 (2UNIT) and MA6431V (4UNIT)  A total of 8 UNIT."
  },
  {
    "department": "MA",
    "level": 5,
    "sem": 2,
    "code": "MA5432",
    "type": "Honours",
    "title": "Polar Coordinates, Parametric Equations and Vector Functions",
    "description": "In this course, students will explore the polar coordinate system. Parametric equations are introduced. Derivatives and integrals of polar, parametric and vector functions will also be taught.",
    "mcs": 2,
    "prerequisites": "MA5131",
    "preclusions": "",
    "corequisites": "",
    "hrs": 2,
    "remarks": "+ Students majoring with Honours in Mathematics must complete at least 8 UNITs of the Honours courses."
  },
  {
    "department": "MA",
    "level": 6,
    "sem": 1,
    "code": "MA6131",
    "type": "Core (Major)",
    "title": "Advanced Statistics",
    "description": "This demanding and rigorous course is a continuation of the previous statistics course. Topics include t-distribution and chi-square distribution. Estimation, test of significance, correlation and linear regression will be revisited at a deeper level. Design of experiments and survey methodology will also be covered.",
    "mcs": 5,
    "prerequisites": "MA5132",
    "preclusions": "",
    "corequisites": "",
    "hrs": 5,
    "remarks": ""
  },
  {
    "department": "MA",
    "level": 6,
    "sem": 2,
    "code": "MA6132",
    "type": "Core (Major)",
    "title": "Advanced Math II",
    "description": "This course revisits concepts covered in earlier Advanced Mathematics courses and extends it further. Students will learn to solve 3D vectors problem involving lines and planes. The use of De Moivre’s theorem to find the nth roots of a complex number and to prove mathematical results will also be covered. Theory of equations (up to degree 4) and recurrence relations will be taught too.",
    "mcs": 5,
    "prerequisites": "MA4132, MA5131",
    "preclusions": "",
    "corequisites": "",
    "hrs": 5,
    "remarks": ""
  },
  {
    "department": "MA",
    "level": 6,
    "sem": 1,
    "code": "MA6431",
    "type": "Honours",
    "title": "Honours Calculus",
    "description": "This demanding and rigorous Honours course exposes students to advanced applications of calculus involving parametric, polar and vector functions as well as polynomial approximations and convergence of series. Formal definitions of continuity and differentiability are also introduced. This course is more than sufficiently prepared to take the AP Calculus BC examination. Those who are keen may also try for the NUS Advanced Placement Credit Exam in Calculus.",
    "mcs": 2,
    "prerequisites": "MA5432",
    "preclusions": "",
    "corequisites": "",
    "hrs": 2,
    "remarks": "+ Students majoring with Honours in Mathematics must complete at least 8 UNITs of the Honours courses."
  },
  {
    "department": "MA",
    "level": 6,
    "sem": 1,
    "code": "MA6431V",
    "type": "Honours in lieu",
    "title": "NUS/MA2002 Calculus",
    "description": "This is an NUS course in-lieu of NUSHS Honours Calculus course. This is a course in single-variable calculus which will introduce precise definitions of limit, continuity, the derivative and the Riemann integral.  Students will be exposed to computational techniques and applications of differentiation and integration.  This course concludes with an introduction to first order differential equations.",
    "mcs": 4,
    "prerequisites": "MA5131, Department Approval",
    "preclusions": "Student can only take MA6431 or MA6431V to fulfil math honours program.",
    "corequisites": "",
    "hrs": 4,
    "remarks": "In order to fulfil Math Honours, a student must take: 1.MA5431V (4UNIT) and MA6431V (4UNIT), OR  2.MA5431 (2UNIT) and MA6431V (4UNIT) and MA6432/MA6433 (2UNIT), OR  3.MA5431 (2UNIT), MA5432 (2UNIT) and MA6431V (4UNIT)  A total of 8 UNIT."
  },
  {
    "department": "MA",
    "level": 6,
    "sem": 2,
    "code": "MA6432",
    "type": "Honours",
    "title": "Numerical Analysis",
    "description": "This course covers a variety of numerical approaches to find approximate solutions to problems that are not open to the analytical approach. Concepts covered include numerical solutions to linearequations, numerical estimation of definite integrals and solving differential equations numerically.",
    "mcs": 2,
    "prerequisites": "MA6431/MA6431V",
    "preclusions": "",
    "corequisites": "",
    "hrs": 2,
    "remarks": "+ Students majoring with Honours in Mathematics must complete at least 8 UNITs of the Honours courses.^Students either take MA6432 or MA6433."
  },
  {
    "department": "MA",
    "level": 6,
    "sem": 2,
    "code": "MA6433",
    "type": "Honours",
    "title": "Graph Theory",
    "description": "Graph Theory is a branch of discrete mathematics which deals with discrete objects and quantities and has wide applications, particularly in computer science and engineering. In this course, students will learn the nature and properties of simple graphs, and different types of graphs such as connected graphs, regular graphs, complete graphs, bipartite graphs and trees. They will also learn the application of graph theory including tournament, matching, and scheduling problems.",
    "mcs": 2,
    "prerequisites": "MA6431/MA6431V",
    "preclusions": "",
    "corequisites": "",
    "hrs": 2,
    "remarks": "+ Students majoring with Honours in Mathematics must complete at least 8 UNITs of the Honours courses. ^Students either take MA6432 or MA6433."
  },
  {
    "department": "CS",
    "level": 1,
    "sem": 2,
    "code": "CS1131",
    "type": "Core",
    "title": "Computational Thinking",
    "description": "Computational thinking is taking an approach to solving problems, designing systems and understanding human behaviour that draws on fundamental concepts in computer science. This course consists of three main units: 1) Problem Solving, 2) Programming Principles & Concepts and 3) Data Skills. Students will be able to 1) Learn and apply a variety of problem-solving techniques to discover a solution to problems that are situated in a variety of contexts. 2) Understand basic programming principles and concepts such as iterations, conditionals and variables using turtle graphics. 3) Perform simple data cleaning, analysis and visualization using various functions in Excel and learn about the importance of data security.",
    "mcs": 2,
    "prerequisites": "None",
    "preclusions": "",
    "corequisites": "",
    "hrs": 2,
    "remarks": ""
  },
  {
    "department": "CS",
    "level": 2,
    "sem": 1,
    "code": "CS2231",
    "type": "Elective",
    "title": "Introduction to Programming",
    "description": "This elective will introduce to students basic programming principles and concepts. Students will learn about important programming concepts such as variables, data types, assignment statements and expressions, conditional statements, loops and list. Students who have completed the course would be able to write useful programs to solve problems.",
    "mcs": 2,
    "prerequisites": "CS1131",
    "preclusions": "",
    "corequisites": "",
    "hrs": 1.5,
    "remarks": ""
  },
  {
    "department": "CS",
    "level": 2,
    "sem": 2,
    "code": "CS2233",
    "type": "Elective",
    "title": "Problem Solving in Computing",
    "description": "The aim of this course is to introduce students to the discipline of computing and to the problem solving process. Students will apply the programming concepts learnt to solve various problems.",
    "mcs": 2,
    "prerequisites": "CS2231",
    "preclusions": "",
    "corequisites": "",
    "hrs": 1.5,
    "remarks": ""
  },
  {
    "department": "CS",
    "level": 3,
    "sem": 1,
    "code": "CS3231",
    "type": "Elective",
    "title": "Object Oriented Programming I",
    "description": "This course introduces the concepts of Object Oriented Programming (OOP) using Java. Topics include: Introduction to Java and OOP concepts, control flow, use of Java API, the use and design of classes and objects, use of Arrays & ArrayList, simple File IO & Exception handling, and creating Java GUI applications.",
    "mcs": 3,
    "prerequisites": "CS2231",
    "preclusions": "",
    "corequisites": "",
    "hrs": 3,
    "remarks": "# Students majoring in Computer Science (CS) in the Specialisation Years will have CS3231 and CS3233 reflected as CS3131 and CS3132 respectively as these electives will be converted to core courses for the CS Major and will be included in their CS Subject GPA."
  },
  {
    "department": "CS",
    "level": 3,
    "sem": 1,
    "code": "CS3232",
    "type": "Elective",
    "title": "Informatics Olympiad Training I",
    "description": "The Informatics Olympiad emphasizes creativity in problem solving on one hand, and programming skill and expertise on the other. This course targets high ability computing students who are keen to prepare themselves rigorously for various Informatics Olympiad competitions and at the same time hope to create more awareness among computing students on the finer points of programming, which is not merely writing a piece of code, but involves useful algorithmic techniques and problem-solving skills.",
    "mcs": 2,
    "prerequisites": "CS2233",
    "preclusions": "",
    "corequisites": "CS3231",
    "hrs": 1.5,
    "remarks": ""
  },
  {
    "department": "CS",
    "level": 3,
    "sem": 2,
    "code": "CS3233",
    "type": "Elective",
    "title": "Object Oriented Programming II",
    "description": "This course is the second part of a two-part series on introductory programming from an object-oriented perspective. It continues the introduction to object-oriented programming begun in CS3204, with an emphasis on more advanced concepts in OOP (e.g. inheritance, abstraction, polymorphism). Students will also learn how to create a Graphical User Interface in Java (JavaFX, Graphics, Animation etc).",
    "mcs": 3,
    "prerequisites": "CS3231",
    "preclusions": "",
    "corequisites": "",
    "hrs": 3,
    "remarks": "# Students majoring in Computer Science (CS) in the Specialisation Years will have CS3231 and CS3233 reflected as CS3131 and CS3132 respectively as these electives will be converted to core courses for the CS Major and will beincluded in their CS Subject GPA."
  },
  {
    "department": "CS",
    "level": 3,
    "sem": 2,
    "code": "CS3234",
    "type": "Elective",
    "title": "Informatics Olympiad Training II",
    "description": "This course targets high ability computing students who are keen to prepare themselves rigorously for the National Informatics Olympiad competition. Advanced algorithmic topics such as dynamic programming, graph algorithms, greedy algorithms, trees etc are covered in this course.",
    "mcs": 2,
    "prerequisites": "CS3232",
    "preclusions": "",
    "corequisites": "CS3233",
    "hrs": 1.5,
    "remarks": ""
  },
  {
    "department": "CS",
    "level": 4,
    "sem": 1,
    "code": "CS4131",
    "type": "Core (Major)",
    "title": "Mobile Application Development",
    "description": "This course introduces students to the design and implementation of Android applications for mobile devices. Students will develop an App from scratch, assuming a good knowledge of Java, and learn how to set up Android Studio, work with various Android building blocks (Activities, Services, Broadcast, etc) to create simple user interfaces to make Apps run smoothly. At the end of the course, students will learn skills for creating and deploying Android applications.",
    "mcs": 4,
    "prerequisites": "CS3233",
    "preclusions": "",
    "corequisites": "",
    "hrs": 3,
    "remarks": ""
  },
  {
    "department": "CS",
    "level": 4,
    "sem": 2,
    "code": "CS4132",
    "type": "Core (Major)",
    "title": "Data Analytics",
    "description": "This course aims to allow students to understand the foundational skills in data analytics, including preparing and working with data; abstracting and modeling an analytic question; and using tools from statistics, learning and mining to address these questions. Students will study techniques for how to go from raw data to a deeper understanding of the patterns and structures within the data, to support making predictions and decision making.",
    "mcs": 4,
    "prerequisites": "CS4131",
    "preclusions": "",
    "corequisites": "",
    "hrs": 3,
    "remarks": ""
  },
  {
    "department": "CS",
    "level": 4,
    "sem": 1,
    "code": "CS4231",
    "type": "Elective",
    "title": "Informatics Olympiad Training III",
    "description": "This course targets high ability computing students who are keen to prepare themselves rigorously for the National Olympiad in Informatics. Advanced data structures such as fenwick tree, segment tree and advanced algorithms such as dynamic programming will be discussed in the course.",
    "mcs": 2,
    "prerequisites": "CS3234",
    "preclusions": "",
    "corequisites": "",
    "hrs": 1.5,
    "remarks": ""
  },
  {
    "department": "CS",
    "level": 5,
    "sem": 1,
    "code": "CS5131",
    "type": "Core (Major)",
    "title": "Introduction to Artificial Intelligence",
    "description": "This course aims to introduce techniques to build computers that are capable of exhibiting intelligent behavior.  It will cover a wide range of modern Artificial Intelligence topics including search, logic, knowledge representation etc. The course will provide students with an overview of the applications of Artificial Intelligence.",
    "mcs": 4,
    "prerequisites": "CS4132 or CS4133V or CS4134V",
    "preclusions": "",
    "corequisites": "",
    "hrs": 3,
    "remarks": ""
  },
  {
    "department": "CS",
    "level": 5,
    "sem": 2,
    "code": "CS5132",
    "type": "Core (Major)",
    "title": "Data Structures and Algorithms",
    "description": "This course aims to introduce students to advanced data structures and algorithms in programming. Topics covered include: uses and implementations of abstraction and encapsulation through classic data structures (lists, stacks, queues, trees), basic algorithmic analysis, graph representation and various graph-search algorithms.",
    "mcs": 4,
    "prerequisites": "CS5131",
    "preclusions": "",
    "corequisites": "",
    "hrs": 3,
    "remarks": ""
  },
  {
    "department": "CS",
    "level": 5,
    "sem": "1 or 2",
    "code": "CS5431V",
    "type": "Honours in lieu",
    "title": "NUS/CS1231 Discrete Structures",
    "description": "This course is offered by NUS School of Computing as CS1231. This course introduces mathematical tools required in the study of computer science. Topics include: (1) Logic and proof techniques: propositions, conditionals, quantifications. (2) Relations and Functions: Equivalence relations and partitions. Partially ordered sets. Well-Ordering Principle. Function equality. Boolean/identity/inverse functions. Bijection. (3) Mathematical formulation of data models (linear model, trees, graphs). (4) Counting and Combinatoric: Pigeonhole Principle. Inclusion-Exclusion Principle. Number of relations on a set, number of injections from one finite set to another, Diagonalisation proof: An infinite countable set has an uncountable power set; Algorithmic proof: An infinite set has a countably infinite subset. Subsets of countable sets are countable.",
    "mcs": 4,
    "prerequisites": "CS4133V",
    "preclusions": "",
    "corequisites": "",
    "hrs": 4,
    "remarks": "# Students majoring with Honours in Computer Science and chosen to read Honours Track from NUS School of Computing (SoC) must read at least 2 options."
  },
  {
    "department": "CS",
    "level": 6,
    "sem": 1,
    "code": "CS6131",
    "type": "Core (Major)",
    "title": "Database Design",
    "description": "This course aims to equip students with the fundamental concepts of database design. The course covers data definition and modeling, database access and command languages, and design and implementation in the context of the relational database model.",
    "mcs": 4,
    "prerequisites": "CS5132",
    "preclusions": "",
    "corequisites": "",
    "hrs": 3,
    "remarks": ""
  },
  {
    "department": "CS",
    "level": 6,
    "sem": 2,
    "code": "CS6132",
    "type": "Core (Major)",
    "title": "Computer Networking & Security",
    "description": "This course aims to equip students with the fundamental concepts of computer networking. Students will acquire the basic knowledge of data transmission, TCP/IP protocol architecture, local area network technologies, wireless network and concept of network routing and forwarding. It also teaches the basic concepts and principles of information security, and the fundamental approaches to secure computers and networks.",
    "mcs": 4,
    "prerequisites": "CS6131",
    "preclusions": "",
    "corequisites": "",
    "hrs": 3,
    "remarks": ""
  },
  {
    "department": "CS",
    "level": 6,
    "sem": "1 or 2",
    "code": "CS6431V",
    "type": "Honours in lieu",
    "title": "NUS/CS2100 Computer Organisation",
    "description": "This course is offered by NUS School of Computing as CS2100. The objective of this course is to familiarise students with the fundamentals of computing devices. Through this course students will understand the basics of data representation, and how the various parts of a computer work, separately and with each other. This allows students to understand the issues in computing devices, and how these issues affect the implementation of solutions. Topics covered include data representation systems, combinational and sequential circuit design techniques, assembly language, processor execution cycles, pipelining, memory hierarchy and input/output systems.",
    "mcs": 4,
    "prerequisites": "CS4133V",
    "preclusions": "",
    "corequisites": "",
    "hrs": 4,
    "remarks": "# Students majoring with Honours in Computer Science and chosen to read Honours Track from NUS School of Computing (SoC) must read at least 2 options."
  },
  {
    "department": "CS",
    "level": 6,
    "sem": "1 or 2",
    "code": "CS6432V",
    "type": "Honours in lieu",
    "title": "NUS/CS2106 Introduction to Operating Systems",
    "description": "This course is offered by NUS School of Computing as CS2106. This course introduces the basic concepts in operating systems and links it with contemporary operating systems (eg. Unix/Linux and Windows). It focuses on OS structuring and architecture, processes, memory management, concurrency and file systems. Topics include kernel architecture, system calls, interrupts, models of processes, process abstraction and services, scheduling, review of physical memory and memory management hardware, kernel memory management, virtual memory and paging, caches, working set, deadlock, mutual exclusion, synchronization mechanisms, data and metadata in file systems, directories and structure, file system abstraction and operations. Examples will be discussed from contemporary operating systems such as Unix/Linux and/or Windows.",
    "mcs": 4,
    "prerequisites": "CS6431V",
    "preclusions": "",
    "corequisites": "",
    "hrs": 4,
    "remarks": "# Students majoring with Honours in Computer Science and chosen to read Honours Track from NUS School of Computing (SoC) must read at least 2 options."
  },
  {
    "department": "BL",
    "level": 1,
    "sem": "1 and 2",
    "code": "BL1131",
    "type": "Core",
    "title": "Foundations in Biology I",
    "description": "This is a year-long course that aims to develop students’ theoretical and practical competencies in biology, so that they will build a strong foundation, encompassing both breadth and depth, on which to further their studies in biology via the NUS High curriculum. The course begins with a macro perspective of life by getting students to explore how biotic and abiotic factors may influence the diversity and distribution of organisms, and discuss ethical issues related to the environment. Next, students will zoom into the study of the building blocks of life – cells. In order to support life, movement of biological molecules into and out of cells must occur – therefore mechanisms through which this can be facilitated are also subsequently studied. The biological molecules that move in and out of cells are also studied in detail; and students will also carry out investigations regarding how these substances can be identified. Lastly, students will explore the fate of biological molecules in plant systems with regards to nutrition. Three biological themes are addressed at various points during the course: the correlation between structure and function, the relation between a system and its parts, as well as the flow of energy through biological units. The discussion of bioethical issues is also infused at appropriate points. At the end of the course, it is hoped that students will be inspired to develop a passion for biology through acquiring a deep understanding of the concepts taught and awareness of their applications to daily life, through frequent hands-on activities designed to develop practical skills in a scaffolded manner, as well as through excursions and discussions.",
    "mcs": 4,
    "prerequisites": "None",
    "preclusions": "",
    "corequisites": "",
    "hrs": 2,
    "remarks": "Year long course"
  },
  {
    "department": "BL",
    "level": 2,
    "sem": "1 and 2",
    "code": "BL2131",
    "type": "Core",
    "title": "Foundations in Biology II",
    "description": "This year-long course will continue to equip students with the basic foundational knowledge required to learn biology at a more advanced level subsequently. The main topics that are covered in this course include nutrition and transport in humans, reproduction in flowering plants and humans, as well as respiration, excretion and homeostasis in humans. Where appropriate, various bioethical issues and laboratory experimentation will be covered at suitable junctures throughout the course. Laboratory practical sessions will serve to enhance students’ learning and understanding.",
    "mcs": 6,
    "prerequisites": "BL1131",
    "preclusions": "",
    "corequisites": "",
    "hrs": 3,
    "remarks": "Year long course"
  },
  {
    "department": "BL",
    "level": 2,
    "sem": 2,
    "code": "BL2233",
    "type": "Elective",
    "title": "Biology Olympiad Training I",
    "description": "This course is designed for selected Year 2 students with excellent performance in biology courses. These students will explore some challenging concepts not taught in the core courses. Students can expect rigorous training in a wide range of biology topics as well as answering techniques. Students will be encouraged to take part in various biology competitions where appropriate. This course is by invitation only.",
    "mcs": 2,
    "prerequisites": "Department Approval",
    "preclusions": "",
    "corequisites": "",
    "hrs": 1.5,
    "remarks": ""
  },
  {
    "department": "BL",
    "level": 3,
    "sem": "1 and 2",
    "code": "BL3131",
    "type": "Core",
    "title": "Foundations in Biology III",
    "description": "After acquiring the basic foundational knowledge in biology in Year 1 and 2, students will move on to learn about the human nervous, sensory, endocrine and excretory systems. In addition, how cell divides by mitosis and meiosis will also be covered before students learn about the concepts of inheritance and genetic variation. For the section on molecular genetics, the structure of DNA and its role in protein synthesis, genes, genetic engineering and medical biotechnology will be covered. The last part of the course focuses on in-depth study of the cell and molecules of life. It includes the functions of membrane systems and organelles in cells, the structures of biomolecules and their functions, as well as infectious diseases in humans. Where appropriate, various bioethical issues and laboratory experimentation will be covered at suitable junctures throughout the course.",
    "mcs": 6,
    "prerequisites": "BL2131",
    "preclusions": "",
    "corequisites": "",
    "hrs": 3,
    "remarks": "Year long course"
  },
  {
    "department": "BL",
    "level": 3,
    "sem": 1,
    "code": "BL3233",
    "type": "Elective",
    "title": "Biology Olympiad Training II",
    "description": "This course is designed for students who like to challenge themselves with the difficult concepts in biology. They will learn additional topics and explore the concepts beyond what they have covered in their Year 3 core biology course in greater depth. It also prepares them for the UK Biology Challenge that is opened to all students who are 13 to 15 years old, as well as the Singapore Junior Biology Olympia (SJBO) that is opened to Year 2 to 4 students. This course is by invitation only.",
    "mcs": 2,
    "prerequisites": "Department Approval",
    "preclusions": "",
    "corequisites": "",
    "hrs": 1.5,
    "remarks": ""
  },
  {
    "department": "BL",
    "level": 3,
    "sem": 2,
    "code": "BL3234",
    "type": "Elective",
    "title": "Biology Olympiad Training III",
    "description": "This course is for students who have done well in BL3233. It is also open to Year 3 students whose Semester 1 performance in BL3131 is consistently excellent. These students will explore some challenging concepts not taught in the core courses. Students can expect rigorous training in biology topics that will prepare them for the following year’s biology competitions. This course is by invitation only.",
    "mcs": 2,
    "prerequisites": "Department Approval",
    "preclusions": "",
    "corequisites": "",
    "hrs": 1.5,
    "remarks": ""
  },
  {
    "department": "BL",
    "level": 3,
    "sem": 1,
    "code": "BL3331",
    "type": "Enrichment",
    "title": "Foundations In General Biology",
    "description": "This is a bridging course offered to the yearly intake of new Year 3 students. Students will be guided to review the foundational knowledge in Year 1 and Year 2 biology courses such as ecology, cell biology and physiology. The key emphasis of the course is on the development and familiarization of hands-on practical skills that will facilitate the learning of biology. Laboratory skills involving microscopy, microbiological and physiological techniques will be taught.",
    "mcs": 2,
    "prerequisites": "None",
    "preclusions": "",
    "corequisites": "",
    "hrs": 1.5,
    "remarks": "Bridging course (For new Yr 3 intake only)"
  },
  {
    "department": "BL",
    "level": 4,
    "sem": "1 and 2",
    "code": "BL4131",
    "type": "Core (Major)",
    "title": "Advanced Biology I",
    "description": "Based on the foundation that students have built in the lower years, this course will explore various biological topics in greater depth. The topics covered include mode of action of enzymes, eukaryotic chromatin, genome organization, control of gene expression, mutations, cancer biology, energy and equilibrium, as well as biological evolution. Where appropriate, various bioethical issues and laboratory experimentation will be covered at suitable junctures throughout the course.",
    "mcs": 8,
    "prerequisites": "BL3131",
    "preclusions": "",
    "corequisites": "",
    "hrs": 4,
    "remarks": "Year long course"
  },
  {
    "department": "BL",
    "level": 4,
    "sem": 1,
    "code": "BL4233",
    "type": "Elective",
    "title": "Biology Olympiad Training IV",
    "description": "This course is designed for selected Year 4 students with consistently excellent performance in their previous years’ biology courses. They will be trained for the Singapore Junior Biology Olympiad (SJBO). Students can expect rigorous training in topics that are not taught in the core courses. This course is by invitation only.",
    "mcs": 2,
    "prerequisites": "Department Approval",
    "preclusions": "",
    "corequisites": "",
    "hrs": 1.5,
    "remarks": ""
  },
  {
    "department": "BL",
    "level": 4,
    "sem": 2,
    "code": "BL4234",
    "type": "Elective",
    "title": "Biology Olympiad Training V",
    "description": "This course is for students who have done well for BL4233 or those whose Semester 1 performance in BL4131 is consistently excellent. Students will be rigorously trained in topics of biology that are not covered in the core courses. The training is an important preparation for the Singapore Biology Olympiad (SBO) in the following year. This course is by invitation only.",
    "mcs": 2,
    "prerequisites": "Department Approval",
    "preclusions": "",
    "corequisites": "",
    "hrs": 1.5,
    "remarks": ""
  },
  {
    "department": "BL",
    "level": 5,
    "sem": "1 and 2",
    "code": "BL5131",
    "type": "Core (Major)",
    "title": "Advanced Biology II",
    "description": "This course builds on what students have learnt from BL4131, Advanced Biology I. Students will deepen their understanding of various advanced level biological topics which they will be exploring in a rigorous manner. The course deepens students’ understanding of the following fields: ecology, physiology, genetics, and cytology. Students’ knowledge of biochemistry, evolution and biodiversity is also strengthened and broadened through the infusion of concepts and ideas from these fields throughout the course. Focus is deliberately placed on the applications of concepts learnt within the course to issues encountered in daily life or at the national and global level, which involves the consideration of other disciplines. Besides cross-disciplinary links, the course focuses on drawing links between the different fields of biology. The course covers an ecology curriculum that is unique to NUS High School. It also covers infectious diseases, DNA technology, and neuronal signalling. Through the course, the big idea of evolutionary pressures and the trade-offs between different evolutionary strategies, across the different topics, is emphasised. Where appropriate, various bioethical issues will also be explored. Besides field work, students will also begiven the opportunity to experience the following in a hands-on manner: running statistical simulations and analyses using ICT tools, simulating intra-specific and inter-specific competition, carrying out gene cloning, using ELISA to diagnose HIV, and measuring the effect of neuromodulators on action potentials generated in the nervous system of a cricket.",
    "mcs": 8,
    "prerequisites": "BL4131",
    "preclusions": "",
    "corequisites": "",
    "hrs": 4,
    "remarks": "Year long course"
  },
  {
    "department": "BL",
    "level": 5,
    "sem": 1,
    "code": "BL5233",
    "type": "Elective",
    "title": "Biology Olympiad Training VI",
    "description": "This course is designed for selected students with consistently excellent performance in their previous years’ biology courses. They will be trained for the Singapore Biology Olympiad (SBO). Students can expect rigorous training in a wide range of biology topics as well as answering techniques. This course is by invitation only.",
    "mcs": 2,
    "prerequisites": "Department Approval",
    "preclusions": "",
    "corequisites": "",
    "hrs": 1.5,
    "remarks": ""
  },
  {
    "department": "BL",
    "level": 5,
    "sem": 2,
    "code": "BL5234",
    "type": "Elective",
    "title": "Biology Olympiad Training VII",
    "description": "This course is for students who have done well for BL5233 or those who are invited to read it due to their consistently excellent performance in their Year 5 biology courses. They will go through rigorous preparation for Singapore Biology Olympiad (SBO), which will be held in November (Theory Round) and December (Practical Round). A final selection of students to represent the school in SBO will be made at the end of this course.",
    "mcs": 2,
    "prerequisites": "Department Approval",
    "preclusions": "",
    "corequisites": "",
    "hrs": 1.5,
    "remarks": ""
  },
  {
    "department": "BL",
    "level": 5,
    "sem": 1,
    "code": "BL5431",
    "type": "Honours",
    "title": "Advanced Biology III",
    "description": "This course provides an exciting platform for the study of invertebrate animal diversity. It gives a brief introduction to the science behind classification by learning about taxonomy and phylogeny. Students will learn about the different invertebrate taxa, with an emphasis on diagnostic characteristics, evolutionary relationships, functional adaptations and environmental interactions. The interdisciplinary nature of this course aims to develop in students a deeper understanding and appreciation of the evolutionary innovations in the animal kingdom. Laboratory practicals conducted in this course will allow students to examine specimens in details. Field trips will also be organised for students to learn about taxonomical work and the natural heritage of Singapore.",
    "mcs": 2,
    "prerequisites": "BL4131",
    "preclusions": "",
    "corequisites": "",
    "hrs": 2,
    "remarks": ""
  },
  {
    "department": "BL",
    "level": 5,
    "sem": 2,
    "code": "BL5432",
    "type": "Honours",
    "title": "Advanced Biology IV",
    "description": "This course focuses on vertebrate organisms and is a continuation of the previous course which focuses on invertebrates. Students will learn about the different vertebrate taxa, with an emphasis on diagnostic characteristics, evolutionary relationships, functional adaptations and environmental interactions. The  interdisciplinary nature of this course allows students to develop a deep understanding and appreciation of the evolutionary innovations in the animal kingdom. Laboratory practicals and relevant field trips will conducted for students to learn about taxonomical work and the natural heritage of Singapore.",
    "mcs": 2,
    "prerequisites": "BL4131",
    "preclusions": "",
    "corequisites": "",
    "hrs": 2,
    "remarks": ""
  },
  {
    "department": "BL",
    "level": 5,
    "sem": 2,
    "code": "BL5434V",
    "type": "Honours in lieu",
    "title": "NUS/LSM2107 Evolutionary Biology",
    "description": "Evolutionary biology covers the history of life on our planet and the processes that produced the multiple life forms of Earth. Topics include: the origins of life, the eukaryotic cell, and multicellularity; the generation of genetic variation and the sorting of that variation through random processes and through natural and sexual selection; the origin of new traits, new life histories, and new species; the origins of sex, sociality, and altruism; the evolution of humans; and applications of evolutionary biology to solving modern-day problems.",
    "mcs": 4,
    "prerequisites": "BL4131",
    "preclusions": "",
    "corequisites": "",
    "hrs": 4,
    "remarks": "LSM2107 has a quota of 5 students per semester that is set by NUS"
  },
  {
    "department": "BL",
    "level": 6,
    "sem": "1 and 2",
    "code": "BL6131",
    "type": "Core (Major)",
    "title": "Applied Biology",
    "description": "After acquiring advanced-level knowledge in biology from previous courses, this course enables students to appreciate the application aspects of biology. The emphasis on current trends in biology and relevant contemporary issues will give students the opportunity to understand the significance of what they are learning and how knowledge and technology could be harnessed to tackle real life problems. The topics covered include bioethics, the impact of climate change on plants and animals, as well as microbiology and its environmental applications.",
    "mcs": 8,
    "prerequisites": "BL4131 and BL5131",
    "preclusions": "",
    "corequisites": "",
    "hrs": 4,
    "remarks": "Year long course"
  },
  {
    "department": "BL",
    "level": 6,
    "sem": 1,
    "code": "BL6431",
    "type": "Honours",
    "title": "Advanced Molecular Genetics I",
    "description": "This course builds upon students' foundational understanding of molecular genetics and its practical applications. It explores essential topics, including forward and reverse genetics, tools for studying gene expression, recombinant protein production, and protein-protein interactions. In the laboratory, students will conduct hands-on experiments, such as RNA extraction, reverse transcription PCR, gel electrophoresis, gel extraction, TA cloning, bacterial transformation, and blue-white selection, cultivating valuable proficiencies in molecular biology and genetics research. These skills are not only beneficial for future studies but also serve as a solid foundation for pursuing careers in biotechnology, biomedicine, and related fields.",
    "mcs": 2,
    "prerequisites": "BL4131 and BL5131",
    "preclusions": "",
    "corequisites": "",
    "hrs": 2,
    "remarks": ""
  },
  {
    "department": "BL",
    "level": 6,
    "sem": 2,
    "code": "BL6432",
    "type": "Honours",
    "title": "Advanced Molecular Genetics II",
    "description": "This course builds upon students' foundational knowledge of molecular genetics and its practical applications, with a specific emphasis on the interplay between protein structure and function. It underscores the importance of comprehending the chemical properties of proteins when selecting appropriate and efficient laboratory methods for tasks such as protein extraction, detection, purification, and quantification. Students will gain a deep understanding of the core principles underpinning these laboratory techniques and how they are applied to protein studies. These studies act as a vital link between basic research and clinical medicine, offering valuable insights into diseases, aiding drug development, facilitating early diagnosis, and enabling personalized treatments.",
    "mcs": 2,
    "prerequisites": "BL4131 and BL5131",
    "preclusions": "",
    "corequisites": "",
    "hrs": 2,
    "remarks": ""
  },
  {
    "department": "BL",
    "level": 6,
    "sem": 1,
    "code": "BL6435V",
    "type": "Honours in lieu",
    "title": "NUS/LSM2106 Fundamental Biochemistry",
    "description": "The objective is to provide the student with a firm and rigorous foundation in current concepts of the structure and functions of biomolecules in molecular cellular biology. These fundamental concepts form the basis of almost all recent advances in biological and the biomedical sciences. The lectures will introduce various cellular organelles as models to gain insights into how structures and functions of classes of biomolecules participating in important cellular processes.",
    "mcs": 4,
    "prerequisites": "BL4131",
    "preclusions": "",
    "corequisites": "",
    "hrs": 4,
    "remarks": "LSM2106 has a quota of 5 students per semester that is set by NUS"
  },
  {
    "department": "BL",
    "level": 6,
    "sem": 1,
    "code": "BL6436V",
    "type": "Honours in lieu",
    "title": "NUS/LSM2105 Molecular Genetics",
    "description": "This course covers topics on (i) the patterns of inheritance, (ii) the molecular properties of genes and chromosomes, (iii) transcription and translation, (iv) genetic methods and technology, and (v) genetic analysis of individuals and populations. This will include an in-depth understanding of mendelian patterns of inheritance and variations that could occur due to multiple alleles, lethal genes, chromosomal variations, linkage, gene interaction and other genetic phenomena. Emphasis is placed on the understanding of the underlying molecular and biochemical basis of inheritance. Quantitative and population genetics will also be discussed with the emphasis of understanding the processes and forces in nature that promote genetic changes.",
    "mcs": 4,
    "prerequisites": "BL4131",
    "preclusions": "",
    "corequisites": "",
    "hrs": 4,
    "remarks": "LSM2105 has a quota of 5 students per semester that is set by NUS"
  },
  {
    "department": "CM",
    "level": 1,
    "sem": "1 and 2",
    "code": "CM1131",
    "type": "Core",
    "title": "Foundations in Chemistry I",
    "description": "This is a year-long course that is designed to introduce students to basic ideas and principles in Chemistry and places emphasis on understanding and application of scientific concepts. Topics covered include experimental chemistry, kinetic theory of matter, acid-base reactions, as well as chemical bonding, formulae and equations. As Chemistry is an experimental science, students will have numerous opportunities to handle basic laboratory apparatus during the practical sessions. The knowledge and skills introduced in this course are essential to the understanding of Chemistry in the more advanced courses.",
    "mcs": 4,
    "prerequisites": "None",
    "preclusions": "",
    "corequisites": "",
    "hrs": 2,
    "remarks": "Year long course"
  },
  {
    "department": "CM",
    "level": 1,
    "sem": "1 and 2",
    "code": "CM1331",
    "type": "Enrichment",
    "title": "Chemical Potpourri I",
    "description": "This lab-based course covers a series of chemical investigations ranging over several areas of Chemistry. Students can look forward to activities which complement the formal study of Chemistry in the classroom and provide opportunities for developing analytical skills in dealing with chemical problems.",
    "mcs": 2,
    "prerequisites": "None",
    "preclusions": "",
    "corequisites": "",
    "hrs": 1.5,
    "remarks": ""
  },
  {
    "department": "CM",
    "level": 2,
    "sem": "1 and 2",
    "code": "CM2131",
    "type": "Core",
    "title": "Foundations in Chemistry II",
    "description": "This year-long course is a continuation from Foundations in Chemistry I, and aims to strengthen the fundamental chemistry concepts required for chemistry students to appreciate and master the chemistry courses taught at higher levels. The emphasis in this course is to enable students to apply their foundational knowledge of the various aspects of chemistry in understanding chemical reactions including precipitation, acid-base and redox reactions. Emphasis will also be given to practical skills required for the volumetric and qualitative analysis of chemicals.",
    "mcs": 6,
    "prerequisites": "CM1131",
    "preclusions": "",
    "corequisites": "",
    "hrs": 3,
    "remarks": "Year long course"
  },
  {
    "department": "CM",
    "level": 2,
    "sem": 2,
    "code": "CM2231",
    "type": "Elective",
    "title": "Chemistry Olympiad Training I",
    "description": "This introductory course serves to engage talented students with a more in-depth study of the concepts learnt in Year 1 and 2 core courses, with the incorporation of some new concepts. It also serves to train the students’ problem-solving ability and nurture their scientific common sense.",
    "mcs": 2,
    "prerequisites": "Department Approval",
    "preclusions": "",
    "corequisites": "",
    "hrs": 1.5,
    "remarks": ""
  },
  {
    "department": "CM",
    "level": 2,
    "sem": "1 or 2",
    "code": "CM2331",
    "type": "Enrichment",
    "title": "Chemical Potpourri II",
    "description": "Chemistry plays an integral role in the daily running of our lives. This course aims to continue to give students insight and appreciation of the chemistry that affects our daily activities through chemical investigations that range over several areas of Chemistry, such as the food we eat and the soaps we use.",
    "mcs": 2,
    "prerequisites": "CM1131",
    "preclusions": "",
    "corequisites": "",
    "hrs": 1.5,
    "remarks": ""
  },
  {
    "department": "CM",
    "level": 3,
    "sem": "1 and 2",
    "code": "CM3131",
    "type": "Core",
    "title": "Foundations in Chemistry III",
    "description": "This course extends the concepts covered in the first two foundation courses.  It will introduce students to the fascinating world of Organic Chemistry and also delve a little deeper into Chemical Bonding. Other topics covered include Energy Changes and Redox Reactions. Concluding this course, students will consolidate what they have learnt in the foundation years.",
    "mcs": 6,
    "prerequisites": "CM2131",
    "preclusions": "",
    "corequisites": "",
    "hrs": 3,
    "remarks": "Year long course"
  },
  {
    "department": "CM",
    "level": 3,
    "sem": 1,
    "code": "CM3231",
    "type": "Elective",
    "title": "Chemistry Olympiad Training II",
    "description": "This course serves to engage talented students in chemistry with a more in-depth study of topics learnt in Years 1-3 core courses. New concepts will be included and many are built on the key understanding of the concepts acquired previously. This course also aims to train the students’ problem solving ability and nurture their scientific skills to get them better prepared for the Olympiad competitions.",
    "mcs": 2,
    "prerequisites": "Department Approval",
    "preclusions": "",
    "corequisites": "",
    "hrs": 1.5,
    "remarks": ""
  },
  {
    "department": "CM",
    "level": 3,
    "sem": 2,
    "code": "CM3232",
    "type": "Elective",
    "title": "Chemistry Olympiad Training III",
    "description": "This course serves to engage talented students in chemistry with a more in-depth study of topics learnt in Years 1-3 core courses. Newconcepts will be included and many are built on the key understanding of the concepts acquired previously. This course also aims to train the students’ problem solving ability and nurture their scientific skills to get them better prepared for the Olympiad competitions.",
    "mcs": 2,
    "prerequisites": "Department Approval",
    "preclusions": "",
    "corequisites": "",
    "hrs": 1.5,
    "remarks": ""
  },
  {
    "department": "CM",
    "level": 3,
    "sem": 1,
    "code": "CM3332",
    "type": "Enrichment",
    "title": "Foundations in Chemistry (Bridging)",
    "description": "This is a bridging course for new students joining our school at Year 3.  It aims to allow students to master fundamental chemistry knowledge which will be required for the understanding of higher chemistry courses. There will also be hands-on experience in volumetric analysis and basic chemical analysis.",
    "mcs": 2,
    "prerequisites": "Department Approval",
    "preclusions": "",
    "corequisites": "",
    "hrs": 1.5,
    "remarks": "Bridging course (For new Yr 3 intake only)"
  },
  {
    "department": "CM",
    "level": 4,
    "sem": 1,
    "code": "CM4131",
    "type": "Core (Major)",
    "title": "Principles of Inorganic Chemistry and Structure of Matter",
    "description": "The course introduces the basic ideas of Quantum Theory, describes the electronic structures of the elements in the Periodic Table and explains the periodicity of the atomic properties of the elements. It continues with the Valence Bond Theory and the concept of hybridisation in describing the formation of covalent bonds. Structures and properties of gases, liquids and solutions are then examined in greater detail. The course concludes with the principles of Inorganic Chemistry, focusing on the key ideas such as the Uniqueness Principle, the Diagonal Effect, the Inert-pair effect, Lewis acid/base, p𝜋-d𝜋 bonding and the acid-base nature of oxides.",
    "mcs": 4,
    "prerequisites": "CM3131",
    "preclusions": "",
    "corequisites": "",
    "hrs": 4,
    "remarks": ""
  },
  {
    "department": "CM",
    "level": 4,
    "sem": 2,
    "code": "CM4132",
    "type": "Core (Major)",
    "title": "Chemical Kinetics and Equilibria",
    "description": "Chemical Kinetics is the study of rates of chemical reactions. The course introduces the Collision theory to explain how various factors affect rates of reactions. It also covers in depth the quantitative description of reaction kinetics, followed by proposing reaction mechanisms that are consistent with experimental rate laws. The concept of Equilibrium is fundamental in almost all chemical reactions, as well as many physical processes. This course explores the idea of reversible reactions, dynamic equilibrium in a closed chemical system, and how various factors can influence an equilibrium system. With this understanding, we will be able to describe chemical equilibrium quantitatively using equilibrium constants. The course also deals with various homogeneous and heterogeneous equilibria in depth, ranging from gaseous equilibria to aqueous equilibria of weak acids and bases, buffer solutions and sparingly soluble salts.",
    "mcs": 4,
    "prerequisites": "CM4131",
    "preclusions": "",
    "corequisites": "",
    "hrs": 4,
    "remarks": ""
  },
  {
    "department": "CM",
    "level": 4,
    "sem": 1,
    "code": "CM4231",
    "type": "Elective",
    "title": "Chemistry Olympiad Training IV",
    "description": "These are chemistry elective courses specially designed for Year 4 students who have done very well in chemistry and show potential in handling more challenging content and tackling harder physical chemistry problems.",
    "mcs": 2,
    "prerequisites": "Department Approval",
    "preclusions": "",
    "corequisites": "",
    "hrs": 1.5,
    "remarks": ""
  },
  {
    "department": "CM",
    "level": 4,
    "sem": 2,
    "code": "CM4232",
    "type": "Elective",
    "title": "Chemistry Olympiad Training V",
    "description": "These are chemistry elective courses specially designed for Year 4 students who have done very well in chemistry and show potential in handling more challenging content and tackling harder physical chemistry problems.",
    "mcs": 2,
    "prerequisites": "Department Approval",
    "preclusions": "",
    "corequisites": "",
    "hrs": 1.5,
    "remarks": ""
  },
  {
    "department": "CM",
    "level": 5,
    "sem": 1,
    "code": "CM5131",
    "type": "Core (Major)",
    "title": "Organic Chemistry",
    "description": "Organic chemistry has been the frontier of chemical research. It surrounds us in every part of our life and its knowledge transcends all disciplines of science. The vast majority of chemical compounds known to man are organic; that is, they are compounds built on a carbon framework. Organic compounds vary greatly in size and complexity, from the simplest hydrocarbon, methane, to macromolecules, made up of thousands of atoms. This course buildson the foundation from Year 3 and students can expect to learn more oragnic reactions and delve deeper into the mechanisms.",
    "mcs": 4,
    "prerequisites": "CM4131 and CM4132",
    "preclusions": "",
    "corequisites": "",
    "hrs": 4,
    "remarks": ""
  },
  {
    "department": "CM",
    "level": 5,
    "sem": 2,
    "code": "CM5132",
    "type": "Core (Major)",
    "title": "Thermodynamics and Electrochemistry",
    "description": "Chemical Thermodynamics is the study of the interrelation of heat and work with chemical reactions. The course makes use of the First Law of Thermodynamics to establish an understanding of enthalpy change of reaction and focuses on the measurements of enthalpy changes by calorimetry, and the calculations of enthalpy changes by the Hess’ Law. The course further makes use of the Second Law of Thermodynamics, focusing on the use of Gibbs free energy change, to predict and explain the spontaneity of a reaction under a specific set of conditions. The Third Law of Thermodynamics is also discussed in order to have a complete understanding of entropy changes of reactions. Building upon the redox as well as reactivity concepts covered in the foundation years, this course will delve deeper into electrochemistry, covering the principles underlying the function of galvanic cells and the selective discharge of ions in electrolytic cells.",
    "mcs": 4,
    "prerequisites": "CM4131 and CM4132",
    "preclusions": "",
    "corequisites": "",
    "hrs": 4,
    "remarks": ""
  },
  {
    "department": "CM",
    "level": 5,
    "sem": 1,
    "code": "CM5231",
    "type": "Elective",
    "title": "Chemistry Olympiad Training VI",
    "description": "These are chemistry elective courses specially designed for Year 5 students who have done very well in chemistry and display a strong passion for the subject. During the course, students must show potential in handling more challenging content and tackling higher order chemistry problems. Students who exhibit high level of understanding and competence may eventually be shortlisted for the Singapore Chemistry Olympiad (SChO).",
    "mcs": 2,
    "prerequisites": "Department Approval",
    "preclusions": "",
    "corequisites": "",
    "hrs": 1.5,
    "remarks": ""
  },
  {
    "department": "CM",
    "level": 5,
    "sem": 2,
    "code": "CM5232",
    "type": "Elective",
    "title": "Chemistry Olympiad Training VII",
    "description": "These are chemistry elective courses specially designed for Year 5 students who have done very well in chemistry and display a strong passion for the subject. During the course, students must show potential in handling more challenging content and tackling higher order chemistry problems. Students who exhibit high level of understanding and competence may eventually be shortlisted for the Singapore Chemistry Olympiad (SChO).",
    "mcs": 2,
    "prerequisites": "Department Approval",
    "preclusions": "",
    "corequisites": "",
    "hrs": 1.5,
    "remarks": ""
  },
  {
    "department": "CM",
    "level": 5,
    "sem": 1,
    "code": "CM5431",
    "type": "Honours",
    "title": "Separation Science",
    "description": "This course covers the various aspects of separation techniques used in modern day chemistry.  Students will gain an understanding of distillation, extraction, and various chromatographic methods, including Thin Layer Chromatography (TLC), gas chromatography (GC), ion-exchange chromatography and high performance liquid chromatography (HPLC). Students will also gain practical experience into these topics.",
    "mcs": 2,
    "prerequisites": "CM4131 and CM4132",
    "preclusions": "",
    "corequisites": "",
    "hrs": 2,
    "remarks": ""
  },
  {
    "department": "CM",
    "level": 5,
    "sem": 2,
    "code": "CM5432",
    "type": "Honours Option",
    "title": "Structural Elucidation",
    "description": "This course covers the different approaches and methods that are employed by scientists in modern day chemistry to deduce the structural features of unknown compounds. Some of the characterization techniques covered will include nuclear magnetic resonance (NMR) spectroscopy, mass spectrometry (MS), and infrared (IR) spectroscopy. These analytical skills will aid them greatly in their pursuit, particularly in Science and Engineering.",
    "mcs": 2,
    "prerequisites": "CM5131",
    "preclusions": "",
    "corequisites": "",
    "hrs": 2,
    "remarks": ""
  },
  {
    "department": "CM",
    "level": 5,
    "sem": 2,
    "code": "CM5433",
    "type": "Honours Option",
    "title": "Principles of Chemical Engineering",
    "description": "This course provides students with a basic concept of chemical engineering processes and related problem-solving methods. It provides an introduction to the principles of chemical engineering process analysis. The course discusses details of steady state material and energy balances, including recycles, bypass, purge,phase change and chemical reactions. Other topics include simultaneous mass and energy balances. Students taking this course must have a strong foundation in mathematics.",
    "mcs": 2,
    "prerequisites": "CM5131",
    "preclusions": "",
    "corequisites": "",
    "hrs": 2,
    "remarks": ""
  },
  {
    "department": "CM",
    "level": 5,
    "sem": 2,
    "code": "CM5436V",
    "type": "Honours in lieu",
    "title": "NUS/CM1102 Chemistry - The Central Science",
    "description": "The course takes on a thematic approach to illustrate core concepts and the central role it plays in science. The three main themes are – the Environment, Materials and Life. Issues such as global warming, industrialization, energy, sustainability, biomedical advancement, etc. will be discussed. Students will get to appreciate key scientific fundamentals, explore real issues and deliberate on possible future solutions.",
    "mcs": 4,
    "prerequisites": "CM5131 and Department Approval",
    "preclusions": "",
    "corequisites": "",
    "hrs": 4,
    "remarks": ""
  },
  {
    "department": "CM",
    "level": 6,
    "sem": 1,
    "code": "CM5436V",
    "type": "Honours in lieu",
    "title": "NUS/CM1102 Chemistry - The Central Science",
    "description": "The course takes on a thematic approach to illustrate core concepts and the central role it plays in science. The three main themes are – the Environment, Materials and Life. Issues such as global warming, industrialization, energy, sustainability, biomedical advancement, etc. will be discussed. Students will get to appreciate key scientific fundamentals, explore real issues and deliberate on possible future solutions.",
    "mcs": 4,
    "prerequisites": "CM5131 and Department Approval",
    "preclusions": "",
    "corequisites": "",
    "hrs": 4,
    "remarks": "Re-offered by NUS this semester. Catered to students on the NUSH hybrid track"
  },
  {
    "department": "CM",
    "level": 6,
    "sem": 1,
    "code": "CM6131",
    "type": "Core (Major)",
    "title": "Chemistry in Context",
    "description": "This course aims to allow students to explore various commonly encountered contexts where chemistry is applied in areas of industry, research, pharmaceuticals, forensics as examples. Over the course of the course, key cornerstone chemical concepts – the big ideas, the enduring understanding and essential knowledge in chemistry will be revisited and consolidated.",
    "mcs": 4,
    "prerequisites": "CM5131 and CM5132",
    "preclusions": "",
    "corequisites": "",
    "hrs": 4,
    "remarks": ""
  },
  {
    "department": "CM",
    "level": 6,
    "sem": 2,
    "code": "CM6132",
    "type": "Core (Major)",
    "title": "Experiments in Synthetic Chemistry",
    "description": "This course provides an introductory experience in laboratory synthesis and analytical techniques. Chemical synthesis is one of the most valuable skills to learn in a chemistry laboratory and these practical sessions are designed to provide a thorough training in elementary techniques commonly employed in synthetic chemistry. Analytical techniques such as chromatography will also be featured in this highly intensive laboratory course.",
    "mcs": 4,
    "prerequisites": "CM5131 and CM5132",
    "preclusions": "",
    "corequisites": "",
    "hrs": 4,
    "remarks": ""
  },
  {
    "department": "CM",
    "level": 6,
    "sem": 2,
    "code": "CM6431",
    "type": "Honours",
    "title": "Emerging Trends in Chemistry",
    "description": "This course aims to equip students with an understanding of the current and emerging issues that affect us and how chemistry is linked to these issues.  These include organocatalysis, graphene chemistry, organic chemistry, environmental chemistry, nanochemistry, medicinal chemistry and inorganic chemistry. Guest speakers will be invited to discuss their current research, and the latest technology and developments in Chemistry.",
    "mcs": 2,
    "prerequisites": "CM5131 and CM5132",
    "preclusions": "",
    "corequisites": "",
    "hrs": 2,
    "remarks": ""
  },
  {
    "department": "CM",
    "level": 6,
    "sem": 2,
    "code": "CM6432",
    "type": "Honours Option",
    "title": "Advanced Organic Chemistry",
    "description": "Organic chemistry surrounds us in every part of our life and its knowledge transcends all disciplines of science. The vast majority of chemical compounds known to man are organic; that is, they are compounds built on a carbon framework. Organic compounds vary greatly in size and complexity, from the simplest hydrocarbon, methane, to macromolecules, made up of thousands of atoms. In this advanced course, students will go more in depth and scope of the types of reactions they have learnt in the previous organic chemistry course.",
    "mcs": 2,
    "prerequisites": "CM5131",
    "preclusions": "",
    "corequisites": "",
    "hrs": 2,
    "remarks": ""
  },
  {
    "department": "CM",
    "level": 6,
    "sem": 2,
    "code": "CM6433",
    "type": "Honours Option",
    "title": "Quantum Chemistry and its Applications",
    "description": "This course aims to provide students with the understanding of the physical and mathematical aspects of quantum chemistry and molecular electronic structure. Areas to be covered include history and development, basic principles and Schrodinger equation,common approximations and molecular geometry predictions. A strong foundation in mathematics is important for this course.",
    "mcs": 2,
    "prerequisites": "CM5131 and CM5132",
    "preclusions": "",
    "corequisites": "",
    "hrs": 2,
    "remarks": ""
  },
  {
    "department": "CM",
    "level": 6,
    "sem": 1,
    "code": "CM6436V",
    "type": "Honours in lieu",
    "title": "NUS/CM2133 Foundations of Physical Chemistry",
    "description": "Students will learn how the wavefunction description of matter leads to energy quantization. This concept is applied to spectroscopic techniques of UV-visible, FTIR, Raman and NMR spectroscopy. The laws of thermodynamics that characterize and govern physical chemical systems will also be included and applied to phase and chemical equilibria. In chemical kinetics, the rate laws, reaction mechanisms and simple rate theories will be discussed.",
    "mcs": 4,
    "prerequisites": "NUS CM1102 and Department Approval",
    "preclusions": "",
    "corequisites": "",
    "hrs": 4,
    "remarks": ""
  },
  {
    "department": "PC",
    "level": 1,
    "sem": "1 and 2",
    "code": "PC1131",
    "type": "Core",
    "title": "Foundations in Physics I",
    "description": "This course provides an introduction to some foundational topics in Physics. These include Physical Quantities, Units & Measurement, Mass, Weight & Density, General Wave Properties, Sound, Light and the Electromagnetic Spectrum.",
    "mcs": 4,
    "prerequisites": "None",
    "preclusions": "",
    "corequisites": "",
    "hrs": 2,
    "remarks": "Year long course"
  },
  {
    "department": "PC",
    "level": 1,
    "sem": 1,
    "code": "PC1331",
    "type": "Enrichment",
    "title": "Robotics I",
    "description": "This course aims to spark the interest of students in the field of robotics and artificial intelligence through the use of animatronics and applied A.I resources. They will learn how to use engines and libraries to generate poems and/or lyrics, where they will then program their robot heads to mouth the words in a realistic manner. The course is conducted by an external vendor and the total cost per student is S$100. For Singaporean students, Edusave Fund may be used for this payment.",
    "mcs": 2,
    "prerequisites": "None",
    "preclusions": "",
    "corequisites": "",
    "hrs": 1.5,
    "remarks": "This course is offered subject to teaching manpower availability"
  },
  {
    "department": "PC",
    "level": 1,
    "sem": 2,
    "code": "PC1332",
    "type": "Enrichment",
    "title": "Robotics II",
    "description": "This course is a hands-on introduction to robotics through the mechanical building and control of a tracked vehicle and a turret. Students will learn to integrate modular electronics and sensor technology with the Raspberry Pi Pico microcontroller, while controlling the mobile vehicle from the PC using the python programming language. The workshop culminates with a mini friendly competition on the final lesson based on a set course and terrain. The course is conducted by an external vendor and a course fee is applicable. For Singaporean students, Edusave Fund may be used for this payment.",
    "mcs": 2,
    "prerequisites": "None",
    "preclusions": "",
    "corequisites": "",
    "hrs": 1.5,
    "remarks": "This course is offered subject to teaching manpower availability"
  },
  {
    "department": "PC",
    "level": 1,
    "sem": 2,
    "code": "PC1333",
    "type": "Enrichment",
    "title": "Introductory Astronomy",
    "description": "This course provides an introduction to some introductory topics in astronomy. These include the structure of the universe, models of the solar system, the celestial sphere and tools of astronomy, including telescopes & charge-coupled devices.",
    "mcs": 2,
    "prerequisites": "None",
    "preclusions": "",
    "corequisites": "",
    "hrs": 1.5,
    "remarks": "This course is offered subject to teaching manpower availability"
  },
  {
    "department": "PC",
    "level": 2,
    "sem": "1 and 2",
    "code": "PC2131",
    "type": "Core",
    "title": "Foundations in Physics II",
    "description": "This course provides an introduction to some foundational topics in Physics. These include Kinematics, Dynamics, Work, Energy, Power, Pressure, Kinetic Model of Matter, Thermal Physics, Internal Energy and Radioactivity.",
    "mcs": 6,
    "prerequisites": "PC1131",
    "preclusions": "",
    "corequisites": "",
    "hrs": 3,
    "remarks": "Year long course"
  },
  {
    "department": "PC",
    "level": 2,
    "sem": 2,
    "code": "PC2231",
    "type": "Elective",
    "title": "Physics Olympiad Training I",
    "description": "This course covers challenging problems in physics and can be taken as preparation for the Singapore Junior Physics Olympiad (SJPO).",
    "mcs": 2,
    "prerequisites": "None",
    "preclusions": "",
    "corequisites": "",
    "hrs": 1.5,
    "remarks": ""
  },
  {
    "department": "PC",
    "level": 2,
    "sem": 1,
    "code": "PC2331",
    "type": "Enrichment",
    "title": "Robotics III",
    "description": "This course aims to introduce students to retro game programming on a handheld retro game console. They will learn to program their own game using the retroPy game engine and micro python. Games will be run on a handheld game console running Raspberry Pi’s micro controller that they will design and build. The course culminates in a mini game competition. The course is conducted by an external vendor and a course fee is applicable. For Singaporean students, Edusave Fund may be used for this payment.",
    "mcs": 2,
    "prerequisites": "None",
    "preclusions": "",
    "corequisites": "",
    "hrs": 1.5,
    "remarks": "This course is offered subject to teaching manpower availability"
  },
  {
    "department": "PC",
    "level": 2,
    "sem": 2,
    "code": "PC2332",
    "type": "Enrichment",
    "title": "Robotics IV",
    "description": "To be updated by Semester 2 of 2025",
    "mcs": 2,
    "prerequisites": "None",
    "preclusions": "",
    "corequisites": "",
    "hrs": 1.5,
    "remarks": "This course is offered subject to teaching manpower availability"
  },
  {
    "department": "PC",
    "level": 2,
    "sem": 1,
    "code": "PC2333",
    "type": "Enrichment",
    "title": "Astronomy I",
    "description": "This course provides an introduction to further topics in astronomy. These include stars (including Herzspring-Russell diagrams), the evolution of stars, galaxies and cosmology.",
    "mcs": 2,
    "prerequisites": "None",
    "preclusions": "",
    "corequisites": "",
    "hrs": 1.5,
    "remarks": "This course is offered subject to teaching manpower availability"
  },
  {
    "department": "PC",
    "level": 3,
    "sem": "1 and 2",
    "code": "PC3131",
    "type": "Core",
    "title": "Foundations in Physics III",
    "description": "This course provides an introduction to some foundational topics in Physics in Electricity and Magnetism. This course also develops concepts in Mechanics. Students will study topics of forces, dynamics, torque and equilibrium, and work, energy and power in greater detail.",
    "mcs": 6,
    "prerequisites": "PC2131",
    "preclusions": "",
    "corequisites": "",
    "hrs": 3,
    "remarks": "Year long course"
  },
  {
    "department": "PC",
    "level": 3,
    "sem": 1,
    "code": "PC3231",
    "type": "Elective",
    "title": "Physics Olympiad Training II",
    "description": "This course covers challenging problems in physics and can be taken as preparation for the Singapore Junior Physics Olympiad (SJPO).",
    "mcs": 2,
    "prerequisites": "PC2231",
    "preclusions": "",
    "corequisites": "",
    "hrs": 1.5,
    "remarks": ""
  },
  {
    "department": "PC",
    "level": 3,
    "sem": 2,
    "code": "PC3232",
    "type": "Elective",
    "title": "Physics Olympiad Training III",
    "description": "This course covers challenging problems in physics and can be taken as preparation for the Singapore Junior Physics Olympiad (SJPO).",
    "mcs": 2,
    "prerequisites": "PC3231",
    "preclusions": "",
    "corequisites": "",
    "hrs": 1.5,
    "remarks": ""
  },
  {
    "department": "PC",
    "level": 3,
    "sem": 2,
    "code": "PC3331",
    "type": "Enrichment",
    "title": "Astronomy II",
    "description": "This course provides an introduction to further topics in astronomy These include the sun, the solar system and other planetary systems.",
    "mcs": 2,
    "prerequisites": "None",
    "preclusions": "",
    "corequisites": "",
    "hrs": 1.5,
    "remarks": "This course is offered subject to teaching manpower availability"
  },
  {
    "department": "PC",
    "level": 3,
    "sem": 1,
    "code": "PC3333",
    "type": "Enrichment",
    "title": "Physics Bridging",
    "description": "This course revisits the topics taught in Year 1 and Year 2 and is targeted at students who join the school in Year 3.",
    "mcs": 2,
    "prerequisites": "None",
    "preclusions": "",
    "corequisites": "",
    "hrs": 1.5,
    "remarks": "Bridging course (For new Yr 3 intake only)"
  },
  {
    "department": "PC",
    "level": 4,
    "sem": "1 and 2",
    "code": "PC4141",
    "type": "Core (Major)",
    "title": "Advanced Physics I",
    "description": "This course provides an introduction to some advanced topics in Mechanics and E&M Physics. These include 2D motions, Momentum, Gravitation, Electric Fields & Interactions, Capacitance & Dielectrics, Direct Current Circuits, Electromagnetism, Electromagnetic Induction, and Alternating Currents.",
    "mcs": 4,
    "prerequisites": "PC3131",
    "preclusions": "",
    "corequisites": "",
    "hrs": 4,
    "remarks": ""
  },
  {
    "department": "PC",
    "level": 4,
    "sem": 1,
    "code": "PC4231",
    "type": "Elective",
    "title": "Physics Olympiad Training IV",
    "description": "This course covers challenging problems in physics and can be taken as preparation for the Singapore Junior Physics Olympiad (SJPO).",
    "mcs": 2,
    "prerequisites": "PC3232",
    "preclusions": "",
    "corequisites": "",
    "hrs": 1.5,
    "remarks": ""
  },
  {
    "department": "PC",
    "level": 4,
    "sem": 2,
    "code": "PC4232",
    "type": "Elective",
    "title": "Physics Olympiad Training V",
    "description": "This course covers challenging problems in physics and can be taken as preparation for the Singapore Physics Olympiad (SPhO).",
    "mcs": 2,
    "prerequisites": "PC4231",
    "preclusions": "",
    "corequisites": "",
    "hrs": 1.5,
    "remarks": ""
  },
  {
    "department": "PC",
    "level": 4,
    "sem": 1,
    "code": "PC4331",
    "type": "Enrichment",
    "title": "Astronomy III",
    "description": "This course covers challenging topics in Astronomy and can be taken as a preparation for Singapore Astronomy Olympiad",
    "mcs": 2,
    "prerequisites": "None",
    "preclusions": "",
    "corequisites": "",
    "hrs": 1.5,
    "remarks": "This course is offered subject to teaching manpower availability"
  },
  {
    "department": "PC",
    "level": 4,
    "sem": 1,
    "code": "PC4332",
    "type": "Enrichment",
    "title": "Real to Reel: Explaining Physics Though Videos",
    "description": "This course introduces students to the basics of creating Physics explainer videos by combining the science of Physics with the art of video-making.",
    "mcs": 2,
    "prerequisites": "None",
    "preclusions": "",
    "corequisites": "",
    "hrs": 1.5,
    "remarks": "This course is offered subject to teaching manpower availability"
  },
  {
    "department": "EG",
    "level": 5,
    "sem": 2,
    "code": "EG5430V",
    "type": "Honours in lieu",
    "title": "NUS/BN1111 Biomedical Engineering Principles and Practice I",
    "description": "Engineering Principles and Practice I (EPP I) is the first in a pair of courses designed to introduce first year students to a biomedical engineer’s way of thinking and addressing problems through exposure to real-life medical technologies. These technologies will be used to demonstrate the fundamental knowledge and skills a biomedical engineer is expected to possess. In this course, students will be exposed to key engineering problems such as how to analyse a complex medical device, along with how to conceptualise, represent and present their such devices.",
    "mcs": 4,
    "prerequisites": "PC4131 and PC4132",
    "preclusions": "",
    "corequisites": "",
    "hrs": 4,
    "remarks": ""
  },
  {
    "department": "EG",
    "level": 5,
    "sem": 2,
    "code": "EG5431V",
    "type": "Honours in lieu",
    "title": "NUS/CN1101A Chemical Engineering Principles and Practice I",
    "description": "This course provides an experiential exposure to chemical engineering concepts through a series of hands-on experimental laboratories. Simple yet visually engaging demonstrations will bring these concepts to life, and act as a preview and bridge to the core courses in the undergraduate curriculum, while highlighting their practical relevance. The students will prepare for each session by compulsory pre-laboratory readings on theoretical background and laboratory procedures. In the laboratory, they will learn to carry out measurement, data collection, analysis, modelling, interpretation and presentation. The laboratory sessions will be blended with real engineering applications of industrial and societal relevance to Singapore.",
    "mcs": 4,
    "prerequisites": "PC4131 and PC4132",
    "preclusions": "",
    "corequisites": "",
    "hrs": 4,
    "remarks": ""
  },
  {
    "department": "EG",
    "level": 5,
    "sem": 2,
    "code": "EG5432V",
    "type": "Honours in lieu",
    "title": "NUS/CE1103 Principles of Structural and Geotechnical Engineering",
    "description": "This course aims to stoke the curiosity and passion of engineering students to the wonders of Civil Engineering. From iconic landmark structures such as horizontal longspan bridges and vertical skyscrapers, to massive underground MRT interchanges and complex intertwining subway tunnels, these structures must withstand both the forces of nature and those that mankind has intended for them.  This courseintroduces the engineering fundamentals behind the design and construction of such man-made marvels. Through learning the basic concepts of structural and geotechnical engineering, students will gain an appreciation of the key principles governing the equilibrium and stability of these complex structures.",
    "mcs": 4,
    "prerequisites": "PC4131 and PC4132",
    "preclusions": "",
    "corequisites": "",
    "hrs": 4,
    "remarks": ""
  },
  {
    "department": "EG",
    "level": 5,
    "sem": 2,
    "code": "EG5433V",
    "type": "Honours in lieu",
    "title": "NUS/CG1111A Engineering Principles and Practice I",
    "description": "This course aims to equip first year engineering students to a computer engineer's way of thinking and will focus on the engineering principles of how computer-aided systems work and fail and the engineering practice of how they are designed, built and valued. Students will be presented a practical computer engineering system, e.g., a sensorassisted autonomous vehicle, a drone, or an engineering event. They are then guided to reconstruct the system via interconnected subsystems through laboratory sessions and group discussions, to explain using engineering principles how the system works and could fail.",
    "mcs": 4,
    "prerequisites": "PC4131 and PC4132",
    "preclusions": "",
    "corequisites": "",
    "hrs": 4,
    "remarks": ""
  },
  {
    "department": "EG",
    "level": 5,
    "sem": 2,
    "code": "EG5434V",
    "type": "Honours in lieu",
    "title": "NUS/EE1111A Electrical Engineering Principles and Practice I",
    "description": "This course introduces first year electrical engineering students to what engineers do and to the engineer's thought process. This is the first of a two-part course: Engineering Principles and Practice (EPP) I and II. Real engineering systems will be used to show how engineers use different disciplines of engineering to make things work. Through grasping engineering fundamentals, students learn how engineering systems work and fail (EPP I). Through learning where systems get energy and how they are controlled, students learn how multi-disciplinary concepts are tied together (EPP II). Students will also learn basic design, experimentation and evaluation of engineering systems.",
    "mcs": 4,
    "prerequisites": "PC4131 and PC4132",
    "preclusions": "",
    "corequisites": "",
    "hrs": 4,
    "remarks": ""
  },
  {
    "department": "EG",
    "level": 5,
    "sem": 2,
    "code": "EG5435V",
    "type": "Honours in lieu",
    "title": "NUS/ESP1111 Engineering Principles in Action",
    "description": "Students will learn engineering fundamentals like forces & equilibrium, dynamics and understand how materials and structures work and fail. They will also learn the importance of safety in conducting engineering activities, units and dimensions, significant numbers, how to make good guesses to solve engineering problems, vector mechanics and create engineering drawings. The students apply these concepts through building a wooden tower, taking full control of its design, modelling and construction. They will test their towers on a shake-table, and the team with the best design, based on a pre-determined set of metrics, will be given due recognition.",
    "mcs": 4,
    "prerequisites": "PC4131 and PC4132",
    "preclusions": "",
    "corequisites": "",
    "hrs": 4,
    "remarks": ""
  },
  {
    "department": "EG",
    "level": 5,
    "sem": 2,
    "code": "EG5436V",
    "type": "Honours in lieu",
    "title": "NUS/ESE2101 Environmental Engineering Principles & Practice",
    "description": "This course aims to excite first year engineering students about Environmental Engineering and the science and engineering principles that underlie Environmental Engineering applications. The course equips students with knowledge, critical thinking, computer-aid analysis, and practical experiences that are fundamental to Environmental Engineering. Basic environmental chemistry, microbiology, and hydraulics will be examined through a project-based learning. Thus, students will learn basic principles of chemical and biological processes and will be exposed to the concept of hydraulics. The lab-style teaching provides opportunities for hands-on experiences in 3D model design, digitalization, big-data analysis, and system analysis for environmental pollution control.",
    "mcs": 4,
    "prerequisites": "PC4131 and PC4132",
    "preclusions": "",
    "corequisites": "",
    "hrs": 4,
    "remarks": ""
  },
  {
    "department": "EG",
    "level": 5,
    "sem": 2,
    "code": "EG5437V",
    "type": "Honours in lieu",
    "title": "NUS/IE1111R Industrial & Systems EngineeringPrinciples & Practice I",
    "description": "This course introduces first year industrial and systems engineering students to various problems in this field and how they can be analysed and tackled through mathematical modelling, data analytics, simulation and quantitative decision making. By working on a series of carefullycurated problems, students gain an appreciation for the challenges faced when tackling large complex problems under uncertainty.",
    "mcs": 4,
    "prerequisites": "PC4131 and PC4132",
    "preclusions": "",
    "corequisites": "",
    "hrs": 4,
    "remarks": ""
  },
  {
    "department": "EG",
    "level": 5,
    "sem": 2,
    "code": "EG5438V",
    "type": "Honours in lieu",
    "title": "NUS/MLE1001B  Materials Science & Engineering Principles & Practice I",
    "description": "This is the first of a two course set: Engineering Principle and Practice I and II (EPP I and EPP II) to introduce first year students to how materials engineers think and address societal problems. EPP I will use hands-on lab experiences with state-of-the-art applications of both soft materials (e.g. polymers whose applications span drug delivery to aircraft windows) and hard materials (e.g. silicon, whose applications span transistors to solar cells) integrated with targeted chemistry and physics lecture content to understand how these materials work. Instruction on experimental methods, and both oral and written scientific communication are key learning objectives.",
    "mcs": 4,
    "prerequisites": "PC4131 and PC4132",
    "preclusions": "",
    "corequisites": "",
    "hrs": 4,
    "remarks": ""
  },
  {
    "department": "EG",
    "level": 5,
    "sem": 2,
    "code": "EG5439V",
    "type": "Honours in lieu",
    "title": "NUS/ME1102 Engineering Principles & Practice I",
    "description": "This is part 1 of a 2-course package – Engineering Principles and Practice - that introduces Year 1 students to what engineers do and the engineer's thought process. EPP I focuses on the engineering principles of how systems work and fail, and the engineering practice of how they are designed, built and valued. Given a practical engineering system, e.g. a drone, or an engineering event, e.g. the Challenger space shuttle disaster, students are guided to deconstruct the system into interconnected sub-systems. Following which they will develop an understanding of how forces, energy flow and/or mass flow between sub-systems impact the whole.",
    "mcs": 4,
    "prerequisites": "PC4131 and PC4132",
    "preclusions": "",
    "corequisites": "",
    "hrs": 4,
    "remarks": ""
  },
  {
    "department": "EG",
    "level": 5,
    "sem": 2,
    "code": "EG5441V",
    "type": "Honours in lieu",
    "title": "NUS/EG1311 Design & Make",
    "description": "This course covers the fundamentals of engineering design and prototyping. Students will learn design principles and tools through lectures and engage in experiential learning through group design projects. A stage-based design process will be covered. Students will develop skills in Arduino-controlled electronics, CAD modelling, and rapid prototyping to demonstrate their ideas.",
    "mcs": 4,
    "prerequisites": "PC4131 and PC4132",
    "preclusions": "",
    "corequisites": "",
    "hrs": 4,
    "remarks": "This course is also offered in Year 6 Sem 1"
  },
  {
    "department": "EG",
    "level": 5,
    "sem": 2,
    "code": "EG5442V",
    "type": "Honours in lieu",
    "title": "NUS/DTK1234 Design Thinking",
    "description": "In this course, students use design principles to develop their creative potential and practise design thinking using a people-centered approach to solve problems and create new possibilities. Through practical activities, students will discover tools and mindsets that guide them in navigating ambiguity in a creative process, observing and learning from others in unfamiliar contexts, and generating and experimenting with ideas quickly. While students draw on design thinking as a personal creative skillset, they will also value the impact of design that affords people the opportunity and privilege to shape the world that they, and others, inhabit.",
    "mcs": 4,
    "prerequisites": "PC4131 and PC4132",
    "preclusions": "",
    "corequisites": "",
    "hrs": 4,
    "remarks": "This course is also offered in Year 6 Sem 1"
  },
  {
    "department": "PC",
    "level": 5,
    "sem": "1 and 2",
    "code": "PC5141",
    "type": "Core (Major)",
    "title": "Advanced Physics II",
    "description": "This course provides an introduction to some advanced topics in physics. These include Fluids Mechanics, Thermodynamics, Simple Harmonic Motion, Waves, Phyiscal Optics, Nuclear Physics and Quantum Physics.",
    "mcs": 4,
    "prerequisites": "PC4131 and PC4132",
    "preclusions": "",
    "corequisites": "",
    "hrs": 4,
    "remarks": ""
  },
  {
    "department": "PC",
    "level": 5,
    "sem": 1,
    "code": "PC5231",
    "type": "Elective",
    "title": "Physics Olympiad Training VI",
    "description": "This course covers challenging problems in physics and can be taken as preparation for the Singapore Physics Olympiad (SPhO).",
    "mcs": 2,
    "prerequisites": "PC4232",
    "preclusions": "",
    "corequisites": "",
    "hrs": 1.5,
    "remarks": ""
  },
  {
    "department": "PC",
    "level": 5,
    "sem": 2,
    "code": "PC5232",
    "type": "Elective",
    "title": "Physics Olympiad Training VII",
    "description": "This course covers challenging problems in physics and can be taken as preparation for the Singapore Physics Olympiad (SPhO).",
    "mcs": 2,
    "prerequisites": "PC5231",
    "preclusions": "",
    "corequisites": "",
    "hrs": 1.5,
    "remarks": ""
  },
  {
    "department": "PC",
    "level": 5,
    "sem": 1,
    "code": "PC5431",
    "type": "Honours",
    "title": "Calculus-based Physics I",
    "description": "This course provides an introduction to the use of advanced mathematical techniques such as differentiation and integration to analyse and solve physics problems. Some topics on Mechanics andElectricity & Magnetism will be revisited with the application of calculus in problem-solving, where appropriate.",
    "mcs": 2,
    "prerequisites": "PC4131 and PC4132",
    "preclusions": "",
    "corequisites": "",
    "hrs": 2,
    "remarks": ""
  },
  {
    "department": "PC",
    "level": 5,
    "sem": 2,
    "code": "PC5432",
    "type": "Honours",
    "title": "Calculus-based Physics II",
    "description": "This course builds on PC5431 and exposes students to the use of advanced mathematical techniques such as solving ordinary differential equations to analyse and solve problems in Physics.",
    "mcs": 2,
    "prerequisites": "PC5431",
    "preclusions": "",
    "corequisites": "",
    "hrs": 2,
    "remarks": ""
  },
  {
    "department": "PC",
    "level": 5,
    "sem": 2,
    "code": "PC5432V",
    "type": "Honours in lieu",
    "title": "NUS/PC2032 Classical Mechanics I",
    "description": "This course considers the principles of Newtonian Mechanics and covers topics such as kinematics, inertial and non-inertial reference frames, linear momentum, kinetic energy, and angular momentum; Newton's laws of motion, forces and torques; systems of many particles including rigid bodies; conservation laws; Newtonian gravity and Kepler’s laws of planetary motion.",
    "mcs": 4,
    "prerequisites": "PC5431",
    "preclusions": "",
    "corequisites": "",
    "hrs": 4,
    "remarks": "3 NUS courses can be read in lieu to fulfil NUSHS Physics Honours requirement: 1) PC1101/ Frontiers of Physics (Most students will take this in Y6Sem2 which will be NGNE only, special case can take it in Y5Sem2 to fulfil Honours in lieu) 2) PC2131/ Electricity & Magnetism I 3) PC2132/ Classical Mechanics I"
  },
  {
    "department": "EG",
    "level": 6,
    "sem": 1,
    "code": "EG5441V",
    "type": "Honours in lieu",
    "title": "NUS/EG1311 Design & Make",
    "description": "This course covers the fundamentals of engineering design and prototyping. Students will learn design principles and tools through lectures and engage in experiential learning through group design projects. A stage-based design process will be covered. Students will develop skills in Arduino-controlled electronics, CAD modelling, and rapid prototyping to demonstrate their ideas.",
    "mcs": 4,
    "prerequisites": "PC4131 and PC4132",
    "preclusions": "",
    "corequisites": "",
    "hrs": 4,
    "remarks": "This course is also offered in Year 5 Sem 2"
  },
  {
    "department": "EG",
    "level": 6,
    "sem": 1,
    "code": "EG5442V",
    "type": "Honours in lieu",
    "title": "NUS/DTK1234 Design Thinking",
    "description": "In this course, students use design principles to develop their creative potential and practise design thinking using a people-centered approach to solve problems and create new possibilities. Through practical activities, students will discover tools and mindsets that guide them in navigating ambiguity in a creative process, observing and learning from others in unfamiliar contexts, and generating and experimenting with ideas quickly. While students draw on design thinking as a personal creative skillset, they will also value the impact of design that affords people the opportunity and privilege to shape the world that they, and others, inhabit.",
    "mcs": 4,
    "prerequisites": "PC4131 and PC4132",
    "preclusions": "",
    "corequisites": "",
    "hrs": 4,
    "remarks": "This course is also offered in Year 5 Sem 2"
  },
  {
    "department": "EG",
    "level": 6,
    "sem": 1,
    "code": "EG6430V",
    "type": "Honours in lieu",
    "title": "NUS/BN2111 Biomedical Engineering Principles and Practice II",
    "description": "This course is the second of a set of two courses: Engineering Principle and Practice I and II (EPP I and EPP II). EPP courses aim to introduce first year students to the biomedical engineer’s way of thinking and addressing problems. A real-life medical technology will be used to demonstrate the fundamental knowledge and skills that a biomedical engineer is expected to possess. In EPP II, students will be exposed to key engineering problems such as how systems are controlled, powered and optimized.",
    "mcs": 4,
    "prerequisites": "EG5430V (NUS/BN1111)",
    "preclusions": "",
    "corequisites": "",
    "hrs": 4,
    "remarks": ""
  },
  {
    "department": "EG",
    "level": 6,
    "sem": 1,
    "code": "EG6431V",
    "type": "Honours in lieu",
    "title": "NUS/CN2102 Chemical Engineering Principles and Practice II",
    "description": "This course is the second part of a two-part course designed to provide first year Chemical and Biomolecular Engineering students with an experiential exposure to the foundational concepts of Biomolecular/Biochemical/Bioprocess Engineering, including mass and energy balances, biosafety and sterile handling, bioreaction kinetics, bioreactor design, downstream processing and purification, etc.,through a series of hands-on experimental laboratories. In the laboratory, they will learn to carry out measurement, data collection, analysis, interpretation and presentation. The laboratory sessions will be blended with real engineering applications of industrial and societal relevance to Singapore.",
    "mcs": 4,
    "prerequisites": "EG5431V (NUS/CN1101A)",
    "preclusions": "",
    "corequisites": "",
    "hrs": 4,
    "remarks": ""
  },
  {
    "department": "EG",
    "level": 6,
    "sem": 1,
    "code": "EG6432V",
    "type": "Honours in lieu",
    "title": "NUS/CE2155 Principles of Structural Mechanics and Materials",
    "description": "This course equips students with knowledge and skills in structural mechanics, and materials for structural engineering. The topics introduce the fundamentals of material constitutive behaviours and failure models to appreciate the use of materials in structural design. The topics also cover the composite, micro-structure and properties of concrete, steel and wood, with an emphasis on the mix-design of concrete. The course is compulsory for civil engineering undergraduate students without which he will not be qualified to practise as a professional civil engineer.",
    "mcs": 4,
    "prerequisites": "EG5432V (NUS/CE1103)",
    "preclusions": "",
    "corequisites": "",
    "hrs": 4,
    "remarks": ""
  },
  {
    "department": "EG",
    "level": 6,
    "sem": 1,
    "code": "EG6433V",
    "type": "Honours in lieu",
    "title": "NUS/CG2111A Engineering Principles and Practice II",
    "description": "This course will be for the students who have completed EPP I and the project scope extends to handle challenges in large-scale systems. Similar to EPP I, students will first learn the fundamental principles on certain advanced concepts and then design and programme a realworld system. The course involves designing a complex computer engineering system that facilitates information processing, real-world interfacing, and understanding the effects of certain useful metrics such as, scaling, safety, security, sustainability, societal impact, fault-tolerant design, etc.",
    "mcs": 4,
    "prerequisites": "EG5433V (NUS/CG1111A) & NUS course CS1010 or CS1010 placemen t Exam",
    "preclusions": "",
    "corequisites": "",
    "hrs": 4,
    "remarks": ""
  },
  {
    "department": "EG",
    "level": 6,
    "sem": 1,
    "code": "EG6434V",
    "type": "Honours in lieu",
    "title": "NUS/EE2111A Electrical Engineering Principles and Practice II",
    "description": "This course is the second part of the two part course Engineering Principles and Practice (EPP) I and II and follows closely the same learning objectives. Most modern engineering systems are more electric. They convert some raw form of energy, such as fuel, mechanical or energy stored in battery, into electrical form. We see this in every engineering system from trains, biomedical devices, chemical plants, electric cars, aircrafts and ships to ICT devices such as computers, handphones, tablets etc. Hence, energy conversion, distribution, and sensing & control will form the backbone of this knowledge segment.",
    "mcs": 4,
    "prerequisites": "EG5434V (NUS/EE1111A)",
    "preclusions": "",
    "corequisites": "",
    "hrs": 4,
    "remarks": ""
  },
  {
    "department": "EG",
    "level": 6,
    "sem": 1,
    "code": "EG6435V",
    "type": "Honours in lieu",
    "title": "NUS/ESP2111 Sensor System Electronics",
    "description": "This course introduces students to the fundamental electronic principles of sensor systems for a variety of different disciplines. Particular emphasis will be given to circuits that are used in research and development, such as sensor amplifiers, filters, and data-acquisition. The course has both analogue and digital circuit principles, and involves project activities that involve hands-on construction of sensors, their circuits and translating their signals into digital data on to a computer.",
    "mcs": 4,
    "prerequisites": "EG5435V (NUS/ESP1111)",
    "preclusions": "",
    "corequisites": "",
    "hrs": 4,
    "remarks": ""
  },
  {
    "department": "EG",
    "level": 6,
    "sem": 1,
    "code": "EG6436V",
    "type": "Honours in lieu",
    "title": "NUS/ESE2102 Principles & Practice in Environmental Monitoring",
    "description": "Singapore is committed to become the World’s greenest city but how can economic development and environmental sustainability combine to create a truly liveable place? Engineers have a significant role to play in developing technical solutions that must be practical and economically feasible. In this course, students practice environmental engineering outside the classroom by teaming up as consultancy firms to undertake real-life projects: for example, monitoring water quality in the Singapore Botanic Gardens or mapping air pollution by drone sensing.",
    "mcs": 4,
    "prerequisites": "EG5436V (NUS/ESE2101)",
    "preclusions": "",
    "corequisites": "",
    "hrs": 4,
    "remarks": ""
  },
  {
    "department": "EG",
    "level": 6,
    "sem": 1,
    "code": "EG6437V",
    "type": "Honours in lieu",
    "title": "NUS/IE2111 Industrial & Systems Engineering Principles & Practice II",
    "description": "This course introduces the principles and practice of engineering economics and financial decision making faced by engineers. Students will learn how to deal with the financial and economic aspects in the design, evaluation and management of engineering systems involving capital investments and cash flows over time. Topics covered include principles and practices of cash flow analysis, decision making involving single and multiple alternatives, depreciation of capital assets and aftertax project cash-flow analysis, replacement analysis of capital assets, and dealing with risk & uncertainty. Case studies and computational tools will be used to model, analyse and solve complex problems effectively.",
    "mcs": 4,
    "prerequisites": "EG5437V (NUS/IE1111R)",
    "preclusions": "",
    "corequisites": "",
    "hrs": 4,
    "remarks": ""
  },
  {
    "department": "EG",
    "level": 6,
    "sem": 1,
    "code": "EG6438V",
    "type": "Honours in lieu",
    "title": "NUS/MLE2001A Materials Science & Engineering Principles & Practice II",
    "description": "We will explore what makes materials the way they are and why. We will discover the structure of the materials that make up our modern world and learn how it influences the properties, performance and applications of these materials. We will learn the difference between amorphous and crystalline materials, learn how the materials structure can be measured, and show that materials defects are responsible for the functionality of our computers, steel bridges or airplanes. The significance of these issues in modern industry will be emphasized through case studies.",
    "mcs": 4,
    "prerequisites": "EG5438V (NUS/MLE1001B)",
    "preclusions": "",
    "corequisites": "",
    "hrs": 4,
    "remarks": ""
  },
  {
    "department": "EG",
    "level": 6,
    "sem": 1,
    "code": "EG6439V",
    "type": "Honours in lieu",
    "title": "NUS/ME2104 Engineering Principles & Practice II",
    "description": "Part II of Engineering Principles and Practice will focus on the engineering principle of how systems are energized and controlled and the engineering practice of how they are designed, built and valued. Most modern engineering systems are powered electrically. They convert some raw form of energy such as fuel (petrol, diesel) or battery (electrochemically stored energy), into electrical energy. Hence energy sources and energy conversion, electrical energy utilization through conversion into various functions, measurement of functions through their performance parameters will form the backbone of this course.",
    "mcs": 4,
    "prerequisites": "EG5439V (NUS/ME1102)",
    "preclusions": "",
    "corequisites": "",
    "hrs": 4,
    "remarks": ""
  },
  {
    "department": "PC",
    "level": 6,
    "sem": "1 and 2",
    "code": "PC6141",
    "type": "Core (Major)",
    "title": "Advanced Physics III",
    "description": "This course provides an introduction to advanced topics in Physics such as Rotational Mechanics, Special Relativity and Practical Circuitry and Electronics.",
    "mcs": 4,
    "prerequisites": "PC5131 and PC5132",
    "preclusions": "",
    "corequisites": "",
    "hrs": 4,
    "remarks": ""
  },
  {
    "department": "PC",
    "level": 6,
    "sem": 1,
    "code": "PC6431V",
    "type": "Honours in lieu",
    "title": "NUS/PC2031 Electricity & Magnetism I",
    "description": "This course considers the fundamentals of Electricity and Magnetism and covers topics such as: electrostatic fields, Coulomb’s law and Poisson’s equation; magnetostatic fields, Biot-Savart’s law and Poisson’s equation; time-varying electric and magnetic fields, Faraday’s and generalised Ampere’s laws; Maxwell’s equations and electromagnetic waves in vacuum.",
    "mcs": 4,
    "prerequisites": "PC5431",
    "preclusions": "",
    "corequisites": "",
    "hrs": 4,
    "remarks": "3 NUS courses can be read in lieu to fulfil NUSHS Physics Honours requirement: 1) PC1101/ Frontiers of Physics (Most students will take this in Y6Sem2 which will be NGNE only, special case can take it in Y5Sem2 to fulfil Honours in lieu) 2) PC2131/ Electricity & Magnetism I 3) PC2132/ Classical Mechanics I"
  },
  {
    "department": "PC",
    "level": 6,
    "sem": 1,
    "code": "PC6432",
    "type": "Honours",
    "title": "Numerical Modelling of Physical Systems",
    "description": "This course provides an introduction on the application of numerical methods and computational modelling to Physics problems. Through these, students pick up valuable computational modelling skills toanalyze physical systems and gain greater physical insights into the phenomena or systems under study.",
    "mcs": 2,
    "prerequisites": "PC5431",
    "preclusions": "",
    "corequisites": "",
    "hrs": 2,
    "remarks": ""
  },
  {
    "department": "PC",
    "level": 6,
    "sem": 2,
    "code": "PC6433",
    "type": "Honors",
    "title": "Introduction to Current & Emerging Topics in Physics",
    "description": "The course aims to give students an introductory understanding of selected current and emerging topics in Physics.",
    "mcs": "",
    "prerequisites": "PC5431",
    "preclusions": "",
    "corequisites": "",
    "hrs": "",
    "remarks": ""
  },
  {
    "department": "PC",
    "level": 6,
    "sem": 1,
    "code": "PC6435V",
    "type": "Honours in lieu",
    "title": "NUS/PC1101 Frontiers of Physics",
    "description": "This course gives students of all backgrounds the opportunity to understand the philosophical underpinnings of physics, and hence that of all natural sciences. Students will be exposed to the big ideas and fundamental concepts in physics, learn about the key historical experiments as well as the latest ideas at the frontiers in physics, such as quantum computing, exoplanets, and the grand unified theory.",
    "mcs": 4,
    "prerequisites": "PC5431",
    "preclusions": "",
    "corequisites": "",
    "hrs": 4,
    "remarks": "3 NUS courses can be read in lieu to fulfil NUSHS Physics Honours requirement: 1) PC1101/ Frontiers of Physics (Most students will take this in Y6Sem2 which will be NGNE only, special case can take it in Y5Sem2 to fulfil Honours in lieu) 2) PC2131/ Electricity & Magnetism I 3) PC2132/ Classical Mechanics I"
  },
  {
    "department": "EL",
    "level": 1,
    "sem": "1 and 2",
    "code": "EL1131",
    "type": "Core",
    "title": "Language and Literary Studies I",
    "description": "This year-long course aims to deepen students’ understanding of Self & Identity through four distinct thematic units: Friendship, Family, Choices and Belonging. Through these thematic units, students will acquire the skills to write various text types/genres spanning from prose, poetry and play. Students will also explore and engage with a litany of multi-modular texts including the course’s main novel Wonder, as well as short stories, plays poems and movies. Students will also develop their reading comprehension skills as well as poetry analyses. Students will also learn how to construct structured responses in the form of P-E-E to express their appreciation of writer’s style, characterisation and setting in short prose excerpts. Additionally, students will also develop their oratorical skills through exploring collaborative discussions, oral presentations and Readers’ Theatre.",
    "mcs": 8,
    "prerequisites": "None",
    "preclusions": "",
    "corequisites": "",
    "hrs": 4,
    "remarks": "Year long course"
  },
  {
    "department": "EL",
    "level": 2,
    "sem": "1 and 2",
    "code": "EL2131",
    "type": "Core",
    "title": "Language and Literary Studies II",
    "description": "This year-long course will build on students’ existing knowledge and language skills and help them further develop the reading, writing, listening and speaking skills acquired from EL1131: Language and Literary Studies I. The course will explore the overarching theme of Self and Conflict through four underlying sub-themes:  Man Vs Self, Man Vs Society, Man Vs Man and Man Vs Nature. In Semester 1, students will explore the themes of Man Vs Society and Man Vs Self through a compilation of short prose from Singapore and beyond. Students will enhance their narrative writing skills through the study of advanced literary devices such as foreshadowing, symbolism, irony and internal monologue; as well as by exploring alternative plot structures. For their reading component, students will continue to hone their close and critical reading skills by examining authors’ intentions and effects achieved through the use of literary devices in narrative text types. For their project work, students will complete a multimedia literacy project that will develop their skills in factual recounts and pictorial communication. In Semester 2, students will explore the themes of Man Vs Man and Man Vs Nature through a compilation of crime stories. Students will gain a deeper knowledge of crime narratives genre conventions and get the opportunity to generate original crime stories of their own. They will develop a video trailer to promote their stories to an audience of their peers. Students will also expand their reading repertoire by being introduced to expositions where they can reinforce their summary skills and develop an informed and substantiated opinion on issues of relevance to the themes of the course in both the written and oral forms.",
    "mcs": 6,
    "prerequisites": "EL1131",
    "preclusions": "",
    "corequisites": "",
    "hrs": 3,
    "remarks": "Year long course"
  },
  {
    "department": "EL",
    "level": 3,
    "sem": "1 and 2",
    "code": "EL3131",
    "type": "Core",
    "title": "Exposition and Argumentation: Community and Society",
    "description": "This year-long course introduces the skills of critical reading and expository writing. Students will learn foundational skills in expository writing—to form claims, substantiate them with ample relevant evidence and elaboration and to put forth a convincing argument.  They will be exposed to themes of family, education, youth and the aged through reading material, writing activities and class discussions. This course also focuses on functional texts in real life settings where they get to apply their knowledge of textual and linguistic features to communicate effectively for real world purposes.",
    "mcs": 6,
    "prerequisites": "EL2131",
    "preclusions": "",
    "corequisites": "",
    "hrs": 3,
    "remarks": "Year long course"
  },
  {
    "department": "EL",
    "level": 4,
    "sem": "1 and 2",
    "code": "EL4131",
    "type": "Core",
    "title": "Critical Reading and Writing I: SocialInstitutions and Issues",
    "description": "This course is designed as an intermediate course on the essential skills needed for an English Language learner to be fluent and confident in expressing arguments and opinions in an academic and convincing manner. Through the analysis of emergingissues/trends in the mass media; crime and punishment; science and technology;  prejudice and discrimination, students will gain a broad and mature understanding of the topics and apply them in specific reading, writing and oral communication tasks. In addition, key controversies arising from social institutions like the family and education will be examined.  Other than argumentative essay and reading comprehension components, students will also be assessed through oral presentations and research. Varied sources of texts will be used to broaden content knowledge and promote critical reading and inquiry. This is a year-long course that spans two semesters. In the course of the course, students are encouraged to take a proactive and independent approach in broadening current affairs knowledge.",
    "mcs": 6,
    "prerequisites": "EL3131",
    "preclusions": "",
    "corequisites": "",
    "hrs": 3,
    "remarks": "Year long course"
  },
  {
    "department": "EL",
    "level": 5,
    "sem": "1 and 2",
    "code": "EL5131",
    "type": "Core",
    "title": "Critical Reading and Writing II: The Global Connection",
    "description": "As an intermediate course in the English Language in the senior years, this course seeks to further develop students’ fluency and confidence in expressing arguments and opinions about global issues. Through close analysis of emerging global issues as well as the study of political ideologies, international relations and emerging issues on conflicts and security, students will become critically aware of the ongoing and emerging concerns as global citizens.   Students will also examine theoretical views useful for the construction and deconstruction of exposition, persuasion and argumentation in reading, writing, listening and speaking within an academic context, which will develop the students’ critical and creative thinking abilities. Other than argumentative essays and application questions, students will also be assessed through oral presentations and research. Varied sources of texts will be used to broaden content knowledge and promote critical reading and inquiry.   This is a year-long course that spans two semesters. In the course of the course, students are encouraged to take a proactive and independent approach towards broadening their current affairs knowledge.",
    "mcs": 4,
    "prerequisites": "EL4131",
    "preclusions": "",
    "corequisites": "",
    "hrs": 3,
    "remarks": "Year long course"
  },
  {
    "department": "EL",
    "level": 5,
    "sem": "1 and 2",
    "code": "EL5132",
    "type": "Core",
    "title": "Language for Public Communication",
    "description": "This year-long course focuses on effective communication in the public arena. In Semester 1, students will hone their writing skills by delving into the world of opinioneditorials. The second part of the course in Semester 2 seeks to develop students’ understanding and use of language in science communication.    Opinionated and yet grounded in facts, opinion-editorials or Op-eds, have the power to persuade readers. In learning to write their own Op-eds, students will be taught the skills needed to develop a strong personal voice. Students will also be taught to appreciate the importance of substantiating their opinions as they craft their op-eds. Apart from learning how to write an Op-ed, students will also learn to objectively evaluate their peer’s work. Using the process approach to writing, students will work on their drafts, use the feedback to make improvements before their final submission.  Semester 2 starts off  with science communication to the lay audience. Students will study the principles of science communication and acquire linguistic strategies in communicating complex ideas in a lucid manner. Through creating and presenting TED talks in science topics, students will acquire content creation and oral deliverystrategies to inform, educate, interest and engage lay audience. The second part of Semester 2 relates to science and research presentation to the scientific community. Using their ARP as springboard, students will learn to write a concise and effective abstract, and to present figures diagrams effectively in their research paper and poster.",
    "mcs": 2,
    "prerequisites": "EL4131",
    "preclusions": "",
    "corequisites": "",
    "hrs": 1,
    "remarks": "Year long course"
  },
  {
    "department": "EL",
    "level": 6,
    "sem": 1,
    "code": "EL6131",
    "type": "Core",
    "title": "Critical reading and writing III: Emerging issues in a changing world",
    "description": "This is a semester long course which will further develop the foundational critical thinking skills built in the last two years’ courses. This course aims to enhance their reasoning skills in terms of synthesising various themes of knowledge for insightful conclusions.  Through the study of emerging socio-political issues in Singapore and the global context, students will become critically aware of the current and evolving concerns as global citizens. Aside from essay writing, students will also be assessed through a literature review, personal reflection and panel discussion. Varied text types such as newspapers, magazines and periodicals will be used to promote critical thinking and inquiry.",
    "mcs": 2,
    "prerequisites": "EL5131 and EL5132",
    "preclusions": "",
    "corequisites": "",
    "hrs": 3,
    "remarks": ""
  },
  {
    "department": "EL",
    "level": 6,
    "sem": "1 and 2",
    "code": "EL6132",
    "type": "Core",
    "title": "Language for Personal and Professional Communication",
    "description": "This year-long course focuses on effective communication in the public arena. In Semester 1, students will hone their writing skills by delving into the world of personal narratives. The second part of the course in Semester 2 seeks to develop students’ competencies and skills that will be useful for college/university and the workplace. By the end of the course, students will be more fluent, confident, and effective communicators and writers.  Semester 1: Personal Essay/ Narrative This class will explore the relatively new genre of creative non-fiction which conveys true stories using literary techniques usually associated with fiction. Also known as literary nonfiction, creative nonfiction encompasses many sub-types: the personal narrative essay, memoir, the interview, the profile, the diary, biography, autobiography, travel writing, nature writing, science writing, and writing about sports. EL6132 will focus on writing the personal narrative/ essay (college application essay).  Semester 2: Personal Branding, Social Finesse and Interview Skills Personal branding is the conscious effort to create and influence public perception of an individual by elevating their credibility and differentiating themselves. Semester 2 of the course focuses on cultivating a personal brand and articulating it in speech and writing. Students will learn to craft a personal statement of achievement and a profile video with elevator pitch to showcase their skills and experiences. To prepare students for the tertiary education and the workplace, the course also will focus on refining students’ email communication skills and interview skills.",
    "mcs": 2,
    "prerequisites": "EL5131 and EL5132",
    "preclusions": "",
    "corequisites": "",
    "hrs": 1,
    "remarks": "Year long course"
  },
  {
    "department": "EL",
    "level": 6,
    "sem": 2,
    "code": "EL6133",
    "type": "Core",
    "title": "Advanced Academic Reading and Writing: Language and Society",
    "description": "* This course considers how language use relates to broader variation in the daily experiences of individuals and groups. Students examine how language constructs social class, gender, and power relations and how these abstractions shape language(s). Students will explore the interaction of language and understand the practical implications of language variation for language policy and language education in multilingual societies such as Singapore. As an academic writing course, the course will focus on the development of basic competencies in academic writing and research. Students will develop skills in data collection, analysis and literature review, and produce an original research paper through process writing. Students will be guidedthrough the critical reading of academic journal articles and learn how to distil and apply relevant information into the creation of new academic knowledge.",
    "mcs": 2,
    "prerequisites": "EL6131",
    "preclusions": "",
    "corequisites": "",
    "hrs": 3,
    "remarks": "*Students have a choice of one course, subject to department’s approval"
  },
  {
    "department": "EL",
    "level": 6,
    "sem": 2,
    "code": "EL6134",
    "type": "Core",
    "title": "Understanding Discourse",
    "description": "* This course will explore discourse and expose students to frameworks and approaches to analysing it. Different types of discourse can be seen as linguistic representations of particular worldviews. A critical perspective on the analysis of specific discourses, whether oral or written, aims to promote the general awareness that language is used to construct and perpetuate particular viewpoints, and through such linguistic constructions, specific (power) relationships are maintained. By virtue of the fact that discourse involves the situated use of language in relevant sociocultural contexts, it is an orientation that promotes the crossing of disciplinary borders.",
    "mcs": 2,
    "prerequisites": "EL6131",
    "preclusions": "",
    "corequisites": "",
    "hrs": 3,
    "remarks": "*Students have a choice of one course, subject to department’s approval"
  },
  {
    "department": "EL",
    "level": 6,
    "sem": 2,
    "code": "EL6135",
    "type": "Core",
    "title": "Advanced Creative Writing",
    "description": "* This semester-long course will allow students to generate fiction, poetry or creative non-fiction. It will include significant close reading and discussion of notable literary models, completion of writing assignments and prompts, and peer review workshops. Students are expected to work on their own portfolios of poems, stories or creative non-fiction. The workshop framework is at the heart of the writing, reading and discussion of creative writing in this course. Selected readings will cover both canonical as well as contemporary creative writing. The best works may be published in school periodicals and other publications, as well as entered in competitions.",
    "mcs": 2,
    "prerequisites": "EL6131",
    "preclusions": "",
    "corequisites": "",
    "hrs": 3,
    "remarks": "*Students have a choice of one course, subject to department’s approval"
  },
  {
    "department": "EN",
    "level": 2,
    "sem": "1 and 2",
    "code": "EN2131",
    "type": "Core",
    "title": "Literary Genres I",
    "description": "This is a year-long course to familiarise students with the core Literary genres of Poetry, Prose and Play. Students will engage with the themes of revealation, denial, acceptance and responsibility through the study of the novel \"A Monster Calls\" by Patrick Ness and the play \"An Inspector Calls\" by J.B. Pristley.  Students will also be introduced to a repertoire of local and international poems to hone their analysis and appreciation.",
    "mcs": 4,
    "prerequisites": "EL1131",
    "preclusions": "",
    "corequisites": "",
    "hrs": 2,
    "remarks": "Year long course"
  },
  {
    "department": "EN",
    "level": 3,
    "sem": "1 and 2",
    "code": "EN3131",
    "type": "Core",
    "title": "Literary Genres II",
    "description": "This is a year-long course that will expose students to the literary stylistics of the novel and play. Students will study the novel \"Haroun and the Sea of Stories\" by Salman Rushdie which will immerse them in the world of fantastical storytelling and inspire them to think about how stories shape our identity, kinship, and our society.  The course will also introduce students to the world of Shakespearean theatre through Romeo and Juliet where they will immerse themselves in the beauty of Elizabethan language and consider themes such as Love, Family, Individual vs Society amongst others.  On top of the novel and play, students will also be enriched through a diverse range of poetry from \"Poetry Moves\".",
    "mcs": 6,
    "prerequisites": "EN2131",
    "preclusions": "",
    "corequisites": "",
    "hrs": 3,
    "remarks": "Year long course"
  },
  {
    "department": "EN",
    "level": 4,
    "sem": 1,
    "code": "EN4133",
    "type": "Core (Major)",
    "title": "Environmental Literature",
    "description": "In this course, students will study of specific areas such as the purpose and function of the natural environment in our lives and how we can co-exist harmoniously through a study of fiction, non-fiction, film and ecopoetry texts from Singapore and the rest of the world. Students will also write informed and persuasive essays to display their interpretation of  authors’ intentions as well as their engagement with themes/issues within the novels with a discerning selection of persuasive literary evidence. Additionally, students will have to work on an alternative assessments and deliver an oral presentation on one of the course’s core texts.",
    "mcs": 3,
    "prerequisites": "A minimum of ‘B’ grade for EL1131/EL2131/EL3131",
    "preclusions": "",
    "corequisites": "",
    "hrs": 3,
    "remarks": ""
  },
  {
    "department": "EN",
    "level": 4,
    "sem": 2,
    "code": "EN4134",
    "type": "Core (Major)",
    "title": "19th Century British Literature",
    "description": "In this course, students will study selected works representing 19th Century British Literature and its relevant themes. Students will write informed and persuasive essays to display their interpretation of the authors’ intentions as well as their engagement with themes/issues within the novels with a discerning selection of persuasive literaryevidence. Additionally, students will have to work on an independent research project by studying a related secondary text of their choice as well as deliver an oral presentation on one of the course’s core texts.",
    "mcs": 3,
    "prerequisites": "A minimum of ‘B’ grade forEL1131/EL2131/EL3131",
    "preclusions": "",
    "corequisites": "",
    "hrs": 3,
    "remarks": ""
  },
  {
    "department": "EN",
    "level": 5,
    "sem": 2,
    "code": "EN5132",
    "type": "Core (Major)",
    "title": "20th Century American Literature",
    "description": "In this course, students will study selected works representing 20th Century American Literature and its relevant themes. Students will write informed and persuasive essays to display their interpretation of the authors’ intentions as well as their engagement with themes/issues within the novels with a discerning selection of persuasive literary evidence. Additionally, students will have to work on an independent research project by studying a related secondary text of their choice as well as deliver an oral presentation on one of the course’s core texts.",
    "mcs": 4,
    "prerequisites": "Year 4  Literatu re",
    "preclusions": "",
    "corequisites": "",
    "hrs": 3,
    "remarks": ""
  },
  {
    "department": "EN",
    "level": 5,
    "sem": 1,
    "code": "EN5134",
    "type": "Core (Major)",
    "title": "Utopias and Dystopias",
    "description": "In this course, students will explore notions of Utopias and Dystopias with respect to societal societal structures, politics and governance and gender roles. Students will also write informed and persuasive essays to display their interpretation of  authors’ intentions as well as their engagement with themes/issues within the novels with a discerning selection of persuasive literary evidence. Additionally, students will have to work on an alternative assessments and deliver an oral presentation on one of the course’s core texts.",
    "mcs": 4,
    "prerequisites": "Year 4 Literature",
    "preclusions": "",
    "corequisites": "",
    "hrs": 3,
    "remarks": ""
  },
  {
    "department": "EN",
    "level": 6,
    "sem": 2,
    "code": "EN6131",
    "type": "Core (Major)",
    "title": "Advanced Research in Literature",
    "description": "This is an independent research in literature course that fulfills part of the overall requirement for all literature students majoring in the subject.  Students will have to embark on a rigorous research topic of their choice and conduct a thorough literature review. By the end of the course, students will demonstrate a balanced, sound and well-researched evaluation of their selected literary topic/text presented in both the written and oral form.",
    "mcs": 4,
    "prerequisites": "Year 5 Literature",
    "preclusions": "",
    "corequisites": "",
    "hrs": 3,
    "remarks": "Year long course - students will only submit their completed research essay and oral presentation in Semester 2."
  },
  {
    "department": "EN",
    "level": 6,
    "sem": 1,
    "code": "EN6132",
    "type": "Core (Major)",
    "title": "Postcolonial Literature",
    "description": "In this course, students will study selected works representing Postcolonial Literature and its relevant themes. Students will write informed and persuasive essays to display their interpretation of the authors’ intentions as well as their engagement with themes/issues within the novels with a discerning selection of persuasive literary evidence. Additionally, students will have to work on an independent research project by studying a related secondary text of their choice as well as deliver an oral presentation on one of the course’s core texts.",
    "mcs": 4,
    "prerequisites": "Year 5 Literature",
    "preclusions": "",
    "corequisites": "",
    "hrs": 3,
    "remarks": ""
  },
  {
    "department": "CH",
    "level": 1,
    "sem": "1 and 2",
    "code": "CH1531",
    "type": "Core",
    "title": "Higher Chinese I",
    "description": "This course focuses on equipping students with structural guidelines and rhetorics that will enable them to develop narrative and descriptive writing skills at the Intermediate level. Under the section of interactive writing, students will learn how to write informal emails, discuss current affairs and share personal experiences. Students will acquire browsing and close reading skills that will equip them with the correct answering techniques in reading and comprehension.  Through class discussions and group work, students will develop active listening skills and acquire oral and presentation skills.",
    "mcs": 6,
    "prerequisites": "None",
    "preclusions": "",
    "corequisites": "",
    "hrs": 3,
    "remarks": "Year long course"
  },
  {
    "department": "CL",
    "level": 1,
    "sem": 1,
    "code": "CL1231",
    "type": "Elective",
    "title": "Chinese as 3rd Language IA",
    "description": "This course is opened to students who have no prior Chinese language background. This course touches on the basics, such as an overview of the evolution of Chinese characters and an introduction to phonetics (the Hanyu Pinyin system). More emphasis will be given to the oral and listening components.",
    "mcs": 3,
    "prerequisites": "None",
    "preclusions": "",
    "corequisites": "",
    "hrs": 3,
    "remarks": ""
  },
  {
    "department": "CL",
    "level": 1,
    "sem": 2,
    "code": "CL1232",
    "type": "Elective",
    "title": "Chinese as 3rd Language IB",
    "description": "This course is a continuation of CL1231.  At the end of the course, pupils will acquire basic conversational and writing skills in Mandarin.  Please refer to Description for CL1231.",
    "mcs": 3,
    "prerequisites": "CL1231",
    "preclusions": "",
    "corequisites": "",
    "hrs": 3,
    "remarks": "*Pre-requisites refer to students having to pass the course by attaining at least 50% (overall) in order to advance to the next level.  For example, students will be required to attain at least 50% for CL1231 in order to advance to CL1232."
  },
  {
    "department": "CL",
    "level": 1,
    "sem": "1 and 2",
    "code": "CL1531",
    "type": "Core",
    "title": "Chinese I",
    "description": "This course focuses on contextual learning of words and phrases, which form the basics for language acquisition.  Reading and comprehension will go hand in hand with the learning of words and phrases. Much emphasis will be given to the acquisition of oral and listening skills, other than the learning of narrative writing skills at the intermediate level.  Under the section of functional writing, students will learn how to write informal emails with reference to daily life.",
    "mcs": 6,
    "prerequisites": "None",
    "preclusions": "",
    "corequisites": "",
    "hrs": 3,
    "remarks": "Year long course"
  },
  {
    "department": "CH",
    "level": 2,
    "sem": "1 and 2",
    "code": "CH2531",
    "type": "Core",
    "title": "Higher Chinese II",
    "description": "In this course, students will build on their existing knowledge and skills. Under writing, they will further develop and enhance their skills in descriptive and narrative writing, as well as acquire relevant skills in expository writing. Argumentative writing will also be introduced to hone the students’ critical thinking skills. While brushing up on informal emails, they will be introduced to formal emails.  Through reading more complex narrative passages, students will learn how to interpret underlying meanings. Through class discussions and group work, students will develop active listening skills and acquire oral and presentation skills. Various platforms will be provided for students to reinforce their oral skills.",
    "mcs": 6,
    "prerequisites": "CH1531",
    "preclusions": "",
    "corequisites": "",
    "hrs": 3,
    "remarks": "Year long course"
  },
  {
    "department": "CL",
    "level": 2,
    "sem": 1,
    "code": "CL2231",
    "type": "Elective",
    "title": "Chinese as 3rd Language IIA",
    "description": "This course is a continuation of CL1232 and it is meant only for students who have completed and passed CL1232. The course emphasises the learning of new vocabularies, the constructing of simple sentences and writing of short compositions. The course also aims to equip pupils with comprehension and conversational skills in Chinese.",
    "mcs": 3,
    "prerequisites": "CL1232",
    "preclusions": "",
    "corequisites": "",
    "hrs": 3,
    "remarks": "*Pre-requisites refer to students having to pass the course by attaining at least 50% (overall) in order to advance to the next level.  For example, students will be required to attain at least 50% for CL1231 in order to advance to CL1232."
  },
  {
    "department": "CL",
    "level": 2,
    "sem": 2,
    "code": "CL2232",
    "type": "Elective",
    "title": "Chinese as 3rd Language IIB",
    "description": "This course is a continuation of CL2231.  Please refer to Description for CL2231.",
    "mcs": 3,
    "prerequisites": "CL2231",
    "preclusions": "",
    "corequisites": "",
    "hrs": 3,
    "remarks": "*Pre-requisites refer to students having to pass the course by attaining at least 50% (overall) in order to advance to the next level.  For example, students will be required to attain at least 50% for CL1231 in order to advance to CL1232."
  },
  {
    "department": "CL",
    "level": 2,
    "sem": "1 and 2",
    "code": "CL2531",
    "type": "Core",
    "title": "Chinese II",
    "description": "This course focuses on equipping students with narrative and descriptive writing skills at the intermediate level. Continued emphasis will be given to the acquisition of oral and listening skills.  Under the section of functional writing, other than continuing with informal emails that pertain to daily life, students will also learn to discuss and analyse current affairs via emails. More platforms will be provided for students to hone their presentation skills.",
    "mcs": 6,
    "prerequisites": "None",
    "preclusions": "",
    "corequisites": "",
    "hrs": 3,
    "remarks": "Year long course"
  },
  {
    "department": "CH",
    "level": 3,
    "sem": "1 and 2",
    "code": "CH3531",
    "type": "Core",
    "title": "Higher Chinese III",
    "description": "The course focuses on equipping students with more advanced writing skills. More emphasis will be given to argumentative writing. In addition, they will also be taught skills in speech writing. Under the section of functional writing, students will continue to brush up on the writing of emails, both formal and informal. In addition, they will be introduced to the writing of blogs and forums, which require critical thinking and analytical skills in response to current affairs. In preparation for national exams, students will be taught summary writing skills as well as correction of ungrammatical sentences. More lesson time will be allocated to oral presentations which will prepare students for their oral report in the exams. Interactive learning will continue to be an important feature of the classroom climate.",
    "mcs": 8,
    "prerequisites": "CH2531",
    "preclusions": "",
    "corequisites": "",
    "hrs": 3,
    "remarks": "Year long course"
  },
  {
    "department": "CL",
    "level": 3,
    "sem": 1,
    "code": "CL3231",
    "type": "Elective",
    "title": "Chinese as 3rd Language IIIA",
    "description": "This course is a continuation of Chinese as 3rd Lang Level 2 and it is meant only for students who have completed and passed CL2231 and CL2232. The course will equip students with stronger conversational and writing skills.  Comprehension skills will be enhanced with the grasp of Chinese vocabularies.  This will be an important preparatory stage for students who intend to sit for theGCE ‘O’ Level Chinese Special Programme Examination upon completion of the 4 year programme.",
    "mcs": 3,
    "prerequisites": "CL2232",
    "preclusions": "",
    "corequisites": "",
    "hrs": 3,
    "remarks": "*Pre-requisites refer to students having to pass the course by attaining at least 50% (overall) in order to advance to the next level.  For example, students will be required to attain at least 50%for CL1231 in order to advance to CL1232."
  },
  {
    "department": "CL",
    "level": 3,
    "sem": 2,
    "code": "CL3232",
    "type": "Elective",
    "title": "Chinese as 3rd Language IIIB",
    "description": "This course is a continuation of CL3231.  Please refer to Description for CL3231.",
    "mcs": 3,
    "prerequisites": "CL3231",
    "preclusions": "",
    "corequisites": "",
    "hrs": 3,
    "remarks": "*Pre-requisites refer to students having to pass the course by attaining at least 50% (overall) in order to advance to the next level.  For example, students will be required to attain at least 50% for CL1231 in order to advance to CL1232."
  },
  {
    "department": "CL",
    "level": 3,
    "sem": "1 and 2",
    "code": "CL3531",
    "type": "Core",
    "title": "Chinese III",
    "description": "This course focuses on equipping students with more advanced writing skills. More emphasis will be given to argumentative and expository writing. Under the section of functional writing, other than informal emails, students will learn to write formal emails.  To prepare students for national exams, there will be a greater emphasis on training of oral presentation skills on top of the teaching of writing skills. Reading and comprehension will take precedence over rote learning of words and phrases.",
    "mcs": 6,
    "prerequisites": "None",
    "preclusions": "",
    "corequisites": "",
    "hrs": 3,
    "remarks": "Year long course"
  },
  {
    "department": "CH",
    "level": 4,
    "sem": "1 and 2",
    "code": "CH4531",
    "type": "Core",
    "title": "Higher Chinese IV",
    "description": "In this course, there will be a continued emphasis on the training of advanced writing skills, with more reference to current affairs. In preparation for national exams at the second half of the year, more time will be allocated to the drilling of summary writing, correction of ungrammatical sentences, answering techniques in comprehension and presentation skills required in oral reports based on video clips.",
    "mcs": 8,
    "prerequisites": "CH3531",
    "preclusions": "",
    "corequisites": "",
    "hrs": 3,
    "remarks": "Year long course"
  },
  {
    "department": "CL",
    "level": 4,
    "sem": 1,
    "code": "CL4231",
    "type": "Elective",
    "title": "Chinese as 3rd Language IVA",
    "description": "This course is a continuation of Chinese as 3rd Lang Level 3 and it is meant only for students who have completed and passed CL3231 and CL3232. The course will serve to enhance students’ conversational and writing skills, comparable to the standards required for the year-end GCE ‘O’ Level Chinese Special Programme Exam.",
    "mcs": 3,
    "prerequisites": "CL3232",
    "preclusions": "",
    "corequisites": "",
    "hrs": 3,
    "remarks": "*Pre-requisites refer to students having to pass the course by attaining at least 50% (overall) in order to advance to the next level.  For example, students will be required to attain at least 50% for CL1231 in order to advance to CL1232."
  },
  {
    "department": "CL",
    "level": 4,
    "sem": 2,
    "code": "CL4232",
    "type": "Elective",
    "title": "Chinese as 3rd Language IVB",
    "description": "This course is a continuation of CL4231.  Please refer to Description for CL4231.  Completing this course marks the completion of the entire programme (level 1 to level 4).",
    "mcs": 3,
    "prerequisites": "CL4231",
    "preclusions": "",
    "corequisites": "",
    "hrs": 3,
    "remarks": "*Pre-requisites refer to students having to pass the course by attaining at least 50% (overall) in order to advance to the next level.  For example, students will be required to attain at least 50% for CL1231 in order to advance to CL1232."
  },
  {
    "department": "CL",
    "level": 4,
    "sem": "1 and 2",
    "code": "CL4531",
    "type": "Core",
    "title": "Chinese IV",
    "description": "In this course, the training of argumentative and expository writing skills will continue to be the main focus. To equip students for national exams, more lesson time will be allocated to oral presentations. Interactive learning will continue to be an important feature of the classroom climate. Reading and comprehension will take precedence over rote learning of words and phrases. Students will also be introduced to basic summary skills to prepare them for H1 Chinese in Year 5.",
    "mcs": 8,
    "prerequisites": "None",
    "preclusions": "",
    "corequisites": "",
    "hrs": 3,
    "remarks": "Year long course"
  },
  {
    "department": "CL",
    "level": 5,
    "sem": "1 and 2",
    "code": "CL5531",
    "type": "Core",
    "title": "Chinese V",
    "description": "This course will equip students with the necessary skills to prepare for their oral report during the national exams.  Other than honing oral presentation skills, students will develop more advanced reading skills so as to have a deeper understanding of the text. In addition, students will be taught how to write complex narrative and argumentative essays to further develop their competency in writing.",
    "mcs": 8,
    "prerequisites": "None",
    "preclusions": "",
    "corequisites": "",
    "hrs": 3,
    "remarks": "Year long course"
  },
  {
    "department": "JP",
    "level": 1,
    "sem": 1,
    "code": "JP1231",
    "type": "Elective",
    "title": "Japanese as 3rd Language IA",
    "description": "This course is opened to students who have no prior Japanese language background. The course fee per month is $100 and charged for the WHOLE Semester (Jan - Jun). The goal of this course is to acquire communication skills in the Japanese language in order to interact with native speakers of Japanese in a culturally appropriate manner. Students will also learn how to read and write simple texts in hiragana and katakana. By the end of the semester, students should be able to make simple greetings, introduce people, communicate while shopping, ask for information such as time, prices etc., ask for directions, and invite people.",
    "mcs": 3,
    "prerequisites": "None",
    "preclusions": "",
    "corequisites": "",
    "hrs": 3,
    "remarks": "*Pre-requisites refer to students having to pass the course by attaining at least 50% (overall) in order to advance to the next level.  For example, students will be required to attain at least 50% for JP1231 in order to advance to JP1232. **For students taking Japanese as Mother Tongue in lieu, this course will be regarded as a core course.  As such, the course code will be reflected as JP1531 (and not JP1231)."
  },
  {
    "department": "JP",
    "level": 1,
    "sem": 2,
    "code": "JP1232",
    "type": "Elective",
    "title": "Japanese as 3rd Language IB",
    "description": "The course fee per month is $100 and charged for the WHOLE Semester (Jul - Dec). This course is a continuation of JP1231.  Please refer to Description for JP1231.",
    "mcs": 3,
    "prerequisites": "JP1231",
    "preclusions": "",
    "corequisites": "",
    "hrs": 3,
    "remarks": "*Pre-requisites refer to students having to pass the course by attaining at least 50% (overall) in order to advance to the next level.  For example, students will be required to attain at least 50% for JP1231 in order to advance to JP1232. **For students taking Japanese as Mother Tongue in lieu, this course will be regarded as a core course.  As such, the course code will be reflected as JP1531 (and not JP1231)."
  },
  {
    "department": "JP",
    "level": 2,
    "sem": 1,
    "code": "JP2231",
    "type": "Elective",
    "title": "Japanese as 3rd Language IIA",
    "description": "The course fee per month is $100 and charged for the WHOLE Semester (Jan - Jun). This course builds upon the basis of Japanese Level 1 and aims to develop basic linguistic and socio-cultural skills to expand the repertoire of the daily topics and situations with simple structures. Approximately 110 kanji and 180 kanji-words will be introduced. While more emphasis is placed on the development of oral communication skills, students will also learn how to read and write simple and short compositions.",
    "mcs": 3,
    "prerequisites": "JP1232",
    "preclusions": "",
    "corequisites": "",
    "hrs": 3,
    "remarks": "*Pre-requisites refer to students having to pass the course by attaining at least 50% (overall) in order to advance to the next level.  For example, students will be required to attain at least 50% for JP1231 in order to advance to JP1232. **For students taking Japanese as Mother Tongue in lieu, this course will be regarded as a core course.  As such, the course code will be reflected as JP1531 (and not JP1231)."
  },
  {
    "department": "JP",
    "level": 2,
    "sem": 2,
    "code": "JP2232",
    "type": "Elective",
    "title": "Japanese as 3rd Language IIB",
    "description": "The course fee per month is $100 and charged for the WHOLE Semester (Jul - Dec). This course is a continuation of JP2231.  Please refer to Description for JP2231.",
    "mcs": 3,
    "prerequisites": "JP2231",
    "preclusions": "",
    "corequisites": "",
    "hrs": 3,
    "remarks": "*Pre-requisites refer to students having to pass the course by attaining at least 50% (overall) in order to advance to the next level.  For example, students will be required to attain at least 50% for JP1231 in order to advance to JP1232. **For students taking Japanese as Mother Tongue in lieu, this course will be regarded as a core course.  As such, the course code will be reflected as JP1531 (and not JP1231)."
  },
  {
    "department": "JP",
    "level": 3,
    "sem": 1,
    "code": "JP3231",
    "type": "Elective",
    "title": "Japanese as 3rd Language IIIA",
    "description": "The course fee per month is $100 and charged for the WHOLE Semester (Jan - Jun). Building upon the basis of Japanese Level 2 (JP2231 & JP2232), this course develops students' ability to communicate and expands the repertoire of daily topics and situations. Complex structures such as transitive and intransitive, conditionals and passive forms are introduced. Approximately 150 kanji and 200 kanji - words will be introduced. With this knowledge of characters, student s will be able to understand and write simple and short essays.",
    "mcs": 3,
    "prerequisites": "JP2232",
    "preclusions": "",
    "corequisites": "",
    "hrs": 3,
    "remarks": "*Pre-requisites refer to students having to pass the course by attaining at least 50% (overall) in order to advance to the next level.  For example, students will be required to attain at least 50% for JP1231 in order to advance to JP1232. **For students taking Japanese as Mother Tongue in lieu, this course will be regarded as a core course.  As such, the course code will be reflected as JP1531 (and not JP1231)."
  },
  {
    "department": "JP",
    "level": 3,
    "sem": 2,
    "code": "JP3232",
    "type": "Elective",
    "title": "Japanese as 3rd Language IIIB",
    "description": "The course fee per month is $100 and charged for the WHOLE Semester (Jul - Dec). This course is a continuation of JP3231.  Please refer to Description for JP3231.",
    "mcs": 3,
    "prerequisites": "JP3231",
    "preclusions": "",
    "corequisites": "",
    "hrs": 3,
    "remarks": "*Pre-requisites refer to students having to pass the course by attaining at least 50% (overall) in order to advance to the next level.  For example, students will be required to attain at least 50% for JP1231 in order to advance to JP1232. **For students taking Japanese as Mother Tongue in lieu, this course will be regarded as a core course.  As such, the course code will be reflected as JP1531 (and not JP1231)."
  },
  {
    "department": "JP",
    "level": 4,
    "sem": 1,
    "code": "JP4231",
    "type": "Elective",
    "title": "Japanese as 3rd Language IVA",
    "description": "The course fee per month is $100 and charged for the WHOLE Semester (Jan - Jun). Building upon the basis of Japanese Level 3 (JP3231 & JP3232), this course aims to further develop students’ communication skills in Japanese on daily topics of general interests. The course has a special focus on polite expressions which enables students to communicate appropriately in academic and business situations. Appropriately 150 kanji and 200 kanjiwords will be introduced. With this knowledge of characters, students will be able to understand letters with fairly formal written language. This course will complete the four year course of elementary Japanese and will equip students with good foundation to progress to intermediate and advance levels of Japanese studies.",
    "mcs": 3,
    "prerequisites": "JP3232",
    "preclusions": "",
    "corequisites": "",
    "hrs": 3,
    "remarks": "*Pre-requisites refer to students having to pass the course by attaining at least 50% (overall) in order to advance to the next level.  For example, students will be required to attain at least 50% for JP1231 in order to advance to JP1232. **For students taking Japanese as Mother Tongue in lieu, this course will be regarded as a core course.  As such, the course code will be reflected as JP1531 (and not JP1231)."
  },
  {
    "department": "JP",
    "level": 4,
    "sem": 2,
    "code": "JP4232",
    "type": "Elective",
    "title": "Japanese as 3rd Language IVB",
    "description": "The course fee per month is $100 and charged for the WHOLE Semester (Jul - Dec). This course is a continuation of JP4231.  Please refer to Description for JP4231.  Completing this course marks the completion of the entire programme (level 1 to level 4).",
    "mcs": 3,
    "prerequisites": "JP4231",
    "preclusions": "",
    "corequisites": "",
    "hrs": 3,
    "remarks": "*Pre-requisites refer to students having to pass the course by attaining at least 50% (overall) in order to advance to the next level.  For example, students will be required to attain at least 50% for JP1231 in order to advance to JP1232. **For students taking Japanese as Mother Tongue in lieu, this course will be regarded as a core course.  As such, the course code will be reflected as JP1531 (and not JP1231)."
  },
  {
    "department": "MH",
    "level": 1,
    "sem": "1 and 2",
    "code": "MH1531",
    "type": "Core",
    "title": "Higher Malay I",
    "description": "This course aims to equip students with strong communication skills, acquire and disseminate information effectively and generate ideas through the use of the Malay language. It also aims to deepen students’ understanding and appreciation of the Malay language, history and culture.  There will be emphasis on building strong communication skills, critical-thinking and problem-solving, more lesson time will be allocated to oral presentations and debate sessions.",
    "mcs": 6,
    "prerequisites": "None",
    "preclusions": "",
    "corequisites": "",
    "hrs": 3,
    "remarks": "Year long course"
  },
  {
    "department": "ML",
    "level": 1,
    "sem": 1,
    "code": "ML1231",
    "type": "Elective",
    "title": "Malay as 3rd Language IA",
    "description": "This course is opened to students who have no prior Malay language background.  This course aims to equip pupils with the skills of understanding standardised spoken Malay language. At the end of the program (i.e. at the 4th level), students should be able to converse fluently in Malay language on common everyday situations that people might talk about as well as being understood by native speakers.  In this course, students will acquire language skills through participation in various communicative and written tasks. Through the exposure to the language, students will develop a general understanding of the Malay culture, the sociolinguistic and pragmatic aspects of the language. They will be given exposure to simple poetry and prose.",
    "mcs": 3,
    "prerequisites": "None",
    "preclusions": "",
    "corequisites": "",
    "hrs": 3,
    "remarks": ""
  },
  {
    "department": "ML",
    "level": 1,
    "sem": 2,
    "code": "ML1232",
    "type": "Elective",
    "title": "Malay as 3rd Language IB",
    "description": "This course is a continuation of the skills developed in Semester One.  Oral and listening skills will continue to be emphasised in this course. Communicative skills will be garnered through various forms, such as role-plays, skits, short speeches, etc. Reading and writing skills will be exposed to them as well. Grammar aspects will continue to be taught through interactive approach.",
    "mcs": 3,
    "prerequisites": "ML1231",
    "preclusions": "",
    "corequisites": "",
    "hrs": 3,
    "remarks": "*Pre-requisites refer to students having to pass the course by attaining at least 50% (overall) in order to advance to the next level.  For example, students will be required to attain at least 50% for ML1231 in order to advance to ML1232."
  },
  {
    "department": "ML",
    "level": 1,
    "sem": "1 and 2",
    "code": "ML1531",
    "type": "Core",
    "title": "Malay I",
    "description": "This course aims to equip students with effective communication skills, acquire and disseminate information and generate ideas through the use of the Malay language as well as appreciate and understand various forms of Malay cultures. Much emphasis will be given to the acquisition of oral and listening skills. Under the section of functional writing, students will learn how to write personal emails with reference to daily life.",
    "mcs": 6,
    "prerequisites": "None",
    "preclusions": "",
    "corequisites": "",
    "hrs": 3,
    "remarks": "Year long course"
  },
  {
    "department": "MH",
    "level": 2,
    "sem": "1 and 2",
    "code": "MH2531",
    "type": "Core",
    "title": "Higher Malay II",
    "description": "In this course, students will be exposed to literature, which include poetry, plays, essays, biography, and autobiography. This course focuses on the development of skills in expository and persuasive writing.",
    "mcs": 6,
    "prerequisites": "MH1531",
    "preclusions": "",
    "corequisites": "",
    "hrs": 3,
    "remarks": "Year long course"
  },
  {
    "department": "ML",
    "level": 2,
    "sem": 1,
    "code": "ML2231",
    "type": "Elective",
    "title": "Malay as 3rd Language IIA",
    "description": "This course will build on the skills of ML1232. Students will be able to understand main contents of essays, poetry and prose. They will also be able to produce various forms of writing skills which evolve around common everyday situations and current affairs through various writing structures and styles. This course also aims toprovide understanding and awareness of the traditions and cultures of the Malay community which indirectly will help the students find its relevance to their own culture.",
    "mcs": 3,
    "prerequisites": "ML1232",
    "preclusions": "",
    "corequisites": "",
    "hrs": 3,
    "remarks": "*Pre-requisites refer to students having to pass the course by attaining at least 50% (overall) in order to advance to the next level.  Forexample, students will be required to attain at least 50% for ML1231 in order to advance to ML1232."
  },
  {
    "department": "ML",
    "level": 2,
    "sem": 2,
    "code": "ML2232",
    "type": "Elective",
    "title": "Malay as 3rd Language IIB",
    "description": "This course will build on the skills taught in Semester One. Pupils will continue to be exposed to understand various forms of writing skills. Emphasis will also be given to their reading fluency and pronunciations. Educational trips (such as home stay) may also be embarked upon, to enhance their interest and to provide deeper understanding and awareness of the traditions and cultures of the Malay community.",
    "mcs": 3,
    "prerequisites": "ML2231",
    "preclusions": "",
    "corequisites": "",
    "hrs": 3,
    "remarks": "*Pre-requisites refer to students having to pass the course by attaining at least 50% (overall) in order to advance to the next level.  For example, students will be required to attain at least 50% for ML1231 in order to advance to ML1232."
  },
  {
    "department": "ML",
    "level": 2,
    "sem": "1 and 2",
    "code": "ML2531",
    "type": "Core",
    "title": "Malay II",
    "description": "This course emphasizes on honing the students’ grammar skills. Students will be exposed to developing figurative and evaluative language, developing the noun group using adjectival phrases as well the noun-verb relationship: subject-verb agreement. Continued emphasis will be given to the acquisition of oral and listening skills.   Under the section of functional writing, other than continuing with personal emails that pertain to daily life, students will also learn to discuss and analyse current affairs via email. More platforms will be provided for students to hone their presentation skills.",
    "mcs": 6,
    "prerequisites": "None",
    "preclusions": "",
    "corequisites": "",
    "hrs": 3,
    "remarks": "Year long course"
  },
  {
    "department": "MH",
    "level": 3,
    "sem": "1 and 2",
    "code": "MH3531",
    "type": "Core",
    "title": "Higher Malay III",
    "description": "This course aims to equip students with a higher order of critical thinking skills. As such, language skills acquisition at this level will be deeply entrenched on students’ reasoning skills. More lesson time will be allocated to oral presentations which will prepare students for their oral report in the exams. Interactive learning will continue to be an important feature of the classroom climate.",
    "mcs": 8,
    "prerequisites": "MH2531",
    "preclusions": "",
    "corequisites": "",
    "hrs": 3,
    "remarks": "Year long course"
  },
  {
    "department": "ML",
    "level": 3,
    "sem": 1,
    "code": "ML3231",
    "type": "Elective",
    "title": "Malay as 3rd Language IIIA",
    "description": "This course will build on the skills of ML2232. Pupils will be more exposed in their four language skills of listening, speaking, reading and writing. It also aims to provide the pupils with more communicative competence in simple everyday situations and personal interaction. As with the other earlier courses, this course also aims to provide an understanding and awareness of the traditions and cultures of the Malay community which will help the students appreciate the learning of the language.",
    "mcs": 3,
    "prerequisites": "ML2232",
    "preclusions": "",
    "corequisites": "",
    "hrs": 3,
    "remarks": "*Pre-requisites refer to students having to pass the course by attaining at least 50% (overall) in order to advance to the next level.  For example, students will be required to attain at least 50% for ML1231 in order to advance to ML1232."
  },
  {
    "department": "ML",
    "level": 3,
    "sem": 2,
    "code": "ML3232",
    "type": "Elective",
    "title": "Malay as 3rd Language IIIB",
    "description": "This course is a continuation of the skills developed in Semester One. Pupils will continue to be exposed in their four language skills of listening, speaking, reading and writing. It also aims to provide the pupils with more communicative competence in simple everyday situations and personal interaction. In this semester, pupils’ understanding and awareness of the traditions and culturesof the Malay community will be enhanced through experiential learning, such as Learning Journeys.",
    "mcs": 3,
    "prerequisites": "ML3231",
    "preclusions": "",
    "corequisites": "",
    "hrs": 3,
    "remarks": "*Pre-requisites refer to students having to pass the course by attaining at least 50% (overall) in order to advance to the next level.  For example, students will be required to attain at least 50%for ML1231 in order to advance to ML1232."
  },
  {
    "department": "ML",
    "level": 3,
    "sem": "1 and 2",
    "code": "ML3531",
    "type": "Core",
    "title": "Malay III",
    "description": "This course focuses on equipping students with more advanced writing skills. More emphasis will be given to argumentative and expository writing. Under the section of functional writing, other than informal emails, students will learn to pen formal emails. To prepare students for national exams, there will be a greater emphasis on training of oral presentation skills, on top of the teaching of writing skills.",
    "mcs": 6,
    "prerequisites": "None",
    "preclusions": "",
    "corequisites": "",
    "hrs": 3,
    "remarks": "Year long course"
  },
  {
    "department": "MH",
    "level": 4,
    "sem": "1 and 2",
    "code": "MH4531",
    "type": "Core",
    "title": "Higher Malay IV",
    "description": "This course continues to equip students with language acquisition skills through the use of critical thinking skills. There will be a continued emphasis on the training of advanced writing skills, with more reference to current affairs and controversial topics. In preparation for national exams at the second half of the year, more time will be allocated to the drilling of summary writing, correction of ungrammatical sentences, answering techniques in comprehension and presentation skills required in oral reports based on video clips.",
    "mcs": 8,
    "prerequisites": "MH3531",
    "preclusions": "",
    "corequisites": "",
    "hrs": 3,
    "remarks": "Year long course"
  },
  {
    "department": "ML",
    "level": 4,
    "sem": 1,
    "code": "ML4231",
    "type": "Elective",
    "title": "Malay as 3rd Language IVA",
    "description": "This course is critical in enhancing holistic learning for the pupils. A more rigorous and comprehensive approach will be adopted throughout the whole semester. At this stage, pupils are expected to have a sound mastery of the four language skills of listening, speaking, reading and writing. Applying all of these language skills at a higher level in their presentations and projects are among the pre-requisites of this course.",
    "mcs": 3,
    "prerequisites": "ML3232",
    "preclusions": "",
    "corequisites": "",
    "hrs": 3,
    "remarks": "*Pre-requisites refer to students having to pass the course by attaining at least 50% (overall) in order to advance to the next level.  For example, students will be required to attain at least 50% for ML1231 in order to advance to ML1232."
  },
  {
    "department": "ML",
    "level": 4,
    "sem": 2,
    "code": "ML4232",
    "type": "Elective",
    "title": "Malay as 3rd Language IVB",
    "description": "As the final course of the 4-year programme, pupils will be further equipped with all the essential skills that are required for higher learning. They are further exposed to various tools of communication, both formal and informal. Understanding the culture and society goes beyond speaking the language but immersing oneself in it and appreciating the culture as a whole. At this stage, pupils will gain more exposure into the language, culture and lifestyle of the Malay community, local and beyond for further insights. Completing this course marks the completion of the entire programme (level 1 to level 4).",
    "mcs": 3,
    "prerequisites": "ML4231",
    "preclusions": "",
    "corequisites": "",
    "hrs": 3,
    "remarks": "*Pre-requisites refer to students having to pass the course by attaining at least 50% (overall) in order to advance to the next level.  For example, students will be required to attain at least 50% for ML1231 in order to advance to ML1232."
  },
  {
    "department": "ML",
    "level": 4,
    "sem": "1 and 2",
    "code": "ML4531",
    "type": "Core",
    "title": "Malay IV",
    "description": "This course aims to develop students’ writing skills at a more advanced level. Students will also be further exposed to critical thinking skills in both oral and writing assessments. To equip students for their national exams, more lesson time will be allocated to oral presentations based on video clips and debate sessions. Interactive learning will continue to be an important feature of the classroom climate.",
    "mcs": 8,
    "prerequisites": "None",
    "preclusions": "",
    "corequisites": "",
    "hrs": 3,
    "remarks": "Year long course"
  },
  {
    "department": "ML",
    "level": 5,
    "sem": "1 and 2",
    "code": "ML5531",
    "type": "Core",
    "title": "Malay V",
    "description": "This course focuses on enhancing students’ knowledge and grasping broader concepts of current issues as the curriculum covers a wide range of topics which require students’ depth of knowledge in these issues. Focus will be on exposing students to concepts through analysis of newspaper and magazine articles, as well as through social media. Various platforms will be provided for students to reinforce their oral skills.",
    "mcs": 8,
    "prerequisites": "None",
    "preclusions": "",
    "corequisites": "",
    "hrs": 3,
    "remarks": "Year long course"
  },
  {
    "department": "TH",
    "level": 1,
    "sem": "1 and 2",
    "code": "TH1531",
    "type": "Core",
    "title": "Higher Tamil I",
    "description": "This course helps to develop students’ reading, writing, listening and speaking skills needed to become effective users of the Tamil language. This course enhances students’ vocabulary through quizzes, marabhuthodargal, enaimozhigal, uvamaiththodargal and proverbs. Students will learn to write informal emails, descriptive and narrative essays. Students will deepen their understanding of their culture through doing project work.",
    "mcs": 6,
    "prerequisites": "None",
    "preclusions": "",
    "corequisites": "",
    "hrs": 3,
    "remarks": "Year long course"
  },
  {
    "department": "TL",
    "level": 1,
    "sem": "1 and 2",
    "code": "TL1531",
    "type": "Core",
    "title": "Tamil I",
    "description": "This course aims to develop students’ reading, writing listening and speaking skills that are needed to become effective users of the Tamil language. Through marabhuthodargal and enaimozhigal students will learn and understand the language in depth. This course will also equip students with narrative writing skills at the intermediate level.  Students will learn to write informal emails with reference to daily life.",
    "mcs": 6,
    "prerequisites": "None",
    "preclusions": "",
    "corequisites": "",
    "hrs": 3,
    "remarks": "Year long course"
  },
  {
    "department": "TH",
    "level": 2,
    "sem": "1 and 2",
    "code": "TH2531",
    "type": "Core",
    "title": "Higher Tamil II",
    "description": "This course helps to strengthen the students’ communication skills. Students will learn to write formal emails and comments in the web forum.  They will further develop and enhance their descriptive and narrative writing skills. Argumentative writing will also be introduced to hone the students’ critical thinking skills. Through classroom discussions and group work, students will develop active listening skills and acquire oral and presentation skills. Various platforms will be provided for students to reinforce their oral skills.",
    "mcs": 6,
    "prerequisites": "TH1531",
    "preclusions": "",
    "corequisites": "",
    "hrs": 3,
    "remarks": "Year long course"
  },
  {
    "department": "TL",
    "level": 2,
    "sem": "1 and 2",
    "code": "TL2531",
    "type": "Core",
    "title": "Tamil II",
    "description": "This course aims to help the students develop their reading, writing, listening and speaking skills needed to become effective users of the Tamil language. Through marabhuthodargal, enaimozhigal, uvamaiththodargal and proverbs, students will learn and understand the language in depth. This course develops and further enhances students with narrative and descriptive writing skills.  They will also learn to write emails with reference to current affairs.",
    "mcs": 6,
    "prerequisites": "None",
    "preclusions": "",
    "corequisites": "",
    "hrs": 3,
    "remarks": "Year long course"
  },
  {
    "department": "TH",
    "level": 3,
    "sem": "1 and 2",
    "code": "TH3531",
    "type": "Core",
    "title": "Higher Tamil III",
    "description": "This course focuses on equipping students with more advanced writing skills. More emphasis will be given to argumentative and expository writing. This course emphasis more on summary writing, comprehension writing skills and more practice will be given on cloze passage and text editing. Students will also learn through various modes of instructions such as classroom discussions, debates, project presentations and peer critiques.",
    "mcs": 8,
    "prerequisites": "TH2531",
    "preclusions": "",
    "corequisites": "",
    "hrs": 3,
    "remarks": "Year long course"
  },
  {
    "department": "TL",
    "level": 3,
    "sem": "1 and 2",
    "code": "TL3531",
    "type": "Core",
    "title": "Tamil III",
    "description": "This course focuses on equipping students with more advanced writing skills, such as argumentative and expository writing. Along with email writing, students will learn to write their comments or opinions in the web forum. There will be more practice on cloze passages and sentence completions. Students will be given opportunities to develop their public speaking skills through oral presentations in the classroom.",
    "mcs": 6,
    "prerequisites": "None",
    "preclusions": "",
    "corequisites": "",
    "hrs": 3,
    "remarks": "Year long course"
  },
  {
    "department": "TH",
    "level": 4,
    "sem": "1 and 2",
    "code": "TH4531",
    "type": "Core",
    "title": "Higher Tamil IV",
    "description": "This course will further refine students’ comprehension and summary writing skills.  The overall aim of this course is to reinforce students’ speaking, reading, listening and writing skills. More practice will be given based on the exam components. At the end of the course, students should be proficient in the speaking, reading, and writing of Tamil language, as well as in their listening skills.",
    "mcs": 8,
    "prerequisites": "TH3531",
    "preclusions": "",
    "corequisites": "",
    "hrs": 3,
    "remarks": "Year long course"
  },
  {
    "department": "TL",
    "level": 4,
    "sem": "1 and 2",
    "code": "TL4531",
    "type": "Core",
    "title": "Tamil IV",
    "description": "This course focuses more on sharpening the students’ writing skills. This course helps to develop students’ argumentative and expository writing skills at the advanced level. Under functional writing, students will have more practice on email writing and forum writing. Students will be given opportunities to develop their public speaking skills through the oral presentation in class. More practice will be given to prepare the students for the national examination.",
    "mcs": 8,
    "prerequisites": "None",
    "preclusions": "",
    "corequisites": "",
    "hrs": 3,
    "remarks": "Year long course"
  },
  {
    "department": "TL",
    "level": 5,
    "sem": "1 and 2",
    "code": "TL5531",
    "type": "Core",
    "title": "Tamil V",
    "description": "This course aims to improve the students’ communication skills through in-class presentations, debates and discussions on essays topics. Students will be taught to write complex narrative and argumentative essays to further develop their writing skills. They will learn the command of the language in more depth through the more advanced marabhuthodargal, enaimozhigal and uvamaiththodargal. They will also learn sorpunarchi.",
    "mcs": 8,
    "prerequisites": "None",
    "preclusions": "",
    "corequisites": "",
    "hrs": 3,
    "remarks": "Year long course"
  },
  {
    "department": "HU",
    "level": 1,
    "sem": "1 and 2",
    "code": "HU1131",
    "type": "Core",
    "title": "Humanities Studies I",
    "description": "Under Citizenship and Diversity, students explore the different factors shaping diversity in Singapore society.  They would examine the growth of Singapore from a diverse to a united nation as well as the citizens’ response over the years. The course introduces students to the complexity of citizenship and the competing needs and interests of different groups of people in a society; managing these would require trade-offs.  Students would discuss the complementary roles of government and citizens in working for the good of the society. They would also look at the challenges and opportunities of diversity and the government’s response in shaping harmony in society.  Under the theme of Economic Development in this course, students would be introduced to the different phases and factors that bring about Singapore’s economic development - from an economy that was focused on labour-intensive industries to the economy that was focused on capital-intensive industries and trade-oriented open economy. This theme of the course focuses on key events and measures that had shaped Singapore’s economy over the years, and the people that had built our economic success. Students would also examine the importance of regional and global cooperation for Singapore’s continued economic development.",
    "mcs": 4,
    "prerequisites": "None",
    "preclusions": "",
    "corequisites": "",
    "hrs": 2,
    "remarks": "Year long course"
  },
  {
    "department": "HU",
    "level": 2,
    "sem": "1 and 2",
    "code": "HU2131",
    "type": "Core",
    "title": "Humanities Studies II",
    "description": "This course focuses on the theme “Being Part of a Globalised World”; it seeks to explore multiple perspectives on the impacts of globalisation in three areas: economy, culture and security.  Students will learn how the uneven impacts in each of these three areas result in tensions and trade-offs which can help them better understand the complex nature of globalisation.  Students will also discuss how these impacts lead to different responses from countries, companies and individuals.  The different responses and trade-offs mean that the tensions will continue to remain and shape debates and policy-making.  In this course, students are grouped into delegations and are intensively involved in the research and the writing of position papers on global issues. This culminates in experiential learning in a model UN conference as students role-play as delegates and participate in debates on global issues and the writing of resolutions.",
    "mcs": 2,
    "prerequisites": "HU1131",
    "preclusions": "",
    "corequisites": "",
    "hrs": 1,
    "remarks": "Year long course"
  },
  {
    "department": "HU",
    "level": 6,
    "sem": "1 and 2",
    "code": "HU6131",
    "type": "Core (nonMajor)",
    "title": "Capstone",
    "description": "The Capstone course is a year-long course. It aims to develop the higher-order qualities of mind in students and build the capacity to engage in inquiry in civic and general interest issues. Students build content and knowledge in the humanities discipline and multi-disciplinary issues through tapping into virtual learning platforms, e.g. MOOCs and adopting a reflective learning process. Students will choose a multi-disciplinary issue and conduct literature reviews, draft proposals and propose methodologies for research into this issue.",
    "mcs": 2,
    "prerequisites": "None",
    "preclusions": "Humanities Majors and other students who have fulfilled the grade requirements in 2 approved Humanities electives.",
    "corequisites": "",
    "hrs": 1,
    "remarks": "Year long course"
  },
  {
    "department": "EC",
    "level": 4,
    "sem": 1,
    "code": "EC4131",
    "type": "Core (Major)",
    "title": "Economic Insights I",
    "description": "This course introduces the central problem of economics and guides students to use concepts of demand and supply to analyse markets. This course provides the foundation for firms' theory and spectrum of market competitions. Students will apply various theories to analyse the behaviour of firms in different market structures and explore the effects of the behaviour on efficiencies and society's welfare.",
    "mcs": 4,
    "prerequisites": "None",
    "preclusions": "",
    "corequisites": "",
    "hrs": 3,
    "remarks": ""
  },
  {
    "department": "EC",
    "level": 4,
    "sem": 2,
    "code": "EC4132",
    "type": "Core (Major)",
    "title": "Economic Insights II",
    "description": "This course introduces students to Macroeconomics. Students will learn and apply the tools economists use to describe and explain the macroeconomy. Students will investigate the reasons behind macroeconomic problems and explain governments' policies to resolve these problems. Students will also learn the trade theories and explore the reasons for international trade and why countries still adopt protectionism despite trade benefits.",
    "mcs": 4,
    "prerequisites": "None",
    "preclusions": "",
    "corequisites": "",
    "hrs": 3,
    "remarks": ""
  },
  {
    "department": "EC",
    "level": 5,
    "sem": 1,
    "code": "EC5131",
    "type": "Core (Major)",
    "title": "Economic Insights III",
    "description": "The course introduces the concepts of market failure and explores why the market fails and the effectiveness of government intervention in these markets. Students will critically evaluate market failure and associated policy effectiveness, focusing on externalities, public goods. The course will also explore the effects of market dominance, analysing how a firm's behaviour within various market structures will result in market failure.",
    "mcs": 4,
    "prerequisites": "None",
    "preclusions": "",
    "corequisites": "",
    "hrs": 3,
    "remarks": ""
  },
  {
    "department": "EC",
    "level": 5,
    "sem": 2,
    "code": "EC5132",
    "type": "Core (Major)",
    "title": "Economic Insights IV",
    "description": "This course equips students with additional tools to analyse the macroeconomy. Students will examine further the role of money in monetary policies and the objective of external stability in the balance of payment and exchange rates. Building upon the knowledge and skills in previous courses, students will examine the various causes of macroeconomic problems and discuss the effectiveness of governments in resolving these problems, focusing on the role of the Singapore government in dealing with past economic crises.",
    "mcs": 4,
    "prerequisites": "None",
    "preclusions": "",
    "corequisites": "",
    "hrs": 3,
    "remarks": ""
  },
  {
    "department": "EC",
    "level": 6,
    "sem": "1 and 2",
    "code": "EC6131",
    "type": "Core (Major)",
    "title": "Research in Economics",
    "description": "This is a year-long course. Students will be engaged in a rigorous process of individual investigation of an Economics issue/topic to complete a Research Paper for submission.  The paper aims to reinforce and extend the learning of Economics concepts and skills. It challenges students to conduct an in-depth study and think critically about different perspectives.  In the process, students develop the ability to formulate informed opinions about the chosen Economics issue in the real world.",
    "mcs": 4,
    "prerequisites": "None",
    "preclusions": "",
    "corequisites": "",
    "hrs": 3,
    "remarks": "Year long course"
  },
  {
    "department": "EC",
    "level": 6,
    "sem": 2,
    "code": "EC6132",
    "type": "Core (Major)",
    "title": "Economic Insights V",
    "description": "The course provides a deepening of Economics concepts mastered in the earlier courses. The course will examine both the rational and irrational decision-making processes of individuals. By applying consumer behaviour theory and understanding elements of behavioural economics, students will analyse the decision-making processes of consumers, producers, and governments. Finally, students will explore the concepts of risk, uncertainty and asymmetric information in affecting the decision-making process.",
    "mcs": 4,
    "prerequisites": "None",
    "preclusions": "",
    "corequisites": "",
    "hrs": 3,
    "remarks": ""
  },
  {
    "department": "GE",
    "level": 2,
    "sem": 1,
    "code": "GE2131",
    "type": "Core",
    "title": "Geography Studies I",
    "description": "This course focuses on the physical geography topics of weather and climate and deforestation in tropical rainforests, as well as map reading techniques. IN the topic of weather and climate, students are introduced to the Koppen-Geiger climate classification system which identifies 5 climatic zones based on temperature and precipitation together with natural vegetation.  Students then learn about the weather elements and how each affects the weather and climaticconditions in different parts of the world. The study of the weather elements also includes the relevant weather instruments to collect weather data. Students apply their learning through the geographical investigation and fieldwork on their school grounds to collect authentic data for analysis as part of knowledge creation. They end the topic by studying the extreme weather conditions of tropical storms in terms of their causes, effects and management strategies. In the topic of deforestation of tropical rainforests, students learn about the unique characteristics and value of tropical rainforests first in order to enhance their appreciation for forest conservation and protection. Students explore the threats of deforestation and the challenges of forest protection and conservation through the lens of different cultures of the Amazon countries and their peoples. Through the study of the management issues and strategies employed in managing tropical storms and deforestation, students gain the awareness and a deeper understanding of the complexity of real-life issues that involve multiple stakeholders with diverse interests. Last but not least, students learn map reading techniques and interpretation skills as they practise with various topographical maps to make meaning of what they see on the maps.",
    "mcs": 2,
    "prerequisites": "HU1131",
    "preclusions": "",
    "corequisites": "",
    "hrs": 2,
    "remarks": ""
  },
  {
    "department": "GE",
    "level": 2,
    "sem": 2,
    "code": "GE2132",
    "type": "Core",
    "title": "Geography Studies II",
    "description": "This is the second Geography course for all students at Year 2. In Semester 2, students cover the human geography topics on population dynamics and urban development.  In population dynamics, students learn about population structures and gain a deeper understanding of factors contributing to demographic changes in a country or region over time. The course also focuses on pro-natalist and anti-natalist policies implemented in different countries to cope with demographic issues. The relationship between population change and the overall economic development of a country will be studied and discussed, using relevant named examples.  In urban development, students explore the concepts of urbanisation and urban growth, as well as the benefits and challenges of urban development.  The urban problems of transport and housing will be discussed and the measures to deal with them evaluated. As students explore the topics in the course, the distinction between the developing and the developed countries should serve to drive the message that there is no one-size-fits-all models, and students gain a deeper appreciation on the complexities of decision making.",
    "mcs": 2,
    "prerequisites": "GE2131",
    "preclusions": "",
    "corequisites": "",
    "hrs": 2,
    "remarks": ""
  },
  {
    "department": "GE",
    "level": 3,
    "sem": 1,
    "code": "GE3131",
    "type": "Core",
    "title": "Geography Studies III",
    "description": "This course is a core course. This course deals with the evolution of coastal landforms and features. It examines the coastal processes at work, the range of terrestrial, atmospheric, marine and biological factors that affect them, and the resultant changes that occur. The course also examines the environmental changes as a result of human action and changing land use in coastal zones, their ramifications and management strategies. This course also deals with the interiors of the Earth and its associated phenomena, landforms and features. The course examines the theories of continental drift, sea-floor spreading and plate tectonics in an attempt to understand the forces that helped shaped our planet. It explains the various forms of tectonic movements and their resultant landforms and features. It also looks at vulcanicity, earthquakes and other geographical phenomena resulting from tectonic activities and examines the often devastatingconsequences of these natural hazards as well as the ways people have learnt to respond to them.",
    "mcs": 3,
    "prerequisites": "GE2132",
    "preclusions": "",
    "corequisites": "",
    "hrs": 3,
    "remarks": ""
  },
  {
    "department": "GE",
    "level": 3,
    "sem": 2,
    "code": "GE3132",
    "type": "Core",
    "title": "Geography Studies IV",
    "description": "This core course deals with three geography topics – Global Tourism, Food Resources and Health and Diseases at the global and local scales. In the topic of Global Tourism, students study the factors leading to the growth in tourism, the different types of tourism and their contribution to the economic development of a country.  Students study and analyse the impacts of tourism development on people and the environment, and examine the issue of sustainable tourism management in different countries including Singapore. Under the topic of Food Resources, it focuses on food consumption, production and distribution patterns globally. It looks at the perplexing issue of food shortage leading to hunger in some countries and excess food resulting in obesity and food wastage in others. Students will also critically examine the role of technology in affecting food supply. With the concerns over increasing global population and environmental degradation, the possible solutions to food shortage are made more challenging and complex, going beyond just food supply. The topic on Health and Diseases focuses on the health of people and the main diseases affecting them. It examines the significance of people-environment interactions on diseases and mortality. It is concerned with the location and spatial spread of selected major diseases, the disease transmission cycles and intervention strategies to reduce disease burden. The course also studies the physical and socio-economic causes influencing the speed and agents of spread. Students will gain a deepened understanding of the relationship between unequal access to resources and physical well-being of people, as well as the importance of individual and collective responsibilities in responding to infectious diseases.",
    "mcs": 3,
    "prerequisites": "GE3131",
    "preclusions": "",
    "corequisites": "",
    "hrs": 3,
    "remarks": ""
  },
  {
    "department": "GE",
    "level": 4,
    "sem": 1,
    "code": "GE4131",
    "type": "Core (Major)",
    "title": "Geography Insights I",
    "description": "This course covers 2 main topics – (1) Fluvial Geomorphology and Hazard Management, and (2) Denudation and Mass Movements.  In (1), the topic focuses on the interactions between man and the environment in the study of fluvial geomorphology and hazard management.  Beginning with studying the drainage basin as a system, students learn how rivers work towards dynamic equilibrium through the fluvial processes of erosion, transportation and deposition as well as the factors influencing these processes. Students also examine flow and channel characteristics in influencing stream development and their related features and landforms. This topic ends off with a study on river management in the Mississippi River Basin and critically examine the impacts of man's modification of the natural environments and the attempts to control the forces of nature through hard and soft engineering.   In (2), students study the geomorphic processes of weathering, erosion and mass movement, and the role they play in landform and slope development. Finally, it looks at landform evolution on selected rock types (granite & limestone) under different climatic conditions (temperate & humid tropical regions).",
    "mcs": 4,
    "prerequisites": "None",
    "preclusions": "",
    "corequisites": "",
    "hrs": 3,
    "remarks": ""
  },
  {
    "department": "GE",
    "level": 4,
    "sem": 2,
    "code": "GE4132",
    "type": "Core (Major)",
    "title": "Geography Insights II",
    "description": "The course begins with recognising and understanding the inseparable, and often difficult relationship between environment and development. Drawing from the 1987 report of the World Commission on Environment and Development, the course begins with the symptoms and causes of a threatened future namely,poverty, growth, critical thresholds of our environment and economic using data and named examples. That provides the context to understanding sustainable development by exploring the concepts of needs and limitations at different scales. The theme of sustainable development would then be examined through the issue of climate change. The course focuses on the natural and anthropogenic causes of climate change and its effects on people and the environment, specifically in the areas of weather hazards and pollution. Students tap into, and build upon their prior knowledge of weather and climate with just-in-time inclusion of content concerning climatic variations such as Earth’s energy budget, atmospheric circulation, and El-Nino Southern Oscillation, etc.. Varied responses and mitigation measures planned and implemented in developed and developing countries would be discussed. It would be apparent that there are no straightforward cookie-cutter solutions for the issues and challenges arising, and countries would need to participate and cooperate with commitment at the global, regional and national levels to reduce and manage the impacts of climate change.",
    "mcs": 4,
    "prerequisites": "None",
    "preclusions": "",
    "corequisites": "",
    "hrs": 3,
    "remarks": ""
  },
  {
    "department": "GE",
    "level": 5,
    "sem": 1,
    "code": "GE5131",
    "type": "Core (Major)",
    "title": "Geography Insights III",
    "description": "The course continues to explore the theme of sustainable development through urban development and management. Students learn and explore the factors affecting the pattern of residential areas within urban areas, including physical factors, land values, ethnicity and planning. They would also discuss the incidence of poverty, deprivation and informal activity in urban areas at varying stages of development. The course also highlights the economic and demographic processes bringing change over time to urban systems such as gentrification, urban renewal, suburbanisation and counter-urbanisation, as well as the consequences of these processes. Students have a chance to learn and explore the concept of liveability in cities as they investigate urban development through the lens of the elderly in terms of their needs and experiences, and discuss the strategies used in different cities to manage aspirations of the people. Through the study of waste management in cities and urban reimaging experiences, the course aims to build on students' prior knowledge of population dynamics and migration, urbanisation as well as climate change in order to appreciate the complexity of sustainable urban development.",
    "mcs": 4,
    "prerequisites": "None",
    "preclusions": "",
    "corequisites": "",
    "hrs": 3,
    "remarks": ""
  },
  {
    "department": "GE",
    "level": 5,
    "sem": 2,
    "code": "GE5132",
    "type": "Core (Major)",
    "title": "Geography Insights IV",
    "description": "The course focuses on:  skills-based learning where students appreciate and are given the opportunities to make use of enabling technologies such as GIS and knowledge and skills learnt in geography to examine, address, represent and communicate the associated geographical phenomena, patterns and distribution;  Ethical issues with the use of data sources and information (primary, secondary, online sources, powerful and open source technologies like GIS) during the process of data collection, manipulation, representation and communication.    1. Definition of GIS  • What is GIS?  o Construct definitions of GIS  o Analytical capabilities of GISo Relevance of GIS • Describe components of GIS  o Hardware, Software, Input, Output  o Suggest enabling technologies, instruments and online resources to address geographical issues   2. GIS and Maps • What are maps?  o Comparison the purpose and types of maps used for similar focus / themes o Examine Political, Social, Cultural, Economic considerations  • Representation and Cartographic Communication of Map Outputs – Cartographer and Intended Audience Map Representation and Interpretation of geospatial data – Geometric, Attribute, Temporal Data  Base Map Creation with key map elements   3. Earth and its Coordinate System  • Map Projection  o Datum, Latitude, Longitude  o Spatial References, Coordinate Systems  o Distortions and Preservations  o Conformal, Equal-Area, Equal Distance  o Conical, Cylindrical, Azimuthal  4. Principles of Cartography  • Cartographic Design  o Key Map Elements  o Visual Hierarchy, Contrast, Figure Ground and Balance  o Typography, Scale and Generalization o Symbolisation and Colours  5. Spatial Data and Data Models • Vector and Raster Data Models  o Vector and Raster Data  o Advantages and Disadvantages of Vector and Raster Model  6. Database Management System • Database Management System o Tabular Data, Hierarchical Data, Network Data, Relational Database o Advantages and Disadvantages for each database management system o Purpose of Relational Database Management in GIS  o Construct Database Management in GIS  • Database Creation o Data Inputs, Editing, Classification, Analysis, Representation, Communication7. Data Quality, Issues, Ethics Identify the types of Errors  Track and manage Errors Monitor error propagation  Ethical Issues and Considerations   8. Costs and Benefits Analysis of Investing in GIS Costs – Direct and Indirect  Benefits – Direct and Indirect  Organization, User, Implementation, System Needs and Changes   Benefits and Limitations of using GIS Other applications of GIS",
    "mcs": 4,
    "prerequisites": "None",
    "preclusions": "",
    "corequisites": "",
    "hrs": 3,
    "remarks": ""
  },
  {
    "department": "GE",
    "level": 6,
    "sem": "1 and 2",
    "code": "GE6131",
    "type": "Core (Major)",
    "title": "Research in Geography",
    "description": "This course focuses on the completion of a Geography research paper. 1. Research Proposal:  Rationale for proposed research topic Research Problem Statement Research Questions  2. Literature Review  Critique of literature/sources for  theoretical insights  Relevance of literature to the proposed research   3. Methodology A written plan on the design of the  research investigation and method to  collect data Identify the chosen research  instrument   4. Research Paper  • A written paper consisting of the  essential components of a research  5. Qualifying Test • Presentation on proposed research topic/question, lit reviews and proposed methodology  6. Oral Presentation • Presentation of final research paper to a panel (consisting of teachers from other Humanities disciplines)",
    "mcs": 4,
    "prerequisites": "None",
    "preclusions": "",
    "corequisites": "",
    "hrs": 3,
    "remarks": "Year long course"
  },
  {
    "department": "GE",
    "level": 6,
    "sem": 2,
    "code": "GE6132",
    "type": "Core (Major)",
    "title": "Geography Insights V",
    "description": "This course examines the relationship between economic growth and human development. Students study the globalisation of economic activities, and how configurations of economic activities across space affect people. They gain insights into the economic, social, political and environmental factors that shapeand inlfuence how people interact with their environment and the world they live in. Students also explore the concept of development by looking at the standard developmental indicators used to measure development, as well as to examine the efforts by different countries to bring about development. The course highlights the connection between economic globalisation and the sustainable development goals (SDGs), especially in terms of decent work and economic growth, and reduced inequalities.",
    "mcs": 4,
    "prerequisites": "None",
    "preclusions": "",
    "corequisites": "",
    "hrs": 3,
    "remarks": ""
  },
  {
    "department": "HY",
    "level": 2,
    "sem": 1,
    "code": "HY2131",
    "type": "Core",
    "title": "History Studies I",
    "description": "This course focuses on the history of Southeast Asia during the late 19th century, and students will explore the reasons and processes of European colonisation in Southeast Asia.  The case studies of British Malaya and Dutch Indonesia will be examined.  Students will also gain an understanding of the impact of colonisation on Southeast Asia as well as the legacy of European dominance.",
    "mcs": 2,
    "prerequisites": "HU1131",
    "preclusions": "",
    "corequisites": "",
    "hrs": 2,
    "remarks": ""
  },
  {
    "department": "HY",
    "level": 3,
    "sem": 1,
    "code": "HY3131",
    "type": "Core",
    "title": "History Studies III",
    "description": "This course examines the issues and conflicts during the Cold War era in Europe and its impact on the world order in the post 1945 years.  It also covers problems and events leading to the collapse of communism in Eastern Europe and the Soviet Union.   A.  A New Era of International Relations  Outbreak and Developments of the Cold War Escalation of the Cold War: The role of Science and Technology in Space Development and Arms Race, Vietnam War and Korean War Effects of Cold War Conflicts on the World   B.  Weaknesses of the Command Economy and Communist System Gorbachev’s Reforms and his “New Thinking” Reasons for the Collapse of Communism and Breakup of the Soviet Empire  This course focuses on the decolonisation and emergence of nation-states in Southeast Asia.  Two case-studies of Malaya and Vietnam/Indonesia will be used to examine key factors that shaped the differing pathways and influence the struggles for independence of the countries. An awareness of the countries’ historical developments will provide students with a  better understanding of present-day issues that are unique to the region.  A. Decolonisation and emergence of Southeast Asia  1. Struggles for independence in Southeast Asia states in the post-WWII period  B.  Case study of Malaya  Re-establishment of British Rule and local responses   Establishment of independent Malaya  C. Case study of Vietnam  OR Attempts by French to re-establish French rule and local responses Reunification and establishment of independent Communist Vietnam D. Case study of Indonesia  Attempts by Dutch to re-establish Dutch rule and local responses Establishment of independent Indonesia",
    "mcs": 3,
    "prerequisites": "HY2132",
    "preclusions": "",
    "corequisites": "",
    "hrs": 3,
    "remarks": "Year long course"
  },
  {
    "department": "HY",
    "level": 4,
    "sem": 1,
    "code": "HY4131",
    "type": "Core (Major)",
    "title": "History Insights I",
    "description": "THE DEVELOPMENT OF THE COLD WAR (1945 - 1991) In this course, students will study the Cold War which resulted from the USA and USSR emerging as ideologically opposed superpowers after the Second World War.   These tensions, which largely began in Europe, extended to other parts of the world, where it interacted with forces such as nationalism and decolonisation to bring about profound changes. A. Emergence of the Cold War after the Second World War 1.Historical interpretations of the origins of the Cold War: traditional, revisionist, post-revisionist, post-Cold War  Causes for the emergence of tensions between USA and USSR Manifestations of emerging tensions: Yalta and Potsdam conferences, Sovietisation of Eastern Europe, the Iron Curtain Speech, Kennan’s Long Telegram, Truman, Doctrine, Marshall Plan, Berlin Blockade, NATO and Warsaw Pact B. Manifestations of the Global Cold War Korean War (1950 - 1953) Vietnam War (1959 - 1975) Cuban Missile Crisis (1962) C. End of the Cold War Historical interpretations of the end of the Cold War: Western triumphalist, Soviet initiative and \"People Power\" debates USA's policy of renewed confrontation and containment Decline of the USSR and shifts in Soviet foreign policy Eastern European movements and revolutions in the 1980s: Poland and East Germany",
    "mcs": 4,
    "prerequisites": "None",
    "preclusions": "",
    "corequisites": "",
    "hrs": 3,
    "remarks": ""
  },
  {
    "department": "HY",
    "level": 4,
    "sem": 2,
    "code": "HY4132",
    "type": "Core (Major)",
    "title": "History Insights II",
    "description": "CONFLICT AND COOPERATION (1945 - 2000) In this course, students will examine selected key inter-state and intra-state conflicts that took place during the post-WW2 period.  To mitigate the effects of these conflicts on international/regional peace and security, various actors that included the United Nations and ASEAN were involved in managing them.  Students will evaluate the effectiveness of the approaches taken by to manage these conflicts. A. Collective Security Role of the UN  Traditional Peacekeeping Complex Peacekeeping and Peacebuilding B. Inter-state Conflicts Causes: decolonisation, security, territorial sovereignty, nationalism, religion, economic interests Role of different actors: combatant states, the superpowers, the UN -Effectiveness of conflict management Case Studies: Indo-Pakistani Conflict (1947 - 1972) Arab-Israeli Conflict (1948 - 1979) C. Intra-state Conflicts Causes: domestic politics, economic interests, ethnic and religious nationalism Role of different actors: domestic state and non-state actors, major powers, theUN - Effectiveness of conflict management  Case Studies: Congo Crisis (1960 - 1965) Bosnian War (1992 - 1995) D.  Inter-state Tensions/Conflicts in Southeast Asia - Formation, growth and development of ASEAN - Causes and consequences of tensions/conflicts Case Studies: Third IndoChina War / Preah Vihear Dispute South China Seas Dispute Singapore-Malaysia Water Dispute / Pedra Branca Dispute (HI)",
    "mcs": 4,
    "prerequisites": "None",
    "preclusions": "",
    "corequisites": "",
    "hrs": 3,
    "remarks": ""
  },
  {
    "department": "HY",
    "level": 5,
    "sem": 1,
    "code": "HY5131",
    "type": "Core (Major)",
    "title": "History Insights III",
    "description": "FORMATION OF NATION-STATES AND ECONOMIC CHANGES IN SOUTHEAST ASIA (INDEPENDENCE - 2000) In this course, students will study how selected Southeast Asian countries formed nation-states after WW2.  The process was characterised by different groups competing to shape political development.  Efforts to form states were closely associated with the task of building nations to unite the different ethnic groups that lived within the territorial boundaries of the state - a legacy of colonial rule.  Students will also study the economic change in Southeast Asia after WW2.  Although some features of the pre-war economic landscape persisted, Southeast Asian economies experienced significant changes that were shaped by the respective governments' ability to harness opportunities and mitigate the challenges brought about by domestic and international developments.   A. Establishing Political Structures and Legitimacy Factors for establishment of different forms of government Consolidation of power: role of government leaders, sources of power and legitimacy, political challenges and popular opposition, Cold War developments B. Pursuit of National Unity Need for national unity and the challenges of ethnic separatism Different approaches and outcomes of effort to build national unity C. Economic Change in Southeast Asia Pursuit of economic growth, equity and nationalism Changes and continuities within and across key sectors since independence Factors shaping economic change Outcomes of economic change",
    "mcs": 4,
    "prerequisites": "None",
    "preclusions": "",
    "corequisites": "",
    "hrs": 3,
    "remarks": ""
  },
  {
    "department": "HY",
    "level": 5,
    "sem": 2,
    "code": "HY5132",
    "type": "Core (Major)",
    "title": "History Insights IV",
    "description": "DEVELOPMENT OF THE GLOBAL ECONOMY (1945 - 2000) In this course, students will study the development of the global economy in the post-WW2 period.  Economic challenges, such as forces of protectionism, accompanied the growth of the global economy had an increasingly global impact, with diverse outcomes for different countries.  Situated within this changing global economy, the East Asian economies of post-war Japan and post-1978 China showcased how countries leveraged global economic changes to chart their own paths to economic development.  A. Growth and Challenges in the Global Economy1. Factors for the growth of the global economy  post-war economic reconstruction role of USA, Western Europe and Japan role of MNCs, international organisations and arrangements (Bretton Woods, World Bank, IMF) 2. Challenges in the Global Economy 1973 and 1979 oil crises Protectionism (GATT and WTO) Debt crises of the 1980s B. Transformation of East Asian Economies  Japan (1947 - 1991) China (1978 -200) Hong Kong, South Korea and Taiwan (HI) C. Economic Cooperation in ASEAN Effectiveness of ASEAN in promoting regional economic cooperation Outcomes of ASEAN's efforts in promoting regional economic cooperation",
    "mcs": 4,
    "prerequisites": "None",
    "preclusions": "",
    "corequisites": "",
    "hrs": 3,
    "remarks": ""
  },
  {
    "department": "HY",
    "level": 6,
    "sem": "1 and 2",
    "code": "HY6131",
    "type": "Core (Major)",
    "title": "Research in History",
    "description": "RESEARCH IN HISTORY In this course, students will apply their understanding of how the past is constructed to conduct an individual inquiry into their chosen research history question.  Students will identify an area of historical interest, examine a variety of evidence, and interpret and evaluate the evidence to reach informed conclusions.  At the end of the independent research process, they will submit a 3500-word research essay based on a topic of their choice, which has to be approved in advance by the NUS High School Humanities Department.  A. Research Proposal Asking good questions for research in history Developing a literature scan and understanding its relationship with a good research question B. Research  Devising a research methodology to answer the research question Identifying repositories of resources relevant to the research question C. Writing Analysing sources in relation to their historical setting Assessing sources for validity, reliability, etc Formulating an argument that answers the research question Organising and structuring te argument Referencing and citation D. Reflection Managing bias in reading and selecting sources Limitations of sources in constructing historical narratives Contributions and limitations of the research in relation to the research in relation to the research question and topic",
    "mcs": 4,
    "prerequisites": "None",
    "preclusions": "",
    "corequisites": "",
    "hrs": 3,
    "remarks": "Year long course"
  },
  {
    "department": "HY",
    "level": 6,
    "sem": 2,
    "code": "HY6132",
    "type": "Core (Major)",
    "title": "History Insights V",
    "description": "HISTORY OF IDEAS This course focuses on the development of selected key ideas (from the \"west\") that underpin contemporary society.  It revolves around the history of science andpolitical theory, and the history of history.  Students will examine the origins and impact of the Scientific Revolution as well as the theory of evolution and their impact on society.  They will examine the development of the modern traditions of liberalism and socialism that continue to dominate social-political debate today. Students will also be equipped with a theoretical understanding of the nature of history, and critically appraise how the past of is interpreted, portrayed and represented.   A. History of Science and Society The Scientific Revolution Scientific Revolution and Faith Evolution and Society  B. History of Social and Political Thought in the 19th and 20th century Social Construct Theory: Locke, Hobbes and Rousseau British Liberalism  Marxism Keynes and post-war consensus Neoliberalism C: Investigating History History as accounts of the past: empiricist history, history as an interpretation of the past, post-modernist history How and why different historical accounts are constructed: history and national narratives, historical contexts that shaped the writing of history and historiographical developments The nature of evidence in history: use of sources to construct historical knowledge",
    "mcs": 4,
    "prerequisites": "None",
    "preclusions": "",
    "corequisites": "",
    "hrs": 3,
    "remarks": ""
  },
  {
    "department": "MU",
    "level": 1,
    "sem": "1 or 2",
    "code": "MU1134",
    "type": "Core",
    "title": "Foundations in Music",
    "description": "The course introduces music in context with the world/environment we live in; and that music can be much more connected to subjects such as Math and Science. This inter-disciplinary approach seeks to re-visit the once natural coexistence of the subjects and uncover the similarities between them. Students create and perform music in both vocal and instrumental (percussion) settings, listen and respond to music of different timbre. The course also aims to provide a process-oriented and interactive platform for inquisition and play.  By the end of the semester, students would have developed and cultivated aesthetic values in music so to allow lifelong learners.",
    "mcs": 2,
    "prerequisites": "Positive Learning Attitude and Growth Mindset",
    "preclusions": "",
    "corequisites": "",
    "hrs": 2,
    "remarks": ""
  },
  {
    "department": "MU",
    "level": 2,
    "sem": 1,
    "code": "MU2134",
    "type": "Core",
    "title": "Basic Musicianship",
    "description": "This course aims to acquaint students with fundamental aspects of music, fostering an understanding of musical principles and honing the skills essential for expressive musical communication. The course encompasses foundational ear-training and singing, delving into various facets such as music notation, duration, harmony, terminology, and symbols. Additionally, the course addresses the art of crafting melodies and lyrics, along with collaborative ensemble playing.",
    "mcs": 2,
    "prerequisites": "MU1134",
    "preclusions": "",
    "corequisites": "",
    "hrs": 2,
    "remarks": ""
  },
  {
    "department": "MU",
    "level": 2,
    "sem": 2,
    "code": "MU2135",
    "type": "Core",
    "title": "Music in Society (Asian)",
    "description": "This course introduces students to the essential role of music in society, focusing on understanding musical principles and developing the skills necessary for expressive and meaningful musical communication. Students will explore the rich musical heritage of Asian cultures through themes such as national anthems, festive music, dance, and theatre music, while engaging in creative analysis and collaborative activities. Through this course, students will be inspired to connect with music on both technical and cultural levels, equipping them for creative and informed engagement with the broader musical world.  By the end of semester, students will: -enhance purposeful listening skills to identify and appreciate diverse musical sounds. -cultivate an open-minded perspective toward the music of various cultures, recognizing its societal significance. -fosters a deeper appreciation of music’s role in society while building students’ technical and creative capacities.",
    "mcs": 2,
    "prerequisites": "MU2134",
    "preclusions": "",
    "corequisites": "",
    "hrs": 2,
    "remarks": ""
  },
  {
    "department": "MU",
    "level": 3,
    "sem": 1,
    "code": "MU3234",
    "type": "Core",
    "title": "Music in Society (Western)",
    "description": "This course enhances students' listening and musical appreciation skills by exploring music across diverse eras and genres, including symphonies, operas, chamber music, concertos, and contemporary compositions. Students will examine the dynamic relationship between music, art, society, and national identity. The course emphasizes the aesthetic qualities of musical works, delving into how these qualities function and influence listeners on emotional and intellectual levels. Critical listening is approached as an active and creative process, fostering intellectual engagement that leads to deeper emotional and aesthetic experiences.By the end of the semester, students will  -cultivate purposeful listening skills and heightened aural awareness of musical elements.  -enhance the ability to describe and analyse the structure and expression of various musical styles and compare different forms of music.  -develop a deeper appreciation and understanding of music as an art form.",
    "mcs": 3,
    "prerequisites": "MU2135",
    "preclusions": "",
    "corequisites": "",
    "hrs": 3,
    "remarks": ""
  },
  {
    "department": "MU",
    "level": 3,
    "sem": 2,
    "code": "MU3135",
    "type": "Core",
    "title": "Elements of Music Theory",
    "description": "This course spirals to the next level of music theory for students who have already attained ABRSM Grade 3 / 4 Music Theory or have completed Basic Musicianship.  It covers the basic form and analysis of music, various clefs, irregular time signatures, usage of triads and chords in harmonization, basic compositional devices, ornaments, instruments of the orchestra, transposition and arrangement, etc.  Majoring students (without the earned certificate) must sit for the external examination: ABRSM Grade 5 Music Theory.",
    "mcs": 3,
    "prerequisites": "MU3134",
    "preclusions": "",
    "corequisites": "",
    "hrs": 3,
    "remarks": ""
  },
  {
    "department": "MU",
    "level": 4,
    "sem": "1 and 2",
    "code": "MU4134",
    "type": "Core (Major)",
    "title": "Music Studies",
    "description": "Music Studies offers a comprehensive exploration of tonal/atonal organization in 18th- to 20th-century music, with a focus on harmony, figured bass, musical forms, and advanced analytical techniques. It also delves into the principles of composition and instrumentation, aimed at enhancing students' creativity through guided exercises in diverse forms of musical composition. Key topics include melodic ornamentation, suspension techniques, modulation, advanced four-part writing, as well as the use of diatonic secondary seventh chords, the Neapolitan 6th, diminished 7th, and augmented 6th chords. Instrumentation will cover orchestral instrument ranges, techniques, and timbres, while orchestration topics will address challenges in scoring, transcription, and vocal transpositions. Students will also gain skills in identifying and analysing compositions across a wide range of genres and styles.  Coursework will involve writing an analytical or comparative essay on selected compositions, offering insights into stylistic developments and the evolution of musical forms. Practical applications will include harmonizing melodies, rewriting chorale passages, transcribing sonata movements, and refining melodic writing for treble instruments and basso continuo. Students will also have the opportunity to arrange and score for piano, choral ensembles, orchestras, bands, and chamber groups, working with both existing works and their own original compositions.  By the end of the semester, students would have  -gained proficiency in music technology, with practical experience using music notation software such as MuseScore, Dorico, or Finale.  -developed a foundational understanding of MIDI sequencing tools like GarageBand and Band Lab for composing and arranging.Majoring students are strongly encouraged to sit for the ABRSM Grade 8 Music Theory exam, further advancing their theoretical knowledge and expertise.",
    "mcs": 4,
    "prerequisites": "MU3135. For nontrack, you will need to meet the stipulated criteria for considerati on: 1. Successfully audition on the primary instrument with a minimum proficiency of Grade 5. 2. Obtain a Grade 5 Music Theory certificate with at least a Merit, or achieve an 'A' on the writtendiagnostic test. 3. Participate in an interview.",
    "preclusions": "",
    "corequisites": "",
    "hrs": 3,
    "remarks": "Refer to criteria checklist for eligibility to major."
  },
  {
    "department": "MU",
    "level": 5,
    "sem": "1 and 2",
    "code": "MU5135",
    "type": "Core (Major)",
    "title": "Music Showcase",
    "description": "Music Showcase is an engaging course that combines ear-training, sightsinging, conducting, and ensemble performance to prepare students for a collaborative and expressive final presentation. Through targeted exercises, students will refine their ability to recognize melodies, harmonies, rhythms, intervals, and scales, while developing conducting and performance techniques.  At its core, the course fosters collaboration, encouraging meaningful musical dialogue and teamwork. The final performance showcases students’ growth in musicianship, creativity, and ensemble skills, reflecting their technical and artistic development through instrumental playing, singing, and optional acting or dancing.  This holistic approach equips students with the technical and expressive skills necessary for effective musical collaboration. The Music Showcase serves not only as a platform for performance but as a testament to the students’ journey of growth, creativity, and mastery as part of a unified ensemble.",
    "mcs": 4,
    "prerequisites": "MU4134",
    "preclusions": "",
    "corequisites": "",
    "hrs": 3,
    "remarks": ""
  },
  {
    "department": "MU",
    "level": 6,
    "sem": "1 and 2",
    "code": "MU6235",
    "type": "Elective",
    "title": "Music Performance",
    "description": "This course prepares music majors for their recital through an in-depth study of technical mastery, stylistic interpretation, and artistic growth. Students will explore performance practices from Baroque to Contemporary eras, focusing on stylistic elements, ornamentation, and cultural traditions. Emphasis is placed on understanding the historical, philosophical, and cultural contexts of music to foster interpretive depth and respect for diversity.  Beyond performance, the course explores broader themes such as the social, psychological, and pedagogical roles of music education. Through discussions and assignments, students will engage with the social and educational dimensions of music, enhancing their critical thinking and creative problem-solving skills. To deepen their understanding, students will submit a research paper on a topic related to performance or composition, supported by representative recordings, literature, and multimedia resources.  Key requirements include:  a 40–50-minute recital showcasing the primary instrument (performed from memory), with an option for a secondary instrument. achieving ABRSM Grade 8 (or equivalent) proficiency on the primaryinstrument.  completing two mini-performances, including a lecture recital. passing a jury evaluation one month before the recital. submitting a research paper on a performance or composition topic.   Throughout the course, students will be guided in repertoire selection and performance preparation. The goal is to ensure that their final performance demonstrates technical excellence, cultural awareness, and artistic growth.",
    "mcs": 4,
    "prerequisites": "MU5135",
    "preclusions": "",
    "corequisites": "",
    "hrs": 3,
    "remarks": "Students must have attained a minimum standard of ABRSM Grade 8 or equivalent for the primary musical instrument. For the optional second instrument, a minimum ABRSM Grade 5 or equivalent."
  },
  {
    "department": "AR",
    "level": 1,
    "sem": "1 or 2",
    "code": "AR1134",
    "type": "Core",
    "title": "Foundations in Art",
    "description": "Foundations in Art invites students to discover art as a creative lens and investigative tool to understand the world and environment we live in. Through this interdisciplinary approach, the deeper connection and natural coexistence of art and other subjects, such as Math and Science, are uncovered. The course also aims to provide a process-oriented and interactive platform for inquisition and play. Students will learn relevant and significant art terms and art history to support the understanding of the course.",
    "mcs": 2,
    "prerequisites": "Postivie Learning Attitude and Growth Mindset",
    "preclusions": "",
    "corequisites": "",
    "hrs": 2,
    "remarks": ""
  },
  {
    "department": "AR",
    "level": 2,
    "sem": 1,
    "code": "AR2134",
    "type": "Core",
    "title": "Elements of 2D Art & Design",
    "description": "This course introduces art fundamentals in theory and practice. Students will learn and apply the elements of art in a variety of ways to create unique and diverse works of art in different mediums. Concurrently, they acquire essential knowledge of the terminology to facilitate the contextual appreciation and description of art. The course also aims to provide students with an environment for inquiry, imagination and selfexpression through discussion and artmaking.",
    "mcs": 2,
    "prerequisites": "AR1134",
    "preclusions": "",
    "corequisites": "",
    "hrs": 2,
    "remarks": ""
  },
  {
    "department": "AR",
    "level": 2,
    "sem": 2,
    "code": "AR2135",
    "type": "Core",
    "title": "Principles of 2D Art & Design",
    "description": "This course delves deeper into the art fundamentals in theory and practice. Students will learn and apply the principles of art in a variety of ways to create unique and diverse works of art in different mediums. Concurrently, they acquire essential knowledge of the terminology to facilitate the contextual description and analysis of art. The course also aims to provide students with an environment for inquiry, imagination and self-expression through discussion and artmaking.",
    "mcs": 2,
    "prerequisites": "AR2134",
    "preclusions": "",
    "corequisites": "",
    "hrs": 2,
    "remarks": ""
  },
  {
    "department": "AR",
    "level": 3,
    "sem": 1,
    "code": "AR3134",
    "type": "Core",
    "title": "Creative Visual Art I",
    "description": "Creative Visual Art I embarks students on a creative practice of art and design while incorporating influences from relevant art history, theories and movements. To develop their skills, artmaking techniques in both 2D and mixed media will equip students with visual strategies to create innovative representations through problemsolving and creative thinking. Students will begin to build a portfolio based on their explorations and practice in this course. The course also aims to provide students with an environment to sharpen their critical thinking and communication skills through using Feldman’s Model of Art Criticism, namely:  Describe, Analyze, Interpret and Evaluate (DAIE).",
    "mcs": 3,
    "prerequisites": "AR2135",
    "preclusions": "",
    "corequisites": "",
    "hrs": 3,
    "remarks": ""
  },
  {
    "department": "AR",
    "level": 3,
    "sem": 2,
    "code": "AR3135",
    "type": "Core",
    "title": "Creative Visual Art II",
    "description": "Creative Visual Art II delves deeper into the creative practice and process of art and design by using a variety of methods while incorporating influences from relevant art history, theories and movements. To further develop their skills, artmaking techniques across the spectrum of art in 2D, 3D and mixed media will challenge students in visual conception and representations through project-based learning and creative thinking. Students will continue to build on the portfolio based on their explorations and practice in this course. The course also aims to provide students with an environment to sharpen their critical thinking and communication skills through using Feldman’s Model of Art Criticism, namely:  Describe, Analyze, Interpret and Evaluate (DAIE).",
    "mcs": 3,
    "prerequisites": "AR3134",
    "preclusions": "",
    "corequisites": "",
    "hrs": 3,
    "remarks": ""
  },
  {
    "department": "AR",
    "level": 3,
    "sem": "1 and 2",
    "code": "AR3331",
    "type": "Enrichment",
    "title": "Ceramictivity",
    "description": "Discover the art of shaping clay with your hand. You will learn techniques such as slab rolling, coil construction with an introduction to the slab roller and other ceramics tools. This enrichment will focus on the fundamentals of hand building, from creating a piece to glazing and firing it. Ceramictivity is not just about creating art; it's about expressing yourself through the tactile and therapeutic process of working with clay. This course promises to be a rejuvenating experience that allows you to tap into yourcreativity and explore the limitless possibilities of ceramic art.   By the end of the course, students would have been able to: develop and cultivate aesthetic values in art so to allow lifelong learners. acquire self-awareness and apply self-management skills to achieve personal wellbeing and effectiveness. acquire social awareness and apply interpersonal skills to build and maintain positive relationships based on mutual respect.",
    "mcs": 2,
    "prerequisites": "No prior experience is required - just bring your enthusiasmand a willingness to learn!",
    "preclusions": "",
    "corequisites": "",
    "hrs": 2,
    "remarks": "8 weeks course or 34 intensive days"
  },
  {
    "department": "AR",
    "level": 4,
    "sem": "1 and 2",
    "code": "AR4134",
    "type": "Core (Major)",
    "title": "Visual Art & Society",
    "description": "Visual Art & Society deepens students’ knowledge of art and design as they expand, refine, and connect their 2D and mixed-media skills, through hands-on creative explorations and practice, with the study of art history. Students will focus on a specific area of investigation during the artmaking process, culminating in a portfolio of works. Authentic assignments, including a visual art task and an art showcase, provide students with opportunities to apply their learning in meaningful ways.  The course emphasizes the use of Feldman’s model of art criticism, encouraging an indepth understanding of art terminologies as tools for effective communication and writing about art. Through rigorous theory and studio practice, students develop critical and creative thinking skills, as well as visual strategies, to enhance their formal and technical approaches.  By the end of the course, students would be able to: -describe, analyze, and evaluate images, interpreting artworks and integrating insights into their artmaking processes. -produce artworks that demonstrate strengths in selected mediums and material use. -become self-directed learners, actively questioning and reflecting on the visual qualities of artworks. -develop independent and critical thinking skills, confidently creating a comprehensive portfolio. -gain experience in preparing and planning for the semester-end Art Showcase.",
    "mcs": 4,
    "prerequisites": "AR3135.  For nontrack, you will need to meet the stipulated criteria for considerati on: 1. Art portfolio 2. A written paper on the Study of Visual Arts (SOVA)/ on visual art of curating and exhibition. 3. Participate in an interview.",
    "preclusions": "",
    "corequisites": "",
    "hrs": 3,
    "remarks": "Refer to criteria checklist for eligibility to major"
  },
  {
    "department": "AR",
    "level": 5,
    "sem": "1 and 2",
    "code": "AR5135",
    "type": "Core (Major)",
    "title": "Visual Art Showcase",
    "description": "The Visual Art Showcase is a dynamic exploration of two portfolio types—2-D Design and Drawing—integral to advanced studio practice, with 3-D art forms included as a complementary addition where suitable. This course guides students in refining their artistic portfolios, emphasizing three critical areas: 1. Quality: Mastery of craftsmanship and the thoughtful articulation of artistic intent. 2. Focused Inquiry: A focused exploration of materials, processes, and ideas, integrating practice, experimentation, and refinement to develop and enhance 2D design and drawing skills. 3. Curated Pieces: The synthesis of materials, processes, and ideas through carefully curated pieces integral to the portfolio type.  The course explores significant art-making approaches from pre-modern tocontemporary eras, enabling students to critically analyze the evolution of visual imagery. Guided by Feldman’s model of criticism, students articulate and write about art, deepening their engagement with aesthetic theories and historical contexts. This theoretical foundation enhances their creative strategies and critical analysis skills in preparing for an Art Showcase.  Through a comprehensive integration of studio practice, critical theory, and reflective analysis, students emerge from the Visual Art Showcase with heightened creativity, critical thinking, and a profound appreciation for art’s transformative power. This course equips students to navigate the artistic landscape with confidence, encouraging critical thinking and thoughtful engagement with cultural and societal issues.",
    "mcs": 4,
    "prerequisites": "AR4134",
    "preclusions": "",
    "corequisites": "",
    "hrs": 3,
    "remarks": ""
  },
  {
    "department": "AR",
    "level": 6,
    "sem": "1 and 2",
    "code": "AR6235",
    "type": "Elective",
    "title": "Art Graduation Show",
    "description": "The Art Graduation Show marks the culmination of students' artistic journeys at NUS High School, showcasing their learning, growth, and creative achievements. The process involves meticulous planning, conceptualization, and curation for an art exhibition. Students will present their past and current artworks thematically, reflecting their individual artistic development, within the school premises. Additionally, they will present their body of work to a panel of judges, which includes two art teachers and an external assessor.  Art majors have the option to consolidate a portfolio for submission to and evaluation by an external examination board, choosing between two categories: 2-D Design or Drawing. This forms an integral part of their studio practice. In preparing the portfolio, students must address key criteria: (1) the quality of the artwork, (2) a focused exploration of materials, processes, and ideas, and (3) the synthesis of these elements.  Art majors are also required to write a research paper on a topic of their choice, which is grounded in art theory and supported by an appropriate theoretical framework.",
    "mcs": 4,
    "prerequisites": "AR5135",
    "preclusions": "",
    "corequisites": "",
    "hrs": 3,
    "remarks": ""
  },
  {
    "department": "DV",
    "level": 1,
    "sem": "1 or 2",
    "code": "DV1132",
    "type": "Core",
    "title": "Design & Engineering",
    "description": "This semester-long course aims to give students the intermediate skills they need to turn their ideas into reality. This course will build on the skills taught in DV1131. Students will learn to work with wood and plastics, as well as basic electronics. They will also be introduced to computer-aided design software",
    "mcs": 0,
    "prerequisites": "None",
    "preclusions": "",
    "corequisites": "",
    "hrs": 2,
    "remarks": ""
  },
  {
    "department": "DV",
    "level": 1,
    "sem": "1 or 2",
    "code": "DV1133",
    "type": "Core",
    "title": "Science Presentations",
    "description": "Scientists, engineers and mathematicians need specific presentation skills. It is essential that scientists are able to communicate effectively with each other as well as with the general public.  This course will aim to allow students to acquire basic scientific presentation skills and practise them on their peers.  By listening to each other’s presentations, students will get exposed to a variety of presentation skills as well as get to learn interesting facts from each other. Students will also be encouraged to ask and think about critical questions pertaining to the research process.",
    "mcs": 0,
    "prerequisites": "None",
    "preclusions": "",
    "corequisites": "",
    "hrs": 2,
    "remarks": ""
  },
  {
    "department": "DV",
    "level": 2,
    "sem": "1 and 2",
    "code": "DV2134",
    "type": "Core",
    "title": "Junior Maker",
    "description": "In this course, students will learn to code and control hardware using an Arduino board. In this way, they will be introduced to the basics of using the inputs from sensors and other devices to control output devices to achieve a given objective. Students will get a rich hands-on experience and will need to complete a simple project.",
    "mcs": 0,
    "prerequisites": "None",
    "preclusions": "",
    "corequisites": "",
    "hrs": 3,
    "remarks": "Students will take eithter DV2134, DV2135 or DV2136 in Year 2"
  },
  {
    "department": "DV",
    "level": 2,
    "sem": "1 and 2",
    "code": "DV2135",
    "type": "Core",
    "title": "Junior Science Research",
    "description": "In this course, students will be taught the scientific method, its merits and limitations and how to systematically make enquiry into science. Students will propose a research topic of their own choice which will be reviewed and approved by their teachers. They will design, structure and carry out the project in small teams and deliver a report and presentation at the end of their project.",
    "mcs": 0,
    "prerequisites": "None",
    "preclusions": "",
    "corequisites": "",
    "hrs": 3,
    "remarks": "Students will take eithter DV2134, DV2135 or DV2136 in Year 2"
  },
  {
    "department": "DV",
    "level": 2,
    "sem": "1 and 2",
    "code": "DV2136",
    "type": "Core",
    "title": "Junior Math Research",
    "description": "In this course, students will be taught mathematics problem-solving skills and how to apply them in a mathematics project. Students are also taught the use of LaTeX to produce professional looking reports. Students will propose a research topic of their own choice which will be reviewed and approved by their teachers. They will design, structure and carry out the project in small teams and deliver a report and presentation at the end of their project.",
    "mcs": 0,
    "prerequisites": "None",
    "preclusions": "",
    "corequisites": "",
    "hrs": 3,
    "remarks": "Students will take eithter DV2134, DV2135 or DV2136 in Year 2"
  },
  {
    "department": "DV",
    "level": 3,
    "sem": "1 or 2",
    "code": "DV3131",
    "type": "Core",
    "title": "Research Methodology and Scientific Reading",
    "description": "Research is an integral component of science and mathematics. It is the vehicle for the advancement of these disciplines, both past and present. Thus, having a good understanding of various components of research and possessing good research skills will put one in a good stead for a career in math and science. In this course, we aim to introduce the basic framework which scientists and mathematicians follow to conduct their research work, i.e. the principles behind elucidating valid research findings, as well as the processes, skills and ethics needed to conduct, evaluate and communicate research well.",
    "mcs": 0,
    "prerequisites": "None",
    "preclusions": "",
    "corequisites": "",
    "hrs": 3,
    "remarks": "† Students will take DV3131 either in Semester 1 or 2."
  },
  {
    "department": "DV",
    "level": "3 or 4",
    "sem": 1,
    "code": "DV3231",
    "type": "Elective",
    "title": "Advanced Design and Engineering",
    "description": "This elective course aims to extend students’ understanding of the engineering design process through the application of math, science, and technology to create devices and systems that meet human needs.  Students will learn about engineering through realistic, hands-on problem-solving experiences.  This course will teach advanced skills that will enable thestudent to design and implement customized automation and data acquisition solutions to meet research and engineering goals.",
    "mcs": 0,
    "prerequisites": "DV2131",
    "preclusions": "",
    "corequisites": "",
    "hrs": 1.5,
    "remarks": ""
  },
  {
    "department": "DV",
    "level": "3 or 4",
    "sem": 2,
    "code": "DV3232",
    "type": "Elective",
    "title": "Innovation and Enterprise",
    "description": "This course will focus on the conceptualisation, design and development of technology orientated products and services. Students will learn about innovation, design thinking, and marketing. Students will have to work in groups to identify a problem, identify customer needs, establish product/service specifications, then design, plan and prototype a product. Students will need to be able to work in teams, be comfortable with presentations, and have a strong interest in design and innovation. There can also be guest lectures by entrepreneurs and founders of various start-ups. The course will also cover intellectual property and financial analysis.",
    "mcs": 0,
    "prerequisites": "None",
    "preclusions": "",
    "corequisites": "",
    "hrs": 1.5,
    "remarks": ""
  },
  {
    "department": "DV",
    "level": "3 or 4",
    "sem": 1,
    "code": "DV3235",
    "type": "Elective",
    "title": "Digital Electronics",
    "description": "In this course on digital electronics and logic design with VHDL, students will learn the digital electronics concepts from scratch and also learn VHDL programming concepts to design digital circuits by writing the programs in textual form mapped into digital with this front-end language of VHDL. VHDL stands for VHSIC Hardware Description Language. In turn, VHSIC stands for Very-High-Speed Integrated Circuit",
    "mcs": 0,
    "prerequisites": "None",
    "preclusions": "",
    "corequisites": "",
    "hrs": 2,
    "remarks": ""
  },
  {
    "department": "IP",
    "level": "4, 5 and 6",
    "sem": "1 and 2",
    "code": "IP",
    "type": "Core",
    "title": "Research/Innovati on Project",
    "description": "All students are required to complete and pass at least one Research or Innovation Project in the field of Math, Science or Engineering as an individual or in a team. Projects in other quantitative fields like economics may also be allowed. These projects may be linked to external programmes like the Science Mentorship Programme, Nanyang Research Programme, or the Young Defence Scientists’ Programme. Students can do these projects internally or at an external research organization. Students can also do more than one project if they have the passion and aptitude.",
    "mcs": 0,
    "prerequisites": "DV3131",
    "preclusions": "",
    "corequisites": "",
    "hrs": 0,
    "remarks": "*Research Projects are not assigned a course code but will be reflected in the student’s research transcript"
  },
  {
    "department": "GC",
    "level": 3,
    "sem": "1 and 2",
    "code": "GC3332",
    "type": "Enrichment",
    "title": "Wonderment Exploration",
    "description": "This Junior High enrichment course focuses on fostering wonderment learning. Students collaborate and delve into topics of their choice, shaping their own learning path. Following proposal approval, they have the opportunity to fine-tune their plans. This self-directed learning takes place during Year 2's final week of each semester, with the option to extend into the school holidays. Upon completing their group project, students present their achievements for assessment. The course's core aim is to cultivate selfdiscipline and ignite students' enthusiasm for acquiring skills and knowledge that go beyond the school's main curriculum.",
    "mcs": 2,
    "prerequisites": "None",
    "preclusions": "",
    "corequisites": "",
    "hrs": "",
    "remarks": ""
  }
]
